# needs to be tested for FP to adjust
title: High Volume of LDAP Requests to Domain Controller
description: Detects high volume of LDAP requests to a Domain Controller, potentially indicating LDAP enumeration or NTDS extraction attempt.
author: Amr Ashraf
status: Developed
logsource:
  category: firewall
  product: any
detection:
  selection:
    DestinationPort: 389
    EventType: 'connection'  # Adjust according to the firewall's event type for connection events
  timeframe: 1m
  condition: selection | count() by SourceIP > 100
fields:
  - SourceIP
  - DestinationIP
  - DestinationPort
  - EventType
level: high
tags:
  - attack.discovery
  - attack.t1482
  - attack.t1003.006
  - attack.credential_access
falsepositives:
  - High-volume LDAP traffic from legitimate services such as directory synchronization or backup solutions.
