title: Detect Symbolic Link Creation to Volume Shadow Copy
status: Developed
description: Detects the use of the `mklink` command to create symbolic links to Volume Shadow Copies, often used for dumping sensitive files like NTDS.dit.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    CommandLine|contains|all:
      - 'mklink'
      - '\\?\GLOBALROOT\Device'
  selection1:
    CommandLine|contains|any:
      - '/D'
      - '/H'
      - 'VolumeShadow'
  condition: selection and selection1
fields:
  - CommandLine
  - Image
  - ParentImage
  - ParentCommandLine
  - User
falsepositives:
  - Legitimate use by administrators for troubleshooting or maintenance
  - Authorized backup or recovery tasks
level: critical
tags:
  - attack.credential_access
  - attack.t1003.003
  - attack.persistence
  - attack.discovery
