title: Suspicious Process Patterns NTDS Exfil
description: Detects suspicious process patterns used in NTDS.DIT exfiltration
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.credential-access
    - attack.t1003.003
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_tool:
        # https://github.com/zcgonvh/NTDSDumpEx
        - CommandLine|contains|all:
              # ntdsdumpex.exe -d ntds.dit -o hash.txt -s system.hiv
              - 'ntds.dit'
              - 'system.hiv'
        - CommandLine|contains: NTDSgrab.ps1
    selection_oneliner_1:
        # powershell "ntdsutil.exe 'ac i ntds' 'ifm' 'create full c:\temp' q q"
        CommandLine|contains|all:
            - 'ac i ntds'
            - 'create full'
    selection_onliner_2:
        # cmd.exe /c copy z:\windows\ntds\ntds.dit c:\exfil\ntds.dit
        CommandLine|contains|all:
            - '/c copy '
            - '\windows\ntds\ntds.dit'
    selection_onliner_3:
        # ntdsutil "activate instance ntds" "ifm" "create full c:\windows\temp\data\" "quit" "quit"
        CommandLine|contains|all:
            - activate instance ntds
            - create full
    selection_powershell:
        CommandLine|contains|all:
            - powershell
            - ntds.dit
    set1_selection_ntds_dit:
        CommandLine|contains: ntds.dit
    set1_selection_image_folder:
        - ParentProcessName|contains:
              - \apache
              - \tomcat
              - \AppData\
              - \Temp\
              - \Public\
              - \PerfLogs\
        - NewProcessName|contains:
              - \apache
              - \tomcat
              - \AppData\
              - \Temp\
              - \Public\
              - \PerfLogs\
    condition: process_creation and (1 of selection* or all of set1*)
falsepositives:
    - Unknown
level: high

