title: Detect Unsecured Credentials in Files on Windows
id: detect-credentials-in-files-windows
status: Developed
description: Detects attempts to access, search, or manipulate files containing potential credentials on Windows systems.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - NewProcessName|endswith:
        - '\findstr.exe'
    - CommandLine|contains:
        - 'password'
        - 'key'
        - 'token'
        - 'secret'
  selection1:
    - FilePath|contains:
        - 'passwords.txt'
  condition: selection and selection1
fields:
  - Image
  - CommandLine
  - FilePath
  - ParentImage
  - User
  - Hostname
  - ProcessId
  - ParentProcessId
level: high
tags:
  - attack.credential_access
  - t1552.001
  - attack.unsecured_credentials
falsepositives:
  - Legitimate administrative or debugging tasks.
  - Scheduled scripts searching for sensitive information for compliance checks.
