title: Microsoft IIS Connection Strings Decryption
status: Developed
author: Amr Ashraf
date: 2024-12-01
description: |
    Detects the use of aspnet_regiis.exe to decrypt Microsoft IIS connection strings. This activity can be used by an attacker with access to an IIS web server to dump sensitive connection strings, including credentials for MSSQL service accounts.
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: 
            - "\\aspnet_regiis.exe"
        CommandLine|contains:
            - "connectionStrings"
            - "-pdf"
    condition: selection
fields:
    - Image
    - CommandLine
    - User
    - Hostname
falsepositives:
    - Legitimate use by administrators or developers to manage IIS configurations.
    - Debugging or maintenance activities involving connection strings.
level: high
tags:
    - attack.credential_access
    - attack.t1003
references:
    - https://blog.netspi.com/decrypting-iis-passwords-to-break-out-of-the-dmz-part-1/
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/greenbug-espionage-telco-south-asia
