title: Detect Exporting Credentials via KRShowKeyMgr in keymgr dll
status: Developed
description: Detects the use of rundll32.exe to execute the KRShowKeyMgr function in keymgr.dll, which can export stored Windows credentials to a file.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    Image: 'C:\Windows\System32\rundll32.exe'
    CommandLine|contains|all:
      - "keymgr.dll"
      - "KRShowKeyMgr"
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - ParentCommandLine
  - User
falsepositives:
  - Legitimate administrative or troubleshooting tasks using `keymgr.dll` for credential management
level: high
tags:
  - attack.credential_access
  - attack.t1003
  - attack.execution
