author: Zach Mathis
date: 2020/11/08
modified: 2022/12/16

title: 'Log Cleared'
description: 'A user has cleared the Security event log.'

id: c2f690ac-53f8-4745-8cfe-7127dda28c74
level: high
status: stable
logsource:
    product: windows
    service: security
detection:
    selection_basic:
        Channel: Security
        EventID: 1102
    condition: selection_basic
falsepositives:
    - system administrator
tags:
    - attack.defense_evasion
    - attack.t1070.001
references:
    - https://attack.mitre.org/techniques/T1070/001/
