title: Detect Clearing Logs Using wevtutil
status: Developed
description: Detects the use of `wevtutil` to clear Windows Event Logs, which may indicate an attempt to cover tracks or remove forensic evidence.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection_command:
    CommandLine|contains:
      - 'wevtutil'
      - 'cl'
  condition: selection_command
fields:
  - CommandLine
  - Image
  - User
  - ParentImage
falsepositives:
  - Legitimate use of `wevtutil` by administrators for maintenance tasks.
level: high
tags:
  - attack.defense_evasion
  - attack.t1070.001
