title: Detect Service Creation via WMI
description: Detects the creation of services via WMI commands.
status: Experimental
author: Amr Ashraf
logsource:
  product: windows
  service: wmi
detection:
  selection:
    EventID: 5861
    Message|contains|all: 
      - 'Create'
      - 'Win32_Service'
  condition: selection
fields:
 - EventID
 - Operation
 - TargetInstance
falsepositives:
 - Legitimate use of WMI for service creation
level: high
tags:
 - attack.persistence
 - attack.t1543.003