title: Detect Image Path Changes of Services
description: Detects modifications to the ImagePath registry value of services.
status: Experimental
author: Amr Ashraf
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4657
    ObjectName|contains: 'HKLM\SYSTEM\CurrentControlSet\Services\'
    ObjectValueName|contains: 'ImagePath'
  condition: selection
fields:
 - EventID
 - RegistryKey
 - RegistryValue
 - OldValue
 - NewValue
falsepositives:
 - Legitimate changes to service configurations
level: high
tags:
 - attack.persistence
 - attack.t1543.003