title: Detect Registry Changes about Service Creation
description: Detects modifications to registry keys under HKLM\SYSTEM\CurrentControlSet\Services, which can indicate service creation or modification.
status: Developed
author: Amr Ashraf
logsource:
  product: windows
  service: system
detection:
  selection:
    EventID: 4657
    ObjectName|contains: 'SYSTEM\CurrentControlSet\Services\'
  condition: selection
fields:
 - EventID
 - RegistryKey
 - RegistryValue
falsepositives:
 - Legitimate changes to service configurations
level: high
tags:
 - attack.persistence
 - attack.t1543.003