title: Detect Suspicious Process Creation
description: Detects the execution of commands that create services, such as using sc.exe, PowerShell, or Service Control Manager (SCM).
status: Experimental
author: Amr Ashraf
logsource:
  product: windows
  service: security
detection:
  selection1:
    EventID: 4688
    NewProcessName|contains: 'C:\\Windows\\System32\\sc.exe'
    CommandLine|contains: 'create'
  selection2:
    EventID: 4688
    NewProcessName|contains: 'powershell.exe'
    CommandLine|contains: 'New-Service'
  selection3:
    EventID: 4688
    NewProcessName|contains: 'services.exe'
    CommandLine|contains: 'create'
  condition: selection1 or selection2 or selection3
fields:
 - EventID
 - Image
 - CommandLine
falsepositives:
 - Legitimate use of service creation commands
level: high
tags:
 - attack.persistence
 - attack.t1543.003
VQL:
  LET ID_1134 = (
    (NewProcessName =~ "C:\\\\Windows\\\\System32\\\\sc\\.exe" AND CommandLine =~ "create") OR
    (NewProcessName =~ "powershell\\.exe" AND CommandLine =~ "New-Service") OR
    (NewProcessName =~ "services\\.exe" AND CommandLine =~ "create")
  )