# needs FP testing for whitelisting
title: Detect New Service Installation
description: Detects the creation of new services in Windows.
status: Experimental
author: Amr Ashraf
logsource:
  product: windows
  service: system
detection:
  selection:
    EventID: 7045
  condition: selection
fields:
 - EventID
 - ServiceName
 - ImagePath
falsepositives:
 - Legitimate service installations
level: high
tags:
 - attack.persistence
 - attack.t1543.003