title: Exporting Exchange Mailbox via PowerShell
description: Detects the use of the Exchange PowerShell cmdlet, New-MailBoxExportRequest, to export the contents of a primary mailbox or archive to a .pst file. This activity could indicate adversaries targeting user email to collect sensitive information.
status: Developed
date: 2024-12-01
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName:
      - "powershell.exe"
      - "pwsh.exe"
      - "powershell_ise.exe"
    CommandLine|contains:
      - "*MailboxExportRequest*"
      - "*-Mailbox*-ContentFilter*"
  condition: selection
fields:
  - NewProcessName
  - CommandLine
falsepositives:
  - Legitimate Exchange system administration activity
level: medium
tags:
  - attack.collection
  - attack.execution
  - attack.T1005
  - attack.T1114
  - attack.T1114.002

