title: Detect Loading of Compression Libraries
status: Developed
description: Detects processes loading known compression libraries for archiving data.
author: Amr Ashraf
logsource:
  category: dll_loading
  product: windows
detection:
  selection:
    EventID: 7
    Image|endswith:
      - '.exe'
      - '.py'
      - '.dll'
    ImageLoaded|contains:
      - 'zlib.dll'
      - 'libarchive.dll'
      - 'SharpZipLib.dll'
      - '7z.dll'
  condition: selection
fields:
  - Image
  - ImageLoaded
level: medium
tags:
  - attack.collection
  - attack.exfiltration
  - t1560.002
falsepositives:
  - Legitimate applications using compression libraries

