title: Exporting Exchange Mailbox via PowerShell
description: Detects the use of the Exchange PowerShell cmdlet, New-MailBoxExportRequest, to export the contents of a primary mailbox or archive to a .pst file. This activity could indicate adversaries targeting user email to collect sensitive information.
status: Developed
date: 2024-12-01
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    process_name:
      - "powershell.exe"
      - "pwsh.exe"
      - "powershell_ise.exe"
    command_line:
      - "*MailboxExportRequest*"
      - "*-Mailbox*-ContentFilter*"
  condition: selection
fields:
  - process_name
  - command_line
  - parent_process_name
  - user_id
falsepositives:
  - Legitimate Exchange system administration activity
level: medium
tags:
  - attack.collection
  - attack.execution
  - attack.T1005
  - attack.T1114
  - attack.T1114.002
  - attack.T
