title: Detect Disabling ASLR
id: detect-disabling-aslr
status: Developed
description: Detects attempts to disable Address Space Layout Randomization (ASLR) by modifying registry keys.
author: Amr Ashraf
date: 2024-11-24
logsource:
  category: registry
  product: windows
detection:
  selection:
    EventID: 4657
    RegistryKey:
      - 'HKLM\\SYSTEM\\CurrentControlSet\\Control\\Session Manager\\Memory Management'
    RegistryValueName: 'DisableRandomization'
    NewValue: '1'
  condition: selection
fields:
  - EventID
  - RegistryKey
  - RegistryValueName
  - NewValue
  - User
  - ProcessName
level: high
tags:
  - attack.defense_evasion
  - attack.t1574.002
falsepositives:
  - Legitimate administrative actions or testing
  - System misconfigurations or updates
