title: Detect UAC Disabling via Registry
id: detect-uac-disabling
status: Developed
description: Detects attempts to disable User Account Control (UAC) by modifying registry settings.
author: Amr Ashraf
logsource:
  category: registry
  product: windows
detection:
  selection:
    EventID: 4657
    RegistryKey: 'HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System'
    RegistryValueName: 'EnableLUA'
    NewValue: '0'
  condition: selection
fields:
  - EventID
  - RegistryKey
  - RegistryValueName
  - NewValue
  - User
level: high
tags:
  - attack.defense_evasion
  - attack.t1088
falsepositives:
  - Legitimate administrative configuration changes
