title: Detect LOLBins Used for Process Injection
id: detect-lolbins-injection
status: Developed
description: Detects use of legitimate binaries (LOLBins) like regsvr32.exe or msbuild.exe for process injection.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    NewProcessName|endswith:
      - '\regsvr32.exe'
      - '\msbuild.exe'
      - '\rundll32.exe'
    CommandLine|contains: 
      - '/i:'  # Injecting DLL
      - '/s'   # Silent injection
  filter:
    ParentProcessName|endswith: '\tmccsf.exe'
  condition: selection
fields:
  - Image
  - CommandLine
  - ParentImage
  - User
level: high
tags:
  - attack.execution
  - attack.persistence
  - t1055
falsepositives:
  - Rare; legitimate administrative tasks
