title: Detect NULL Scan
description: Detects TCP packets with no flags set, indicative of a NULL Scan.
status: Developed
author: Amr Ashraf
date: 2024/11/03
logsource:
  category: firewall
  product: any
detection:
  selection:
    packet_flags: 'NULL'
  condition: selection | count() by source_ip > 20 within 1m
fields:
  - source_ip
  - dest_ip
  - dest_port
  - packet_flags
falsepositives:
  - Certain network appliances or misconfigured software could generate NULL packets under rare circumstances
level: medium
tags:
  - attack.reconnaissance
  - attack.t1046
