title: Potential PowerShell Command Line Obfuscation
description: Detects the PowerShell command lines with special characters
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1027
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith:
              - \powershell.exe
              - \pwsh.exe
        - OriginalFileName:
              - PowerShell.EXE
              - pwsh.dll
    selection_re:
        
        - CommandLine|re: \+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+
        - CommandLine|re: \{.*\{.*\{.*\{.*\{.*\{.*\{.*\{.*\{.*\{
        - CommandLine|re: \^.*\^.*\^.*\^.*\^
        - CommandLine|re: '`.*`.*`.*`.*`'
    filter_optional_amazonSSM:
        ParentProcessName: C:\Program Files\Amazon\SSM\ssm-document-worker.exe
    filter_optional_defender_atp:
        CommandLine|contains:
            - new EventSource("Microsoft.Windows.Sense.Client.Management"
            - public static extern bool InstallELAMCertificateInfo(SafeFileHandle handle);
    condition: process_creation and (all of selection_* and not 1 of filter_optional_*)
falsepositives:
    - Amazon SSM Document Worker
    - Windows Defender ATP
level: high

