title: Base64 Encoded PowerShell Command Detected
description: Detects usage of the "FromBase64String" function in the commandline which is used to decode a base64 encoded string
rstatus: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.t1027
    - attack.defense-evasion
    - attack.t1140
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: '::FromBase64String('
    condition: selection
falsepositives:
    - Administrative script libraries
level: high
