title: Gzip Archive Decode Via PowerShell
description: Detects attempts of decoding encoded Gzip archives via PowerShell.
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.command-and-control
    - attack.t1132.001
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|all:
            - GZipStream
            - ::Decompress
    condition: process_creation and selection
falsepositives:
    - Legitimate administrative scripts may use this functionality. Use "ParentImage" in combination with the script names and allowed users and applications to filter legitimate executions
level: medium