title: Base64 MZ Header In CommandLine
description: Detects encoded base64 MZ header in the commandline
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.execution
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - TVqQAAMAAAAEAAAA   # MZ..........
            - TVpQAAIAAAAEAA8A
            - TVqAAAEAAAAEABAA
            - TVoAAAAAAAAAAAAA
            - TVpTAQEAAAAEAAAA
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: high

