title: Detect Execution of Base64-Encoded PowerShell Commands
status: Experimental
description: Detects the execution of PowerShell commands with the `-EncodedCommand` parameter, commonly used by adversaries for obfuscation and execution of malicious commands.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: '-EncodedCommand'
  condition: selection
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate use of `-EncodedCommand` for administrative or automated tasks
  - Scripts or tools using encoded commands for efficiency or security
level: high
tags:
  - attack.execution
  - attack.obfuscation
  - attack.t1059.001
VQL: |
  LET ID_1425 = (
      (NewProcessName =~ "\\powershell\\.exe$" OR NewProcessName =~ "\\pwsh\\.exe$") AND
      CommandLine =~ "(?=.*-EncodedCommand)"
  )
