# RE needs review
title: Powershell Token Obfuscation - Process Creation
description: Detects TOKEN OBFUSCATION technique from Invoke-Obfuscation
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.defense-evasion
    - attack.t1027.009
logsource:
    category: script_block
    product: windows
detection:
    selection:
        EventID: 4104
        # Examples:
        #   IN`V`o`Ke-eXp`ResSIOn (Ne`W-ob`ject Net.WebClient).DownloadString
        #   &('In'+'voke-Expressi'+'o'+'n') (.('New-Ob'+'jec'+'t') Net.WebClient).DownloadString
        #   &("{2}{3}{0}{4}{1}"-f 'e','Expression','I','nvok','-') (&("{0}{1}{2}"-f'N','ew-O','bject') Net.WebClient).DownloadString
        - ScriptBlockText|contains|re: 
            - '\w+`(\w+|-|.)`[\w+|\s]'
            - '"(\{\d\})+"\s*-f'
        #   ${e`Nv:pATh}
            - '(?i)\$\{`?e`?n`?v`?:`?p`?a`?t`?h`?\}'
    filter_main_envpath:
        CommandLine|contains: ${env:path}
    condition: selection and not 1 of filter_main_*
falsepositives:
    - Unknown
level: high

