title: Potential PowerShell Command Line Obfuscation
description: Detects the PowerShell command lines with special characters
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1027
    - attack.t1059.001
logsource:
    category: script_block
    product: windows
detection:
    selection:
        - EventID: 4104
        - ScriptBlockText|contains|re: 
            - '\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+'
            - '\{.*\{.*\{.*\{.*\{.*\{.*\{.*\{.*\{.*\{'
            - '\^.*\^.*\^.*\^.*\^'
            - '`.*`.*`.*`.*`'
    condition: selection
falsepositives:
    - Amazon SSM Document Worker
    - Windows Defender ATP
level: high

