title: Detect System Service Discovery via Command Line
status: Experimental
description: Detects the use of `tasklist.exe` and `sc query` commands to enumerate system services, often used during reconnaissance or privilege escalation attempts.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection_tasklist:
    EventID: 4688
    ParentProcessName|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
      - '\cmd.exe'
    NewProcessName|endswith: '\tasklist.exe'
  selection_sc_query:
    EventID: 4688
    NewProcessName|endswith: '\sc.exe'
    CommandLine|contains|re:
      - "query"
      - "query *state= all"
  condition: selection_tasklist or selection_sc_query
fields:
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate administrative or troubleshooting activities
  - System monitoring or performance analysis scripts
level: medium
tags:
  - attack.discovery
  - attack.t1007
VQL: |
  LET ID_1394 = (
      (
          (ParentProcessName =~ "\\powershell\\.exe$" OR ParentProcessName =~ "\\pwsh\\.exe$" OR ParentProcessName =~ "\\cmd\\.exe$") AND
          NewProcessName =~ "\\tasklist\\.exe$"
      ) OR
      (
          NewProcessName =~ "\\sc\\.exe$" AND
          (CommandLine =~ "(?=.*query|.*query \\*state= all)")
      )
  )
