title: Detect Reg Query for AlwaysInstallElevated Status
status: Experimental
description: Detects the use of `reg query` commands to check the AlwaysInstallElevated registry key status. If AlwaysInstallElevated is enabled, it can allow privilege escalation via MSI package installation with SYSTEM-level privileges.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith: '\reg.exe'
    CommandLine|contains:
      - "AlwaysInstallElevated"
  selection_hk:
    CommandLine|contains|all:
      - 'SOFTWARE\Policies\Microsoft\Windows\Installer'
  condition: selection and selection_hk
fields:
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate administrative tasks checking AlwaysInstallElevated settings
  - Troubleshooting or compliance scripts auditing registry configurations
level: high
tags:
  - attack.privilege_escalation
  - attack.t1546.014
  - attack.discovery
VQL:
  LET ID_1397 = (
    (NewProcessName =~ "\\reg\\.exe$" AND
    CommandLine =~ "(?=.*AlwaysInstallElevated)" AND
    CommandLine =~ "(?=.*SOFTWARE\\Policies\\Microsoft\\Windows\\Installer)")
  )
