title: Domain Trust Discovery via Nltest
status: Developed
description: Identifies the execution of nltest.exe with the `domain_trusts` parameter, used by attackers to enumerate Active Directory trusts.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - EventID: 4688
    - NewProcessName: "nltest.exe"
    - CommandLine|contains: "domain_trusts"
  condition: selection
fields:
  - ProcessName
  - CommandLine
  - ParentProcessName
  - ProcessPath
  - User
  - Hostname
level: medium
tags:
  - attack.discovery
  - t1482
falsepositives:
  - Legitimate administrative tasks querying domain trusts
VQL:
  LET ID_1260 = (
    NewProcessName =~ "nltest\\.exe" AND
    CommandLine =~ "(?=.*domain_trusts)"
  )
