title: Detect WMI Reconnaissance for Processes
status: Experimental
description: Detects the use of WMI to enumerate processes on the host via `wmic process get`.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    CommandLine|contains|all:
      - 'wmic '
      - 'process' 
      - ' get'
  condition: selection
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
falsepositives:
  - Legitimate administrative tasks
level: medium
tags:
  - attack.discovery
  - attack.t1057
VQL: |
  LET ID_1450 = (
      CommandLine =~ "(?=.*wmic\\ )(.*process)(.*\\ get)"
  )
