title: Domain Trust Discovery
status: Experimental
description: Detects commands used to enumerate a list of trusted domains, including the use of dsquery.exe and nltest.exe.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - EventID: 4688
    - ProcessName: "dsquery.exe"
    - CommandLine|contains: "(objectClass=trustedDomain)"
  selection_1:
    - NewProcessName: "nltest.exe"
    - CommandLine|contains: "domain_trusts"
  condition: selection and selection_1
fields:
  - ProcessName
  - CommandLine
  - ParentProcessName
  - ProcessPath
  - User
  - Hostname
level: medium
tags:
  - attack.discovery
  - t1482
falsepositives:
  - Legitimate administrative tasks querying domain trusts
VQL:
  LET ID_1261 = (
    (ProcessName == "dsquery.exe" AND CommandLine =~ "(?=.*\\(objectClass=trustedDomain\\))") AND
    (NewProcessName == "nltest.exe" AND CommandLine =~ "(?=.*domain_trusts)")
  )