title: Detect Suspicious Registry Queries via reg query
status: Developed
description: Detects the use of `reg query` commands to enumerate registry keys, often used for reconnaissance or persistence discovery.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith: '\reg.exe'
    CommandLine|contains:
      - 'Software\Microsoft\Windows\CurrentVersion\Run'
      - 'Software\Microsoft\Windows\CurrentVersion\Run'
      - 'Software\Microsoft\Windows NT\CurrentVersion\Winlogon'
      - 'SOFTWARE\Microsoft\Windows\CurrentVersion\ShellServiceObjectDelayLoad'
      - 'system\currentcontrolset\services'
      - 'SOFTWARE\Microsoft\Active Setup\Installed Components'
      - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\Run'
      - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\Run'
  selection1:
    CommandLine|contains:
      - 'query'
  condition: selection and selection1
fields:
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate administrative tasks querying registry keys
  - Troubleshooting or performance monitoring scripts
level: medium
tags:
  - attack.discovery
  - attack.persistence
  - attack.t1012
VQL: |
  LET ID_1395 = (
      (NewProcessName =~ "\\reg\\.exe$") AND
      CommandLine =~ "(?=.*Software\\Microsoft\\Windows\\CurrentVersion\\Run|.*Software\\Microsoft\\Windows\\CurrentVersion\\Run|.*Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon|.*SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\ShellServiceObjectDelayLoad|.*system\\currentcontrolset\\services|.*SOFTWARE\\Microsoft\\Active Setup\\Installed Components|.*SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run|.*SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run)" AND
      CommandLine =~ "query"
  )
