title: Detect WMI Enumeration of Active Directory Computers via PowerShell
status: Developed
description: Detects the use of PowerShell to query WMI for Active Directory computer objects via the `ds_computer` class in the `root\directory\ldap` namespace. This activity is indicative of reconnaissance.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    CommandLine|contains|all:
      - 'get-wmiobject'
      - '-class' 
      - 'ds_computer'
      - '-namespace'
      - 'root\directory\ldap'
  condition: selection
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate administrative tasks or scripts querying Active Directory via WMI
  - Authorized troubleshooting or inventory processes
level: high
tags:
  - attack.discovery
  - attack.t1018
  - attack.execution
VQL: |
  LET ID_1405 = (
      CommandLine =~ "(?=.*get-wmiobject)(?=.*-class)(?=.*ds_computer)(?=.*-namespace)(?=.*root\\directory\\ldap)"
  )
