title: Audio Capture via PowerShell
description: Detects audio capture via PowerShell Cmdlet.
author: Amr Ashraf
status: Developed
tags:
    - attack.collection
    - attack.t1123
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - WindowsAudioDevice-Powershell-Cmdlet
            - Toggle-AudioDevice
            - 'Get-AudioDevice '
            - 'Set-AudioDevice '
            - 'Write-AudioDevice '
    condition: process_creation and selection
falsepositives:
    - Legitimate audio capture by legitimate user.
level: medium
