title: Bash History Logging Disabled - DFE-005-E-000-0023
id: DFE-005-E-000-0023
status: experimental
description: |
  Detection Description:
  Detects Bash History Logging Disabled.
  
  Status:
  experimental
  
  Threat Mapping:
  MITRE ATT&CK Technique(s): T1562 – Impair Defenses
  Kill Chain Phase: Defense Evasion
  
  Data Sources:
  MITRE Data Source: Process: Process Creation
  Product targeted by the Rule: Linux Server
  Service in the product that provides the log: auditd
  
  Detection Logic:
  See Sigma detection section.
  
  False Positive Considerations:
  See falsepositives section.
  
  Severity and Risk Rating:
  Severity Level: High
  
  References:
  See references section.
  
  Author:
  HXP Detection team
  
  Use Case Sheet Details:
  - L3 use cases per L2: 31
  - L1 Use Case Name: Defence Evasion
  - L1 Use Case Identifier: DFE
  - L2 Use Case Name: Impair Defenses (Disable Security Tools)
  - L2 Use Case Identifier: DFE-005
  - Rule Identifier: DFE-005-E-000-0023
  - Technical Use Case Name: Bash History Logging Disabled
  - Use Case Description:
  - Log source type: Linux Servers
  - Detection Technology: SIEM
  - Scope: All assets
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/
tags:
  - attack.defense_evasion
  - attack.t1562
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  \
          selection_shell:
            exe|endswith:
              - '/bash'
              - '/sh'
            a1:
              - '-c'
          selection_cmd:
            a2|contains:
              - 'unset HISTFILE'
              - 'HISTFILE=/dev/null'
              - 'set +o history'
          condition: selection_shell and selection_cmd
falsepositives:
  - Users clearing shell history for privacy (policy dependent)
  - Shell profile scripts
level: high
