title: Security Center Service Stopped - DFE-005-E-000-0015
id: DFE-005-E-000-0015
status: experimental
description: |
  Detection Description:
  Detects Security Center Service Stopped.
  
  Status:
  experimental
  
  Threat Mapping:
  MITRE ATT&CK Technique(s): T1562 – Impair Defenses
  Kill Chain Phase: Defense Evasion
  
  Data Sources:
  MITRE Data Source: Windows Event Logs: System
  Product targeted by the Rule: Windows Server
  Service in the product that provides the log: system
  
  Detection Logic:
  See Sigma detection section.
  
  False Positive Considerations:
  See falsepositives section.
  
  Severity and Risk Rating:
  Severity Level: High
  
  References:
  See references section.
  
  Author:
  HXP Detection team
  
  Use Case Sheet Details:
  - L3 use cases per L2: 31
  - L1 Use Case Name: Defence Evasion
  - L1 Use Case Identifier: DFE
  - L2 Use Case Name: Impair Defenses (Disable Security Tools)
  - L2 Use Case Identifier: DFE-005
  - Rule Identifier: DFE-005-E-000-0015
  - Technical Use Case Name: Security Center Service Stopped
  - Use Case Description:
  - Log source type: Windows Servers
  - Detection Technology: SIEM
  - Scope: All assets
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/
tags:
  - attack.defense_evasion
  - attack.t1562
logsource:
  product: windows
  service: system
detection:
  \
          selection:
            EventID: 7036
          selection_servicename:
            ServiceName:
              - 'wscsvc'
              - 'Security Center'
          selection_state:
            State:
              - 'stopped'
              - 'Stopped'
          condition: selection and selection_servicename and selection_state
falsepositives:
  - Authorized security configuration changes (should be tracked/approved)
  - Troubleshooting by IT/SecOps
level: high
