title: Linux iptables Firewall Flushed - DFE-005-E-000-0024
id: DFE-005-E-000-0024
status: experimental
description: |
  Detection Description:
  Detects Linux iptables Firewall Flushed.
  
  Status:
  experimental
  
  Threat Mapping:
  MITRE ATT&CK Technique(s): T1562.004 – Disable or Modify System Firewall
  Kill Chain Phase: Defense Evasion
  
  Data Sources:
  MITRE Data Source: Process: Process Creation
  Product targeted by the Rule: Linux Server
  Service in the product that provides the log: auditd
  
  Detection Logic:
  See Sigma detection section.
  
  False Positive Considerations:
  See falsepositives section.
  
  Severity and Risk Rating:
  Severity Level: High
  
  References:
  See references section.
  
  Author:
  HXP Detection team
  
  Use Case Sheet Details:
  - L3 use cases per L2: 31
  - L1 Use Case Name: Defence Evasion
  - L1 Use Case Identifier: DFE
  - L2 Use Case Name: Impair Defenses (Disable Security Tools)
  - L2 Use Case Identifier: DFE-005
  - Rule Identifier: DFE-005-E-000-0024
  - Technical Use Case Name: Linux iptables Firewall Flushed
  - Use Case Description:
  - Log source type: Linux Servers
  - Detection Technology: SIEM
  - Scope: All assets
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/techniques/T1562/004/
tags:
  - attack.defense_evasion
  - attack.t1562.004
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  \
          selection:
            exe|endswith: '/iptables'
            a1:
              - '-F'
              - '--flush'
          condition: selection
falsepositives:
  - Authorized security configuration changes (should be tracked/approved)
  - Troubleshooting by IT/SecOps
level: high
