title: Detect Suspicious Loading of Vaultcli.dll
status: Developed
description: Detects the loading of the Vaultcli.dll library by processes other than vaultcmd.exe, which may indicate unauthorized access to Windows Credential Vaults.
author: Amr Ashraf
logsource:
  category: image_load
  product: windows
detection:
  selection:
    ImageName: "vaultcli.dll"
  exclusion:
    ProcessName:
      - "vaultcmd.exe"  # Legitimate process for managing credential vaults
  condition: selection and not exclusion
fields:
  - ImageName
  - ProcessName
  - ParentImage
  - User
  - Hostname
level: high
tags:
  - attack.credential_access
  - attack.execution
  - t1003.001
falsepositives:
  - Legitimate processes loading `vaultcli.dll` as part of their functionality
  - Security tools or system utilities interacting with credential vaults
