title: Suspicious AD Enumeration via PowerShell
description: Suspicious AD Enumeration via PowerShell
status: Developed
author: Amr Ashraf
logsource:
  product: windows
  category: powershell
detection:
  selection:
    EventID: 4104
    ScriptBlockText|contains:
      - "Get-ADUser"
      - "Get-ADComputer"
      - "Get-ADGroup"
      - "Get-ADOrganizationalUnit"
  condition: selection
tags:
  - Discovery
  - T1087.002
  - T1069.002
level: medium
