title: Masquerading as legitemate thierd party tool [medium]
status: test
description: Masquerading as legitemate executable
references:
    - Threat intel feed "https://andreacristaldi.github.io/APTmap/"
tags:
    - attack.defence_evasion
    - attack.t1036.005
author: Amr Ashraf
logsource:
    product: windows
    category: process_execution
detection:
    selection:
        Image|contains: # use command or object fields for this because it has the full path of the executable
          - 'C:\ProgramFiles\Realtek\Audio\HDA\AERTSr.exe'
          - 'C:\Program Files (x86)\Foxit Software\Foxit Reader\FoxitRdr64.exe'
          - 'C:\Program Files (x86)\Adobe\Flash Player\AddIns\airappinstaller\airappinstall.exe'
          - 'C:\Program Files (x86)\Adobe\Acrobat Reader DC\Reader\AcroRd64.exe'
          - '\mfevtpse.exe'
    condition: selection
falsepositives:
    - unknown # not observed on the last 30 days on our environment
level: medium

