title: Suspicious Access to Browser Data Files
description: Detects processes accessing sensitive browser data files, which could indicate potential data-stealing malware. Legitimate browser processes such as Chrome, Edge, and Firefox are whitelisted.
status: Developed
author: Amr Ashraf
date: 2024/11/09
logsource:
  category: file_access
  product: windows
detection:
  selection:
    EventID: 4663
    TargetFilename:
      - '*\\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data'
      - '*\\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Cookies'
      - '*\\AppData\\Local\\Microsoft\\Edge\\User Data\\Default\\Login Data'
      - '*\\AppData\\Local\\Microsoft\\Edge\\User Data\\Default\\Cookies'
      - '*\\AppData\\Roaming\\Mozilla\\Firefox\\Profiles\\*\\cookies.sqlite'
  filter_browsers:
    ProcessName:
      - '*\\chrome.exe'
      - '*\\msedge.exe'
      - '*\\firefox.exe'
  condition: selection and not filter_browsers
fields:
  - TargetFilename
  - ProcessName
  - AccountName
level: high
tags:
  - attack.credential_access
  - attack.t1003.001
  - attack.t1539
