title: Hijack Legit RDP Session to Move Laterally
status: test
description: Detects the usage of tsclient share to place a backdoor on the RDP source machine's startup folder
references:
    - Internal Research
tags:
    - attack.command-and-control
    - attack.t1219
author: Amr Ashraf
logsource:
    product: windows
    category: file_event (EID 11)
    service: sysmon
detection:
    selection:
        Image|endswith: '\mstsc.exe'
        TargetFilename|contains: '\Microsoft\Windows\Start Menu\Programs\Startup\'
    condition: selection
falsepositives:
    - Unlikely
level: high

