title: PUA - DIT Snapshot Viewer
status: test
description: Detects the use of Ditsnap tool, an inspection tool for Active Directory database, ntds.dit.
references:
    - https://thedfirreport.com/2020/06/21/snatch-ransomware/
    - https://web.archive.org/web/20201124182207/https://github.com/yosqueoy/ditsnap
tags:
    - attack.credential-access
    - attack.t1003.003
author: Amr Ashraf
logsource:
    category: process_creation (EID 1)
    service: sysmon
    product: windows
detection:
    selection:
        - Image|endswith: '\ditsnap.exe'
    condition: selection
falsepositives:
    - Legitimate admin usage
level: high

