title: Findstr GPP Passwords
status: test
description: Look for the encrypted cpassword value within Group Policy Preference files on the Domain Controller. This value can be decrypted with gpp-decrypt.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.006/T1552.006.md#atomic-test-1---gpp-passwords-findstr
tags:
    - attack.credential-access
    - attack.t1552.006
author: Amr Ashraf
logsource:
    category: process_creation (EID 1)
    service: sysmon
    product: windows
detection:
    selection_img:
        - Image|endswith:
              - '\find.exe'
              - '\findstr.exe'
    selection_cli:
        CommandLine|contains|all:
            - 'cpassword'
            - '\sysvol\'
            - '.xml'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high

