title: Enumeration for 3rd Party Creds From CLI
status: test
description: Detects processes that query known 3rd party registry keys that holds credentials via commandline
references:
    - https://isc.sans.edu/diary/More+Data+Exfiltration/25698
    - https://github.com/synacktiv/Radmin3-Password-Cracker/blob/acfc87393e4b7c06353973a14a6c7126a51f36ac/regkey.txt
    - https://github.com/HyperSine/how-does-MobaXterm-encrypt-password
    - https://book.hacktricks.xyz/windows-hardening/windows-local-privilege-escalation#inside-the-registry
tags:
    - attack.credential-access
    - attack.t1552.002
author: Amr Ashraf
logsource:
    category: process_creation (EID 1)
    service: sysmon
    product: windows
detection:
    selection:
        CommandLine|contains: # Add more paths as they are discovered
            - '\Software\SimonTatham\PuTTY\Sessions'
            - '\Software\\SimonTatham\PuTTY\SshHostKeys\'
            - '\Software\Mobatek\MobaXterm\'
            - '\Software\WOW6432Node\Radmin\v3.0\Server\Parameters\Radmin'
            - '\Software\Aerofox\FoxmailPreview'
            - '\Software\Aerofox\Foxmail\V3.1'
            - '\Software\IncrediMail\Identities'
            - '\Software\Qualcomm\Eudora\CommandLine'
            - '\Software\RimArts\B2\Settings'
            - '\Software\OpenVPN-GUI\configs'
            - '\Software\Martin Prikryl\WinSCP 2\Sessions'
            - '\Software\FTPWare\COREFTP\Sites'
            - '\Software\DownloadManager\Passwords'
            - '\Software\OpenSSH\Agent\Keys'
            - '\Software\TightVNC\Server'
            - '\Software\ORL\WinVNC3\Password'
            - '\Software\RealVNC\WinVNC4'
    condition: selection
falsepositives:
    - Unknown
level: medium

