title: Suspicious PFX File Creation
status: test
description: A general detection for processes creating PFX files. This could be an indicator of an adversary exporting a local certificate to a PFX file.
references:
    - https://github.com/OTRF/detection-hackathon-apt29/issues/14
    - https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/6.B.1_6392C9F1-D975-4F75-8A70-433DEDD7F622.md
tags:
    - attack.credential-access
    - attack.t1552.004
author: Amr Ashraf
logsource:
    product: windows
    category: file_event (EID 11)
    service: sysmon
detection:
    selection:
        TargetFilename|endswith: '.pfx'
    filter_main_windows_tmp_key:
        TargetFilename|contains|all:
            - '\Templates\Windows\Windows_TemporaryKey.pfx'
            - '\CMake\'
    condition: selection and not 1 of filter_main_*
falsepositives:
    - System administrators managing certificates.
level: medium

