title: Suspicious JavaScript Execution Via Mshta
description: Detects execution of javascript code using "mshta.exe".
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.defense-evasion
    - attack.t1218.005
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \mshta.exe
    selection_cli:
        CommandLine|contains: javascript
    condition: process_creation and (all of selection_*)
    VQL:
        LET ID_1097 = (
            NewProcessName =~ "\\mshta\\.exe$" AND
            CommandLine =~ "javascript"
        )
falsepositives:
    - Unknown
level: high

