title: Remotely Hosted HTA File Executed Via Mshta
description: Detects execution of the "mshta" utility with an argument containing the "http" keyword, which could indicate that an attacker is executing a remotely hosted malicious hta file
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1218.005
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \mshta.exe
    selection_cli:
        CommandLine|contains:
            - 'http://'
            - 'https://'
            - 'ftp://'
    condition: process_creation and (all of selection_*)
    VQL:
        LET ID_1096 = (
            NewProcessName =~ "\\mshta\\.exe$" AND
            CommandLine =~ "(?=.*http://|.*https://|.*ftp://)"
        )
falsepositives:
    - Unknown
level: high

