title: Mshtml.DLL RunHTMLApplication Suspicious Usage
description: |
    Detects execution of commands that leverage the "mshtml.dll" RunHTMLApplication export to run arbitrary code via different protocol handlers (vbscript, javascript, file, http...)
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.defense-evasion
    - attack.execution
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|all:
            - '\..\'
            - 'mshtml'
    selection_1:
        CommandLine|contains:
            - '#135'
            - 'RunHTMLApplication'
    condition: process_creation and selection and selection_1
    VQL:
        LET ID_1095 = (
            CommandLine =~ "(?=.*\\..\\..)(?=.*mshtml)" AND
            CommandLine =~ "(?=.*#135|.*RunHTMLApplication)"
        )
falsepositives:
    - Unlikely
level: high

