title: Windows GPO Enumeration
description: Detects discovery of Group Policies typically using commands or PowerShell to query local or domain GPOs.
status: Developed
author: Yuliya Volkova
date: 2024/11/12
modified: 2024/11/12
logsource:
  category: security
  product: windows
detection:
  selection:
    EventID:
      - "4688"
    Commandline|contains|any:
      - "gpresult"                            
      - "Get-GPO"   
      - "Get-DomainGPO" 
      - "GPOAudit"
      - "GPORemoteAccessPolicy"             
      - "Get-GPResultantSetOfPolicy"       
      - "Get-GPPermission"       
  exclusion:
    User|contains|any: # Check against any service accounts which are authorized to perform local account enumeration to reduce rule fatigue
      - "$"
  condition: selection AND NOT exclusion | count () by Commandline > 3 within 5m 
fields:
  - EventID
  - NewProcessName
  - ParentProcessName
  - User
  - Hostname
  - Commandline
falsepositives:
  - Legitimate Group Policy queries by administrators or compliance tools.
level: low
tags:
  - attack.discovery
  - attack.t1615
