title: Detect Suspicious Modifications to Security Support Provider Registry Keys
status: Experimental
description: Detects modifications to the Security Packages registry key used by LSASS to load SSPs.
author: Amr Ashraf
logsource:
  category: registry
  product: windows
detection:
  selection:
    EventID: 4657 
    RegistryKey: 'HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa'
    RegistryValueName: 'Security Packages'
  condition: selection
fields:
  - RegistryKey
  - RegistryValueName
  - NewValue
  - User
  - ComputerName
level: high
tags:
  - attack.persistence
  - attack.privilege_escalation
  - t1547.005
falsepositives:
  - Legitimate updates by administrators or system updates
