title: Detect Shortcut Creation in Startup Directories
status: Experimental
description: Detects creation of new shortcut files in startup directories, indicative of potential persistence mechanisms.
author: Amr Ashraf
logsource:
  category: file_event
  product: windows
detection:
  selection:
    FileName|endswith: '.lnk'
    FileAccess: 'CREATE'
    FilePath|contains:
      - '%APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup'
      - '%PROGRAMDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup'
  condition: selection
fields:
  - FileName
  - FilePath
  - FileAccess
  - User
  - Hostname
level: high
tags:
  - attack.persistence
  - attack.execution
  - t1547.009
falsepositives:
  - Legitimate shortcut creation during software installations or updates