title: Unload Sysmon Filter Driver with fltmc
status: Developed
description: Detects the unloading of the Sysinternals Sysmon filter driver via the `unload` command-line parameter.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ProcessName: "fltmc.exe"
    CommandLine|contains:
      - "unload"
      - "sysmon"
  condition: selection
fields:
  - ProcessName
  - CommandLine
  - ParentImage
  - User
  - Hostname
level: high
tags:
  - attack.defense_evasion
  - t1089
falsepositives:
  - Legitimate administrative actions performed by authorized users
notes: |
  The Sysmon driver can be installed with various service names. This analytic should be updated to reflect the installed service name if Sysmon is configured with a different name.
