title: Detect Modifications to RC Scripts
id: detect-rc-script-modifications
status: Developed
description: Detects suspicious modifications to RC scripts, which may indicate adversary persistence or privilege escalation on Unix-like systems.
author: Amr Ashraf
logsource:
  category: file_event
  product: linux
detection:
  selection:
    - FilePath|startswith:
        - '/etc/rc.local'
        - '/etc/rc.d/'
        - '/etc/init.d/'
  condition: selection
fields:
  - FilePath
  - FileName
  - User
  - Hostname
  - ProcessName
  - AccessType
level: high
tags:
  - attack.persistence
  - attack.execution
  - attack.privilege_escalation
  - t1037.004
falsepositives:
  - Legitimate administrative changes by authorized users.
  - System updates modifying startup scripts.

