title: Directory Service Restore Mode (DSRM) Account Password change
status: Developed
description: |
    Detects potential attempts made to set the Directory Services Restore Mode administrator password.
    The Directory Service Restore Mode (DSRM) account is a local administrator account on Domain Controllers.
author: Amr Ashraf
status: Developed
date: 2024/11/13
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4794
    condition: selection
tags:
    - attack.persistence
    - attack.t1098
falsepositives:
    - Initial installation of a domain controller.
level: high
