title: Potential DNS Tunneling via NsLookup
description: Identifies a large number of `nslookup.exe` executions with explicit query types from the same host, potentially indicating DNS tunneling used for command and control or exfiltration.
status: Developed
date: 2024-12-01
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName: 'nslookup.exe'
    CommandLine|contains:
      - "-querytype=*"
      - "-qt=*"
      - "-q=*"
      - "-type=*"
  aggregation:
    host_id:
      count: 10
      timeframe: 5m
  condition: selection and aggregation
fields:
  - process_name
  - process_args
  - user_id
  - parent_process_name
  - host_name
falsepositives:
  - Legitimate use of `nslookup.exe` for DNS query testing or administrative purposes
level: medium
tags:
  - attack.command_and_control
  - attack.T1071
  - attack.T1071.004
  - attack.T1572
