title: Detect Data Exfiltration Using Rclone Over FTP
status: Developed
description: Detects the use of Rclone to configure and exfiltrate data to an FTP server, which may indicate adversarial activity or unauthorized data transfers.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection_rclone_config:
    Image|endswith: '\rclone.exe'
    CommandLine|contains|all:
      - 'config create'
      - 'ftp'
      - 'host'
  selection_rclone_transfer:
    Image|endswith: '\rclone.exe'
    CommandLine|contains|all:
      - 'copy'
      - 'ftpserver'
  condition: selection_rclone_config or selection_rclone_transfer
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate use of Rclone for file backups or transfers
  - Authorized IT operations involving FTP
level: critical
tags:
  - attack.exfiltration
  - attack.command_and_control
  - attack.t1071.001
  - attack.t1048.001
