title: Detect Data Exfiltration via FTP Using PowerShell
status: Experimental
description: Detects the use of PowerShell scripts to upload files to an FTP server, commonly used by ransomware such as MAZE for data exfiltration.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: script
  product: windows
detection:
  selection_script_block:
    EventID: 4104
    ScriptBlockText|contains|all:
      - 'New-Object System.Net.WebClient'
      - '.UploadFile'
  selection_command_line:
    EventID: 4688
    CommandLine|contains|all:
      - 'powershell'
      - 'New-Object System.Net.WebClient'
      - '.UploadFile'
  condition: selection_script_block or selection_command_line
fields:
  - EventID
  - ScriptBlockText
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate administrative or operational scripts using FTP for file transfers
  - Automated tasks involving FTP file uploads
level: critical
tags:
  - attack.exfiltration
  - attack.command_and_control
  - attack.t1071.001
  - attack.t1048.001
VQL: |
  LET ID_1460 = (
      (ScriptBlockText =~ "(?=.*New-Object System\\.Net\\.WebClient|.*\\.UploadFile)" OR
      (CommandLine =~ "(?=.*powershell|.*New-Object System\\.Net\\.WebClient|.*\\.UploadFile)")
  )
