title: Detect Data Exfiltration via HTTP Using Invoke-WebRequest
status: Developed
description: Detects the use of PowerShell to exfiltrate sensitive data via HTTP using the `Invoke-WebRequest` cmdlet. This behavior may indicate attempts to exfiltrate sensitive data outside the network.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection_web_request:
    EventID: 4688
    NewProcessName|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains|all:
      - 'Invoke-WebRequest'
      - '-Method POST'
  condition: selection_web_request
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate use of `Invoke-WebRequest` for HTTP-based operations
  - Automation scripts uploading data to internal or authorized servers
level: critical
tags:
  - attack.exfiltration
  - attack.command_and_control
  - attack.t1027
  - attack.t1041
VQL: |
  LET ID_1429 = (
      (NewProcessName =~ "\\powershell\\.exe$" OR NewProcessName =~ "\\pwsh\\.exe$") AND
      CommandLine =~ "(?=.*Invoke-WebRequest|.*-Method POST)"
  )
