title: Detect Data Exfiltration Using wget
status: Experimental
description: Detects the use of `wget` with the `--post-file` option to upload files, which could indicate potential data exfiltration to external endpoints.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: linux
detection:
  selection_wget_post:
    Image|endswith: '/wget'
    CommandLine|contains|all:
      - '--post-file='
  condition: selection_wget_post
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
falsepositives:
  - Legitimate file uploads by administrators or automated tasks
  - Authorized testing or API interactions using `wget`
level: critical
tags:
  - attack.exfiltration
  - attack.command_and_control
  - attack.t1071.001
  - attack.t1048.002
