title: Copying Sensitive Files with Credential Data
description: Files with well-known filenames (sensitive files with credential data) copying
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.credential-access
    - attack.t1003.002
    - attack.t1003.003
    - car.2013-07-001
    - attack.s0404
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_esent_img:
        - NewProcessName|endswith: \esentutl.exe
        - OriginalFileName: \esentutl.exe
    selection_esent_cli:
        CommandLine|contains|windash:
            - vss
            - ' /m '
            - ' /y '
    selection_susp_paths:
        CommandLine|contains:
            - '\config\RegBack\sam'
            - '\config\RegBack\security'
            - '\config\RegBack\system'
            - '\config\sam'
            - '\config\security'
            - '\config\system '        # space needed to avoid false positives with \config\systemprofile\
            - '\repair\sam'
            - \repair\security
            - '\repair\system'
            - '\windows\ntds\ntds.dit'
    filter:
        CommandLine|contains:
            - '.chk'
    condition: process_creation and (all of selection_esent_* or selection_susp_paths) and not filter
falsepositives:
    - Copying sensitive files for legitimate use (eg. backup) or forensic investigation by legitimate incident responder or forensic investigator.
level: high

