title: User Added to Universal Group
group: Account Tampering
description: A user was added to a universal group, which may indicate a change in access control or an attempt to escalate privileges.
author: Amr
status: stable
logsource:
  category: windows
  product: windows
detection:
  selection:
    EventID: 4756
  admin_or_rdp:
    Event.EventData.TargetUserName:
      - 'Admin'
      - 'Remote Desktop'
 
  condition: selection and not admin_or_rdp
fields:
  - EventID
  - EventRecordID
  - Computer
  - TargetUserName
  - MemberSid
level: medium
tags:
  - attack.persistence
  - attack.elevation_of_privilege
  - attack.t1077.001
falsepositives:
  - Legitimate admin activities adding users to universal groups.

