title: Successful Overpass the Hash Attempt
description: Detects successful logon with logon type 9 (NewCredentials) which matches the Overpass the Hash behavior of e.g Mimikatz's sekurlsa::pth module.
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.lateral-movement
    - attack.s0002
    - attack.t1550.002
logsource:
    product: windows
    service: security
detection:
    security:
        Channel: Security
    selection:
        EventID: 4624
        LogonType: 9
        LogonProcessName: seclogo
        AuthenticationPackageName: Negotiate
    condition: security and selection
falsepositives:
    - Runas command-line tool using /netonly parameter
level: high

