title: Remote File Download via Script Interpreter
status: Developed
date: 2024-12-01
author: Amr Ashraf
logsource:
  product: windows
detection:
  selection_process:
    EventID: 4688
    NewProcessName|endswith:
      - '\wscript.exe'
      - '\cscript.exe'
  selection_file:
    EventID: 11
    TargetFileName|endswith:
      - '.exe'
      - '.dll'
      - '.ps1'
      - '.bat'
      - '.vbs'
  timeframe: 1m
  condition: selection_process and selection_file
fields:
  - EventID
  - NewProcessName
  - TargetFileName
falsepositives:
  - Authorized administrators running scripts for legitimate automation tasks.
  - Automated tools downloading files for system updates or maintenance.
level: medium
tags:
  - attack.command_and_control
  - attack.T1105
  - attack.T1059.005
  - windows
description:
  Detects Windows Script Host (`cscript.exe` or `wscript.exe`) being used to download an executable or DLL file from an external source. This could indicate malicious activity such as the use of scripts for malware delivery.
references:
  - "https://attack.mitre.org/techniques/T1105/"
  - "https://attack.mitre.org/techniques/T1059/005/"
  - "https://www.mandiant.com/resources/vbscript-threats"
VQL: |
  LET ID_1323 = (
      (NewProcessName =~ "\\wscript\\.exe$" OR NewProcessName =~ "\\cscript\\.exe$") AND
      TargetFileName =~ "(?=.*\\.exe|.*\\.dll|.*\\.ps1|.*\\.bat|.*\\.vbs)"
  )
