title: C2 Beaconing Activity
id: ad-c2c-1
status: test
description: Detects C2 beaconing activity based on consistent communication patterns, including periodic intervals and outbound data. This rule identifies beaconing that may enable attackers to maintain persistence and exfiltrate data.
references:
  - https://attack.mitre.org/techniques/T1102/002/
author: Muhammad Asad
date: 2024-11-25
tags:
  - attack.command-and-control
  - attack.t1102.002
logsource:
  product: network
  category: firewall

detection:
  selection:
    DestinationIP|repeated: true                # Periodic communication patterns
    DestinationIP|ipnotin:
      - "8.8.8.8"                               # Google DNS
      - "1.1.1.1"                               # Cloudflare DNS
      - "known_VPN_IPs"                         # Evanti, SMA
      - "trusted_partners"                      # CBI Bank
    protocol: tcp                               # C2 commonly uses TCP protocol
    interval: ">30s and <300s"                  # Connections occurring every 30 to 300 seconds
    BytesTransferred: [gte: 2, lte: 8]          # Values in KB, gte=greater then and equal. lte=less then an equal
    
    # Malicious C2 communications often use small, consistent payload sizes to remain stealthy. This range helps capture connections that are too small for large legitimate transfers but large enough to carry meaningful data like commands or stolen information
    # Reduce tiny connections (e.g., ACKs, pings) and large file transfers or legitimate activities (e.g. downloading updates)

condition: selection

falsepositives:
  - Automated legitimate application updates (e.g. antivirus, monitoring tools)
  - CDN communications for high-volume apps
level: high
   
 