title: Detects suspicious or unusual access to /etc/shadow
id: 2-etc-ad
status: test
description: Detects unauthorized access attempts to the /etc/shadow file.
references:
  - https://attack.mitre.org/techniques/T1003/008/
  - https://www.techtarget.com/searchsecurity/definition/shadow-password-file
author: Muhammad Asad
date: 2024-11-11
tags:
  - attack.credential-access
  - attack.t1003.008
logsource:
  product: linux
  category: file_access
detection:
  selection:
    TargetFilename|any: 
    - '/etc/shadow'
    AccessType: 'read'
  filter:
    User:
      - 'root' 
  suspicious_commands:
    CommandLine|contains|any:
      - "grep -v root /etc/shadow"
      - "cat /etc/shadow"
      - "awk '{print $1}' /etc/shadow"
      - "john"
      - "hashcat"
      - "hydra"
      - "cracklib"
      - "medusa"
  suspicious_access:
    User: 'root'
    ProcessName|endswith: ['/bin/sh', '/bin/bash']
    SourceIP|not: ['127.0.0.1']  # Exclude localhost access, flag external sources
    TimeGenerated|within: '15:45-07:00'  # Odd hours as an indicator
  condition: (selection and not filter) or (selection and suspicious_commands) or suspicious_access
  - Legitimate administrative tasks
  - Authorized backup processes
level: high