title: High Volume Kerberoasting Service Ticket Requests
id: 2-kb-ad
status: test
description: Detects high-volume Kerberoasting activity by monitoring for multiple TGS requests and association with common Kerberoasting tools.
references:
  - https://www.trustedsec.com/blog/art_of_kerberoast
  - https://adsecurity.org/?p=3513
author: Muhammad Asad
date: 2024-11-11
tags:
  - attack.credential-access
  - attack.t1558.003
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4769
    TicketEncryptionType: '0x17'  # RC4 encryption
  suspicious_tools:
    CommandLine|contains|any:
      - "Rubeus"
      - "Invoke-Kerberoast"
      - "Kerberoast"
  threshold:
    count: 10  # Trigger when more than 10 requests are seen in a short timeframe
    timeframe: 2m
  condition: selection and suspicious_tools and threshold
falsepositives:
  - High activity from authorized applications or service accounts
level: high
