title: Kerberoasting Activity Detected
id: 1-kb-ad
status: test
description: Detects potential Kerberoasting activity by monitoring for single and multiple TGS requests within a short timeframe.
references:
  - https://www.trustedsec.com/blog/art_of_kerberoast
  - https://adsecurity.org/?p=3513
author: Muhammad Asad
date: 2024-11-11
tags:
  - attack.credential-access
  - attack.t1558.003
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4769
    TicketEncryptionType: '0x17'  # RC4 encryption
  threshold:
    count: 10  # Trigger when more than 10 requests are seen in a short timeframe
    timeframe: 2m
  condition: (selection) or (selection and threshold)
falsepositives:
  - Legitimate service ticket requests
level: high

# Group by user
# Check the threshold condition