title: Suspicious AS-REP Roasting Activity Detected
id: 1-asrep-ad
status: test
description: Detects potential AS-REP Roasting activity by monitoring for Kerberos AS-REP responses without preauthentication.
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.002/T1069.002.md#atomic-test-11---get-aduser-enumeration-using-useraccountcontrol-flags-as-rep-roasting
  - https://shellgeek.com/useraccountcontrol-flags-to-manipulate-properties/
author: Muhammad Asad
date: 2024-11-12
tags:
  - attack.credential-access
  - attack.t1558.004
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4768
    Status: '0x0'  # Success
    PreAuthType: 0  # No preauthentication
  suspicious_tools:
    CommandLine|contains:
      - "ASREPRoast"
      - "Rubeus"
      - "Invoke-ASREPRoast"
  threshold:
    count: 5  # Trigger when more than 5 AS-REP requests are seen without preauthentication in a short timeframe
    timeframe: 2m
  condition: selection or (selection and threshold) or (selection and suspicious_tools and threshold)
falsepositives:
  - Accounts legitimately configured without preauthentication
level: high
