title: Suspicious Use of Legitimate Remote Access Tools
id: 4d-c2c-5
status: test
description: Identifies unauthorized use of remote access tools, such as execution outside business hours or with uncommon parent processes.
references:
  - https://attack.mitre.org/techniques/T1219/
author: Muhammad Asad
date: 2024-11-27
tags:
  - attack.command-and-control
  - attack.t1219
logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains:
      - "teamviewer.exe"
      - "anydesk.exe"
      - "vnc.exe"
      - "remote_desktop.exe"
    ParentImage|notin:
      - "explorer.exe"
      - "taskmgr.exe"
    TimeGenerated|within: '15:45-07:00'          # Odd office hours as an indicator
  condition: selection
falsepositives:
  - Authorized remote support sessions
level: high

