title: CertReq suspicious command line [medium]
status: test
description: possible Transfer operation using lolbin CertReq
references:
    - https://lolbas-project.github.io/lolbas/Binaries/CertReq/
tags:
    - attack.command_and_control
    - attack.t1105
author: Amr Ashraf
logsource:
    product: Windows
    category: process_execution
detection:
    selection:
        Image|contains: 
          - '\certreq'
        CommandLine|contains:
          - 'post'
          - 'config'
          - 'http'
    condition: selection
falsepositives:
    - FP test Required
level: medium

