title: BitsAdmin Files creation [medium]
status: test
description: possible Transfer operation using lolbin bitsadmin
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
tags:
    - attack.command_and_control
    - attack.t1105
author: Amr Ashraf
logsource:
    product: Windows
    category: file_creation
detection:
    selection:
        Image|endswith: 
          - '\bitsadmin.exe'  
    condition: selection
falsepositives:
    - FP test Required
level: medium

