title: Certoc suspicious command line [medium]
status: test
description: possible Transfer operation using lolbin Certoc
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Certoc/
tags:
    - attack.command_and_control
    - attack.t1105
author: Amr Ashraf
logsource:
    product: Windows
    category: process_execution
detection:
    selection:
        Image|contains: 
          - '\certoc'
        CommandLine|contains:
          - 'GetCACAP'
          - 'http'
    condition: selection
falsepositives:
    - FP test Required
level: medium

