title: bitsadmin suspicious command line [medium]
status: test
description: possible Transfer operation using lolbin bitsadmin
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
tags:
    - attack.command_and_control
    - attack.t1105
author: Amr Ashraf
logsource:
    product: Windows
    category: process_execution
detection:
    selection:
        Image|contains: 
          - '\bitsadmin'
        CommandLine|contains:
          - 'transfer '
          - 'create '
          - 'addfile '
          - 'SetNotifyCmdLine '
    condition: selection
falsepositives:
    - FP test Required
level: medium

