title: File Download with Sqlcmd [medium]
status: test
description: 
references:
    - Internal Research
tags:
    - attack.command_and_control
    - attack.t1105
author: Amr Ashraf
logsource:
    product: Windows
    category: process_execution
detection:
    selection:
        Image|contains: 
          - '\sqlcmd.exe'
        CommandLine|contains:
          - '-i '
    condition: selection
falsepositives:
    - unknown
level: medium


