title: Creation or Modification of Systemd Service
status: Developed
description: Detects creation or modification of systemd service files, which can be used to establish persistence on a Linux system. Systemd is widely used for managing background daemon processes and other system resources.
author: Amr Ashraf
logsource:
  category: file_event
  product: linux
detection:
  selection:
    - FileName|endswith: ".service"
    - FilePath|contains:
        - "/etc/systemd/system/"
        - "/usr/lib/systemd/system/"
  filter:
    Subtype|contains: "delete"
  condition: selection and not filter
fields:
  - FileName
  - FilePath
  - Subtype
  - User
  - Hostname
  - Action
level: medium
tags:
  - attack.persistence
  - t1501
falsepositives:
  - Legitimate administrative changes to systemd service files
  - Authorized software installations or updates modifying service files
