title: Potential BlackByte Ransomware Activity
status: Developed
description: Detects command line patterns used by BlackByte ransomware in different operations
references:
    - https://redcanary.com/blog/blackbyte-ransomware/
author: Amr Ashraf
date: 2024-12-24
tags:
    - detection.emerging-threats
    - attack.execution
    - attack.defense-evasion
    - attack.impact
    - attack.t1485
    - attack.t1498
    - attack.t1059.001
    - attack.t1140
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        NewProcessName|startswith: 'C:\Users\Public\'
        CommandLine|contains: ' -single '
        EventID: 4688
    selection_2:
        CommandLine|contains:
            - 'del C:\Windows\System32\Taskmgr.exe'
            - ';Set-Service -StartupType Disabled $'
            - 'powershell -command "$x =[System.Text.Encoding]::Unicode.GetString([System.Convert]::FromBase64String('
            - ' do start wordpad.exe /p '
        EventID: 4688
    condition: 1 of selection_*
falsepositives:
    - Unknown
level: high
