title: UNC2452 Process Creation Patterns
status: Developed
description: Detects a specific process creation patterns as seen used by UNC2452 and provided by Microsoft as Microsoft Defender ATP queries
references:
    - https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
author: Amr Ashraf
date: 2024/12/24
tags:
    - attack.execution
    - attack.t1059.001
    - detection.emerging-threats
    # - sunburst
    # - unc2452
logsource:
    category: process_creation
    product: windows
detection:
    # To avoid writing complex condition. "selection_generic_1" and "selection_generic_2" are the same except for the extension used.
    selection_generic_1:
        EventID: 4688
        CommandLine|contains:
            - '7z.exe a -v500m -mx9 -r0 -p'
            - '7z.exe a -mx9 -r0 -p'
        CommandLine|contains|all:
            - '.zip'
            - '.txt'
    selection_generic_2:
        EventID: 4688
        CommandLine|contains:
            - '7z.exe a -v500m -mx9 -r0 -p'
            - '7z.exe a -mx9 -r0 -p'
        CommandLine|contains|all:
            - '.zip'
            - '.log'
    selection_generic_3:
        EventID: 4688
        ParentCommandLine|contains|all:
            - 'wscript.exe'
            - '.vbs'
        CommandLine|contains|all:
            - 'rundll32.exe'
            - 'C:\Windows'
            - '.dll,Tk_'
    selection_generic_4:
        EventID: 4688
        ParentProcessName|endswith: '\rundll32.exe'
        ParentCommandLine|contains|all:
            - 'C:\Windows'
            - '.dll'
        CommandLine|contains: 'cmd.exe /C '
    selection_generic_5:
        EventID: 4688
        ParentProcessName|endswith: '\rundll32.exe'
        NewProcessName|endswith: '\dllhost.exe'
        CommandLine: ''
    condition: 1 of selection_generic_*
    VQL: |
        LET ID_1696 = (
            CommandLine =~ "(?=.*7z\\.exe a -v500m -mx9 -r0 -p)(?=.*\\.zip)(?=.*\\.txt)" OR
            CommandLine =~ "(?=.*7z\\.exe a -v500m -mx9 -r0 -p)(?=.*\\.zip)(?=.*\\.log)" OR
            (ParentCommandLine =~ "(?=.*wscript\\.exe)(?=.*\\.vbs)" AND CommandLine =~ "(?=.*rundll32\\.exe)(?=.*C:\\Windows)(?=.*\\.dll,Tk_)") OR
            (ParentProcessName =~ "\\rundll32\\.exe$" AND ParentCommandLine =~ "(?=.*C:\\Windows)(?=.*\\.dll)" AND CommandLine =~ "cmd\\.exe /C ") OR
            (ParentProcessName =~ "\\rundll32\\.exe$" AND NewProcessName =~ "\\dllhost\\.exe$" AND CommandLine == "")
        )
falsepositives:
    - Unknown
level: high
