title: PowerShell Download Pattern
status: Developed
description: Detects a Powershell process that contains download commands in its command line string
references:
    - https://blog.redteam.pl/2020/06/black-kingdom-ransomware.html
    - https://lab52.io/blog/winter-vivern-all-summer/
    - https://hatching.io/blog/powershell-analysis/
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - NewProcessName|endswith:
              - '\powershell.exe'
              - '\pwsh.exe'
    selection_cli:
        CommandLine|contains|all:
            - 'new-object'
            - 'net.webclient).'
            - 'download'
        CommandLine|contains:
            - 'string('
            - 'file('
    selection_event:
        EventID: 4688
    condition: all of selection_*
VQL: |
    LET ID_1753 = (
        (NewProcessName =~ "\\powershell\\.exe$" OR NewProcessName =~ "\\pwsh\\.exe$") AND
        CommandLine =~ "(?=.*new-object|.*net\\.webclient\\)\\.|.*download)" AND
        (CommandLine =~ "string\\(" OR CommandLine =~ "file\\(")
    )
falsepositives:
    - Unknown
level: medium
