title: PowerShell Script Run in AppData
status: Developed
description: Detects a suspicious command line execution that invokes PowerShell with reference to an AppData folder
references:
    - https://twitter.com/JohnLaTwC/status/1082851155481288706
    - https://app.any.run/tasks/f87f1c4e-47e2-4c46-9cf4-31454c06ce03
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains:
            - 'powershell.exe'
            - '\powershell'
            - '\pwsh'
            - 'pwsh.exe'
        EventID: 4688
    selection2:
        CommandLine|contains|all:
            - '/c '
            - '\AppData\'
        CommandLine|contains:
            - 'Local\'
            - 'Roaming\'
    condition: all of selection*
falsepositives:
    - Administrative scripts
level: medium
VQL: |
    LET ID_1775 = (
        (CommandLine =~ "(?=.*powershell\\.exe|.*\\\\powershell|.*\\\\pwsh|.*pwsh\\.exe)") AND
        (CommandLine =~ "(?=.*\\/c\\s|.*\\\\AppData\\\\)") AND
        (CommandLine =~ "(?=.*Local\\\\|.*Roaming\\\\)")
    )
