title: Code Execution via Pcwutl DLL
description: Detects launch of executable by calling the LaunchApplication function from pcwutl.dll library.
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.defense-evasion
    - attack.t1218.011
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \rundll32.exe
    selection_cli:
        CommandLine|contains|all:
            - pcwutl
            - LaunchApplication
    
    condition: process_creation and (all of selection_*)
falsepositives:
    - Use of Program Compatibility Troubleshooter Helper
level: medium
VQL: |
        LET ID_1179 = (
            NewProcessName =~ "\\rundll32\\.exe$" AND
            CommandLine =~ "(?=.*pcwutl|.*LaunchApplication)"
        )