title: Potential PowerShell Obfuscation Using Alias Cmdlets
status: Experimental
description: Detects Set-Alias or New-Alias cmdlet usage. Which can be use as a mean to obfuscate PowerShell scripts
references:
    - https://github.com/1337Rin/Swag-PSO
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1027
    - attack.t1059.001
logsource:
    product: windows
    category: ps_script
detection:
    selection:
        ScriptBlockText|contains:
            - 'Set-Alias '
            - 'New-Alias '
        EventID: 4104
    condition: selection
falsepositives:
    - Unknown
level: low
