title: PowerShell ShellCode
status: Developed
description: Detects Base64 encoded Shellcode
references:
    - https://twitter.com/cyb3rops/status/1063072865992523776
author: Amr Ashraf
date: 2024/12/24
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1055
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: ps_script
detection:
    selection:
        ScriptBlockText|contains:
            - 'OiCAAAAYInlM'
            - 'OiJAAAAYInlM'
        EventID: 4104
    condition: selection
falsepositives:
    - Unknown
level: high
