title: Suspicious File Creation via Browser Extensions
status: Experimental
description: Detects suspicious file creations in browser extension directories, which may indicate malicious browser extensions installed via app store downloads, social engineering, or prior system compromise.
author: Amr Ashraf
logsource:
  category: file_event
  product: any
detection:
  selection:
    - EventID: 11
    - TargetFileName|endswith:
        - '.exe'
        - '.dll'
        - '.ps1'
        - '.vbs'
        - '.bat'
    - TargetFileName|contains:
        # Windows paths
        - '\AppData\Local\Google\Chrome\User Data\Default\Extensions'
        - '\Program Files\Mozilla Firefox\plugins'
        - '\Program Files\Internet Explorer\Plugins'
  filter:
    - Subtype|contains: 'delete'
  condition: selection and not filter
fields:
  - FileName
  - FilePath
  - Subtype
  - User
  - Hostname
  - Action
level: medium
tags:
  - attack.persistence
  - t1176
falsepositives:
  - Legitimate browser extension installations or updates
  - Authorized IT or administrative tasks involving extensions