title: Potential PowerShell Obfuscation Using Character Join
status: Experimental
description: Detects specific techniques often seen used inside of PowerShell scripts to obfuscate Alias creation
references:
    - Internal Research
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1027
    - attack.t1059.001
logsource:
    product: windows
    category: ps_script
detection:
    selection:
        # Example:
        #   Set-Alias -Name Y -Value (-join("Ne","w-O","bje","ct"))
        #   Set-Alias -Name X -Value (-join("Inv","oke","-","Exp","ression"))
        ScriptBlockText|contains|all:
            - '-Alias' # For both "New-Alias" and "Set-Alias"
            - ' -Value (-join('
        EventID: 4104
    condition: selection
falsepositives:
    - Unknown
level: low
