title: Raspberry Robin Initial Execution From External Drive
status: Developed
description: Detects the initial execution of the Raspberry Robin malware from an external drive using "Cmd.EXE".
references:
    - https://redcanary.com/blog/raspberry-robin/
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.001
    - detection.emerging-threats
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentProcessName|endswith: '\cmd.exe'
        ParentCommandLine|contains: '/r'
        ParentCommandLine|endswith:
            - '.bin'
            - '.ico'
            - '.lnk'
            - '.lo'
            - '.sv'
            - '.usb'
        EventID: 4688
    selection_child_img:
        NewProcessName|endswith: '\msiexec.exe'
        CommandLine|contains|windash: '/q'
    selection_child_http:
        CommandLine|contains:
            - 'http:'
            - 'https:'
    condition: all of selection_*
    VQL: |
        LET ID_1731 = (
            ParentProcessName =~ "\\cmd\\.exe$" AND
            ParentCommandLine =~ "/r" AND
            (ParentCommandLine =~ "\\.bin$" OR
             ParentCommandLine =~ "\\.ico$" OR
             ParentCommandLine =~ "\\.lnk$" OR
             ParentCommandLine =~ "\\.lo$" OR
             ParentCommandLine =~ "\\.sv$" OR
             ParentCommandLine =~ "\\.usb$") AND
            (NewProcessName =~ "\\msiexec\\.exe$" AND CommandLine =~ "/q") AND
            (CommandLine =~ "http:" OR CommandLine =~ "https:")
        )
falsepositives:
    - Unlikely
level: high
