title: PowerShell Web Download
status: Experimental
description: Detects suspicious ways to download files or content using PowerShell
references:
    - https://github.com/VirtualAlllocEx/Payload-Download-Cradles/blob/88e8eca34464a547c90d9140d70e9866dcbc6a12/Download-Cradles.cmd
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.command-and-control
    - attack.execution
    - attack.t1059.001
    - attack.t1105
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        EventID: 4688
        CommandLine|contains:
            - '.DownloadString('
            - '.DownloadFile('
            - 'Invoke-WebRequest '
            - 'iwr '
    condition: selection
falsepositives:
    - Scripts or tools that download files
level: medium
VQL: |
    LET ID_1751 = (
        CommandLine =~ "(?=.*\\.DownloadString\\(|.*\\.DownloadFile\\(|.*Invoke-WebRequest|.*iwr)"
    )
