title: PowerShell Base64 Encoded Invoke Keyword
status: Developed
description: Detects UTF-8 and UTF-16 Base64 encoded powershell 'Invoke-' calls
references:
    - https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.001
    - attack.defense-evasion
    - attack.t1027
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - NewProcessName|endswith:
              - '\powershell.exe'
              - '\pwsh.exe'
    selection_cli_enc:
        CommandLine|contains: ' -e'
    selection_cli_invoke:
        CommandLine|contains:
            # Invoke-
            # UTF-16LE
            - 'SQBuAHYAbwBrAGUALQ'
            - 'kAbgB2AG8AawBlAC0A'
            - 'JAG4AdgBvAGsAZQAtA'
            # UTF-8
            - 'SW52b2tlL'
            - 'ludm9rZS'
            - 'JbnZva2Ut'
    selection_eventid:
        EventID: 4688
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
VQL:
    LET ID_1742 = (
        (NewProcessName =~ "\\powershell\\.exe$" OR NewProcessName =~ "\\pwsh\\.exe$") AND
        CommandLine =~ " -e" AND
        CommandLine =~ "(?=.*SQBuAHYAbwBrAGUALQ|.*kAbgB2AG8AawBlAC0A|.*JAG4AdgBvAGsAZQAtA|.*SW52b2tlL|.*ludm9rZS|.*JbnZva2Ut)"
    )
