title: HybridConnectionManager Service Installation
status: Developed
description: Detects the installation of the Azure Hybrid Connection Manager service to allow remote code execution from Azure function.
references:
    - https://twitter.com/Cyb3rWard0g/status/1381642789369286662
author: Amr Ashraf
date: 2024/12/23
tags:
    - attack.resource-development
    - attack.t1608
logsource:
    category: registry_event
    product: windows
detection:
    selection1:
        EventID:
            - 13
        TargetObject|contains: '\Services\HybridConnectionManager'
    selection2:
        EventID:
            - 13
        EventType: SetValue
        Details|contains: 'Microsoft.HybridConnectionManager.Listener.exe'
    condition: selection1 or selection2
falsepositives:
    - Unknown
level: high
