title: Remote PowerShell Session Host Process (WinRM)
status: Developed
description: Detects remote PowerShell sections by monitoring for wsmprovhost (WinRM host process) as a parent or child process (sign of an active PowerShell remote session).
references:
    - https://threathunterplaybook.com/hunts/windows/190511-RemotePwshExecution/notebook.html
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.001
    - attack.t1021.006
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - NewProcessName|endswith: '\wsmprovhost.exe'
        - ParentProcessName|endswith: '\wsmprovhost.exe'
        - EventID: 4688
    condition: selection
fields:
    - ComputerName
    - User
    - CommandLine
falsepositives:
    - Legitimate usage of remote Powershell, e.g. for monitoring purposes.
level: medium
VQL:
    LET ID_1788 = (
        NewProcessName =~ "\\wsmprovhost\\.exe$" OR
        ParentProcessName =~ "\\wsmprovhost\\.exe$"
    )
