title: Headless Process Launched Via Conhost
status: Experimental
description: |
    Detects the launch of a child process via "conhost.exe" with the "--headless" flag.
    The "--headless" flag hides the windows from the user upon execution.
references:
    - https://www.huntress.com/blog/fake-browser-updates-lead-to-boinc-volunteer-computing-software
author: Amr Ashraf
date: 2024/12/24
tags:
    - attack.defense-evasion
    - attack.t1059.001
    - attack.t1059.003
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentProcessName|endswith: '\conhost.exe'
        ParentCommandLine|contains: '--headless'
        EventID: 4688
    condition: selection
    VQL: |
        LET ID_1702 = (
            ParentProcessName =~ "\\conhost\\.exe$" AND
            ParentCommandLine =~ "--headless"
        )
falsepositives:
    - Unknown
level: medium
