title: Remote Execution via WMIC
status: Experimental
description: Identifies the use of `wmic.exe` to run commands on remote hosts, which can be indicative of lateral movement or malicious activity.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - EventID: 4688
    - NewProcessName|contains: "wmic.exe"
      CommandLine|contains|re:
        - "/node:"
        - "-node:"
        - "process *call"
  
  condition: selection
fields:
  - ProcessName
  - CommandLine
  - ParentProcessName
  - ProcessPath
  - User
  - Hostname
level: medium
tags:
  - attack.execution
  - attack.lateral_movement
  - t1047
falsepositives:
  - Legitimate administrative tasks using WMIC for remote process execution
VQL: |
  LET ID_1263 = (
      NewProcessName =~ "wmic\\.exe" AND
      CommandLine =~ "(?=.*\\/node:|.*-node:|.*process \\*call)"
  )