title: Detect XSL Script Processing Abuse
id: detect-xsl-script-processing
status: Experimental
description: Detects execution of XSL scripts via tools like wmic.exe or PowerShell, which may indicate malicious activity.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - EventID: 4688
    - NewProcessName|endswith:
        - '\wmic.exe'
      CommandLine|contains:
        - '/FORMAT:*'
        - '.xsl'
  selection_1:
    - EventID: 4688
    - NewProcessName|endswith:
        - '\powershell.exe'
        - 'pwsh.exe'
      CommandLine|contains:
        - 'TransformNode'
        - 'Load'
        - '.xsl'
  filter:
    - CommandLine|contains:
        - 'C:\Windows\System32\wbem'
  condition: (selection or selection_1) and not filter
VQL: |
  LET ID_1348 = (
      (
          (NewProcessName =~ "\\wmic\\.exe$" AND CommandLine =~ "(?=.*\\/FORMAT:.*|.*\\.xsl)") OR
          (NewProcessName =~ "\\powershell\\.exe$" OR NewProcessName =~ "pwsh\\.exe$") AND
          CommandLine =~ "(?=.*TransformNode|.*Load|.*\\.xsl)"
      ) AND NOT CommandLine =~ "C:\\Windows\\System32\\wbem"
  )
fields:
  - Image
  - CommandLine
  - ParentImage
  - User
  - Hostname
level: high
tags:
  - attack.execution
  - attack.defense_evasion
  - t1220
falsepositives:
  - Legitimate administrative scripts or IT management tools using XSL for formatting.
