title: HackTool - Default PowerSploit-Empire Scheduled Task Creation
status: Developed
description: Detects the creation of a schtask via PowerSploit or Empire Default Configuration.
references:
    - https://github.com/0xdeadbeefJERKY/PowerSploit/blob/8690399ef70d2cad10213575ac67e8fa90ddf7c3/Persistence/Persistence.psm1
    - https://github.com/EmpireProject/Empire/blob/08cbd274bef78243d7a8ed6443b8364acd1fc48b/lib/modules/powershell/persistence/userland/schtasks.py
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.persistence
    - attack.privilege-escalation
    - attack.s0111
    - attack.g0022
    - attack.g0060
    - car.2013-08-001
    - attack.t1053.005
    - attack.t1059.001
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        ParentProcessName|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        NewProcessName|endswith: '\schtasks.exe'
        CommandLine|contains|all:
            - '/Create'
            - 'powershell.exe -NonI'
            - '/TN Updater /TR'
        CommandLine|contains:
            - '/SC ONLOGON'
            - '/SC DAILY /ST'
            - '/SC ONIDLE'
            - '/SC HOURLY'
        EventID: 4688
    condition: selection
falsepositives:
    - Unlikely
level: high
VQL: |
    LET ID_1723 = (
        ParentProcessName =~ "\\powershell\\.exe$" OR ParentProcessName =~ "\\pwsh\\.exe$" AND
        NewProcessName =~ "\\schtasks\\.exe$" AND
        CommandLine =~ "(?=.*\\/Create)(?=.*powershell\\.exe -NonI)(?=.*\\/TN Updater \\/TR)" AND
        CommandLine =~ "(?=.*\\/SC ONLOGON|.*\\/SC DAILY \\/ST|.*\\/SC ONIDLE|.*\\/SC HOURLY)"
    )
