title: PowerShell Web Access Installation
status: Experimental
description: Detects the installation and configuration of PowerShell Web Access, which could be used for remote access and potential abuse
references:
    - https://docs.microsoft.com/en-us/powershell/module/powershellwebaccess/install-pswawebapplication
    - https://www.cisa.gov/news-events/cybersecurity-advisories/aa24-241a
    - https://gist.github.com/MHaggis/7e67b659af9148fa593cf2402edebb41
author: Amr Ashraf
date: 2024/12/24
tags:
    - attack.persistence
    - attack.t1059.001
logsource:
    product: windows
    category: ps_script
detection:
    selection_install:
        ScriptBlockText|contains: 'Install-WindowsFeature WindowsPowerShellWebAccess'
        EventID: 4104
    selection_config:
        ScriptBlockText|contains: 'Install-PswaWebApplication'
        EventID: 4104
    selection_auth:
        ScriptBlockText|contains|all:
            - 'Add-PswaAuthorizationRule'
            - '-UserName *'
            - '-ComputerName *'
        EventID: 4104
    condition: 1 of selection_*
falsepositives:
    - Legitimate PowerShell Web Access installations by administrators
level: high
