title: Certificate Exported Via PowerShell
status: Experimental
description: Detects calls to cmdlets that are used to export certificates from the local certificate store. Threat actors were seen abusing this to steal private keys from compromised machines.
references:
    - https://us-cert.cisa.gov/ncas/analysis-reports/ar21-112a
    - https://learn.microsoft.com/en-us/powershell/module/pki/export-pfxcertificate?view=windowsserver2022-ps
    - https://www.splunk.com/en_us/blog/security/breaking-the-chain-defending-against-certificate-services-abuse.html
author: Amr Ashraf
date: 2024/12/24
tags:
    - attack.credential-access
    - attack.execution
    - attack.t1552.004
    - attack.t1059.001
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        CommandLine|contains:
            - 'Export-PfxCertificate '
            - 'Export-Certificate '
        EventID: 4688
    condition: selection
VQL: |
    LET ID_1758 = (
        CommandLine =~ "(?=.*Export-PfxCertificate |.*Export-Certificate )"
    )
falsepositives:
    - Legitimate certificate exports by administrators. Additional filters might be required.
level: medium
