title: Base64 Encoded PowerShell Command Detected
status: Developed
description: Detects usage of the "FromBase64String" function in the commandline which is used to decode a base64 encoded string
references:
    - https://gist.github.com/Neo23x0/6af876ee72b51676c82a2db8d2cd3639
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.t1027
    - attack.defense-evasion
    - attack.t1140
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: '::FromBase64String('
        EventID: 4688
    condition: selection
VQL: |
    LET ID_1759 = (
        CommandLine =~ "::FromBase64String("
    )
falsepositives:
    - Administrative script libraries
level: high
