title: Potential APT FIN7 POWERHOLD Execution
status: Developed
description: Detects execution of the POWERHOLD script seen used by FIN7 as reported by WithSecureLabs
references:
    - https://labs.withsecure.com/publications/fin7-target-veeam-servers
author: Amr Ashraf
date: 2024/12/24
tags:
    - attack.execution
    - attack.t1059.001
    - attack.g0046
    - detection.emerging-threats
logsource:
    product: windows
    category: ps_script
detection:
    selection:
        EventID: 4104
        ScriptBlockText|contains|all:
            - '$env:APPDATA'
            - 'function MainPayload'
            - '::WriteAllBytes'
            - 'wscript.exe'
    condition: selection
falsepositives:
    - Unknown
level: high
