title: Execute Code with Pester.bat
status: Experimental
description: Detects code execution via Pester.bat (Pester - Powershell Modulte for testing)
references:
    - https://twitter.com/Oddvarmoe/status/993383596244258816
    - https://github.com/api0cradle/LOLBAS/blob/d148d278f5f205ce67cfaf49afdfb68071c7252a/OSScripts/pester.md
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.001
    - attack.defense-evasion
    - attack.t1216
logsource:
    category: process_creation
    product: windows
    EventID: 4688
detection:
    powershell_module:
        NewProcessName|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        CommandLine|contains|all:
            - 'Pester'
            - 'Get-Help'
    cmd_execution:
        NewProcessName|endswith: '\cmd.exe'
        CommandLine|contains|all:
            - 'pester'
            - ';'
    get_help:
        CommandLine|contains:
            - 'help'
            - '\?'
    condition: powershell_module or (cmd_execution and get_help)
    VQL: |
        LET ID_1724 = (
            (NewProcessName =~ "\\powershell\\.exe$" OR NewProcessName =~ "\\pwsh\\.exe$") AND
            CommandLine =~ "(?=.*Pester)(?=.*Get-Help)" OR
            (NewProcessName =~ "\\cmd\\.exe$" AND CommandLine =~ "(?=.*pester)(?=.*;)" AND CommandLine =~ "(?=.*help|.*\\?)")
        )
falsepositives:
    - Legitimate use of Pester for writing tests for Powershell scripts and modules
level: medium
