title: Greenbug Espionage Group Indicators
status: Experimental
description: Detects tools and process executions used by Greenbug in their May 2020 campaign as reported by Symantec
references:
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/greenbug-espionage-telco-south-asia
author: Amr Ashraf
date: 2024/12/24
tags:
    - attack.g0049
    - attack.execution
    - attack.t1059.001
    - attack.command-and-control
    - attack.t1105
    - attack.defense-evasion
    - attack.t1036.005
    - detection.emerging-threats
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        NewProcessName|endswith:
            - ':\ProgramData\adobe\Adobe.exe'
            - ':\ProgramData\oracle\local.exe'
            - '\revshell.exe'
            - '\infopagesbackup\ncat.exe'
            - ':\ProgramData\comms\comms.exe'
        EventID: 4688
    selection_msf:
        CommandLine|contains|all:
            - '-ExecutionPolicy Bypass -File'
            - '\msf.ps1'
        EventID: 4688
    selection_ncat:
        CommandLine|contains|all:
            - 'infopagesbackup'
            - '\ncat'
            - '-e cmd.exe'
        EventID: 4688
    selection_powershell:
        CommandLine|contains:
            - 'system.Data.SqlClient.SqlDataAdapter($cmd); [void]$da.fill'
            - '-nop -w hidden -c $k=new-object'
            - '[Net.CredentialCache]::DefaultCredentials;IEX '
            - ' -nop -w hidden -c $m=new-object net.webclient;$m'
            - '-noninteractive -executionpolicy bypass whoami'
            - '-noninteractive -executionpolicy bypass netstat -a'
        EventID: 4688
    selection_other:
        CommandLine|contains: 'L3NlcnZlcj1'  # base64 encoded '/server='
        EventID: 4688
    condition: 1 of selection_*
    VQL: |
        LET ID_1694 = (
            NewProcessName =~ "(?=.*:\\ProgramData\\adobe\\Adobe\\.exe$|.*:\\ProgramData\\oracle\\local\\.exe$|.*\\revshell\\.exe$|.*\\infopagesbackup\\ncat\\.exe$|.*:\\ProgramData\\comms\\comms\\.exe$)" OR
            CommandLine =~ "(?=.*-ExecutionPolicy Bypass -File)(?=.*\\msf\\.ps1)" OR
            CommandLine =~ "(?=.*infopagesbackup)(?=.*\\ncat)(?=.*-e cmd\\.exe)" OR
            CommandLine =~ "(?=.*system\\.Data\\.SqlClient\\.SqlDataAdapter\\($cmd\\); \\[void\\]\\$da\\.fill|.*-nop -w hidden -c \\$k=new-object|.*\\[Net\\.CredentialCache\\]::DefaultCredentials;IEX |.* -nop -w hidden -c \\$m=new-object net\\.webclient;\\$m|.*-noninteractive -executionpolicy bypass whoami|.*-noninteractive -executionpolicy bypass netstat -a)" OR
            CommandLine =~ "L3NlcnZlcj0"
        )
falsepositives:
    - Unlikely
level: critical
