title: Mshta Descendant of Microsoft Office
status: Developed
description: Detects the execution of `mshta.exe` as a descendant of a Microsoft Office process, which may indicate malicious activity such as command and control or defense evasion.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - EventID: 4688
    - NewProcessName|contains: 'mshta.exe'
    - ParentProcessName|contains:
        - 'outlook.exe'
        - 'winword.exe'
        - 'excel.exe'
        - 'powerpnt.exe'
  condition: selection
  
fields:
  - ProcessName
  - CommandLine
  - ParentProcessName
  - ParentProcessPath
  - ProcessPath
  - User
  - Hostname
level: high
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.command_and_control
  - t1170
falsepositives:
  - Legitimate usage of `mshta.exe` initiated by Office applications
  - Authorized macros or Office add-ins triggering `mshta.exe`
VQL: |
  LET ID_1268 = (
      NewProcessName =~ "mshta\\.exe" AND
      ParentProcessName =~ "(?=.*outlook\\.exe|.*winword\\.exe|.*excel\\.exe|.*powerpnt\\.exe)"
  )
