title: Hidden Powershell in Link File Pattern
status: Developed
description: Detects events that appear when a user click on a link file with a powershell command in it
references:
    - https://www.x86matthew.com/view_post?id=embed_exe_lnk
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentProcessName: C:\Windows\explorer.exe
        NewProcessName: C:\Windows\System32\cmd.exe
        CommandLine|contains|all:
            - 'powershell'
            - '.lnk'
        EventID: 4688
    condition: selection
falsepositives:
    - Legitimate commands in .lnk files
level: medium
