title: Execute Commands from Clipboard via PowerShell
description: Detects PowerShell usage for fetching commands from clipboard and executing them.
author: Amr Ashraf
date: 2024-12-06
status: developed
severity: high
logsource:
  category: script_block
  product: windows
detection:
  selection:
    EventID: 4104
    CommandLine|contains|all:
      - 'Get-Clipboard'
      - ' iex'
      - '|iex'
  condition: selection
falsepositives:
  - Developers using clipboard during legitimate tasks
tags:
  - attack.execution
  - T1115
fields:
  - CommandLine
  - ParentImage
  - ParentCommandLine
