title: Potential POWERTRASH Script Execution
status: Developed
description: Detects potential execution of the PowerShell script POWERTRASH
references:
    - https://labs.withsecure.com/publications/fin7-target-veeam-servers
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.001
    - attack.g0046
    - detection.emerging-threats
logsource:
    product: windows
    category: ps_script
detection:
    selection:
        EventID: 4104
        ScriptBlockText|contains|all:
            - 'IO.Compression.DeflateStream'
            - 'IO.MemoryStream'
            - '::FromBase64String'
            - 'GetDelegateForFunctionPointer'
            - '.Invoke()'
            - 'GlobalAssemblyCache'
    condition: selection
falsepositives:
    - Unknown
level: high
