title: Proc Exec (Non-Exe Filetype)
description: Checks whether the Image specified in a process creation event doesn't refer to an .exe file.
status: Developed
author: Amr Ashraf
date: 2024/11/09
logsource:
    product: windows
detection:
    selection:
        EventID: 4688
    filter_exes:
        NewProcessName|endswith: '.exe'
    filter_system_processes:
        - NewProcessName: 'C:\Windows\System32\scrnsave.scr'
        - NewProcessName: 'C:\Windows\SysWOW64\scrnsave.scr'
    condition: selection and not (filter_exes or filter_system_processes)
falsepositives:
    - 'normal system usage'
tags:
    - attack.defense_evasion
    - sysmon
references:
    - Based on a sigma rule by Max Altgelt but re-written due to many false positives and potential for false negatives.
