title: 'Unsigned Driver Loaded'
status: Developed
author: Amr Ashraf
date: 2024/11/09
logsource:
    product: windows
    service: sysmon
    definition: 'Sysmon needs to be installed and configured.'
detection:
    selection:
        Channel: Microsoft-Windows-Sysmon/Operational
        EventID: 6
    filter:
        Signed: 'true'
        SignatureStatus: 
            - 'Expired' # to avoid FPs
            - 'Valid'
    condition: selection and not filter
falsepositives:
    - 'Expired/revoked certs'
tags:
    - attack.defense_evasion
    - attack.t1553.002
    - sysmon
references:
    - https://attack.mitre.org/techniques/T1553/002/