title: HackTool - Bloodhound/Sharphound Execution
status: Developed
description: Detects command line parameters used by Bloodhound and Sharphound hack tools
references:
    - https://github.com/BloodHoundAD/BloodHound
    - https://github.com/BloodHoundAD/SharpHound
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.discovery
    - attack.t1087.001
    - attack.t1087.002
    - attack.t1482
    - attack.t1069.001
    - attack.t1069.002
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Product|contains: 'SharpHound'
        - Description|contains: 'SharpHound'
        - Company|contains:
              - 'SpecterOps'
              - 'evil corp'
        - NewProcessName|contains:
              - '\Bloodhound.exe'
              - '\SharpHound.exe'
        - EventID: 4688
    selection_cli_1:
        CommandLine|contains:
            - ' -CollectionMethod All '
            - ' --CollectionMethods Session '
            - ' --Loop --Loopduration '
            - ' --PortScanTimeout '
            - '.exe -c All -d '
            - 'Invoke-Bloodhound'
            - 'Get-BloodHoundData'
    selection_cli_2:
        CommandLine|contains|all:
            - ' -JsonFolder '
            - ' -ZipFileName '
    selection_cli_3:
        CommandLine|contains|all:
            - ' DCOnly '
            - ' --NoSaveCache '
    condition: 1 of selection_*
falsepositives:
    - Other programs that use these command line option and accepts an 'All' parameter
level: high
VQL: |
    LET ID_1708 = (
        (Product =~ "SharpHound" OR Description =~ "SharpHound" OR Company =~ "(?=.*SpecterOps|.*evil corp)" OR NewProcessName =~ "(?=.*\\\\Bloodhound\\.exe|.*\\\\SharpHound\\.exe)") OR
        CommandLine =~ "(?=.* -CollectionMethod All |.* --CollectionMethods Session |.* --Loop --Loopduration |.* --PortScanTimeout |.*\\.exe -c All -d |.*Invoke-Bloodhound|.*Get-BloodHoundData)" OR
        CommandLine =~ "(?=.* -JsonFolder |.* -ZipFileName )" OR
        CommandLine =~ "(?=.* DCOnly |.* --NoSaveCache )"
    )
