title: Potential DLL File Download Via PowerShell Invoke-WebRequest
status: Developed
description: Detects potential DLL files being downloaded using the PowerShell Invoke-WebRequest cmdlet
references:
    - https://www.zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.command-and-control
    - attack.execution
    - attack.t1059.001
    - attack.t1105
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        EventID: 4688
        CommandLine|contains:
            - 'Invoke-WebRequest '
            - 'IWR '
        CommandLine|contains|all:
            - 'http'
            - 'OutFile'
            - '.dll'
    condition: selection
falsepositives:
    - Unknown
level: medium
