title: Powershell Executed From Headless ConHost Process
status: Developed
description: |
    Detects the use of powershell commands from headless ConHost window.
    The "--headless" flag hides the windows from the user upon execution.
references:
    - https://www.huntress.com/blog/fake-browser-updates-lead-to-boinc-volunteer-computing-software
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.defense-evasion
    - attack.t1059.001
    - attack.t1059.003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - NewProcessName|endswith: '\conhost.exe'
    selection_cli:
        CommandLine|contains|all:
            - '--headless'
            - 'powershell'
    selection_event:
        EventID: 4688
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium
