title: Potentially Suspicious PowerShell Child Processes
status: Experimental
description: |
    Detects potentially suspicious child processes spawned by PowerShell.
    Use this rule to hunt for potential anomalies initiating from PowerShell scripts and commands.
references:
    - https://twitter.com/ankit_anubhav/status/1518835408502620162
author: Amr Ashraf
date: 2024/12/24
tags:
    - attack.execution
    - attack.t1059.001
    - detection.threat-hunting
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        EventID: 4688
        ParentProcessName|endswith:
            - '\powershell_ise.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
        NewProcessName|endswith:
            - '\bash.exe'
            - '\bitsadmin.exe'
            - '\certutil.exe'
            - '\cscript.exe'
            - '\forfiles.exe'
            - '\hh.exe'
            - '\mshta.exe'
            - '\regsvr32.exe'
            - '\rundll32.exe'
            - '\schtasks.exe'
            - '\scrcons.exe'
            - '\scriptrunner.exe'
            - '\sh.exe'
            - '\wmic.exe'
            - '\wscript.exe'
    filter_optional_amazon:
        ParentCommandLine|contains: '\Program Files\Amazon\WorkspacesConfig\Scripts\'  # AWS Workspaces
        CommandLine|contains: '\Program Files\Amazon\WorkspacesConfig\Scripts\'  # AWS Workspaces
    filter_main_certutil_verify_store:
        NewProcessName|endswith: '\certutil.exe'
        CommandLine|contains: '-verifystore '
    filter_main_wmic:
        NewProcessName|endswith: '\wmic.exe'
        CommandLine|contains:
            - 'qfe list'
            - 'diskdrive '
            - 'csproduct '
            - 'computersystem '
            - ' os '
            - ''
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
    - False positives are to be expected from PowerShell scripts that might make use of additional binaries such as "mshta", "bitsadmin", etc. Apply additional filters for those scripts.
level: medium
VQL: |
    LET ID_1771 = (
        (ParentProcessName =~ "(?=.*\\\\powershell_ise\\.exe$|.*\\\\powershell\\.exe$|.*\\\\pwsh\\.exe$)") AND
        (NewProcessName =~ "(?=.*\\\\bash\\.exe$|.*\\\\bitsadmin\\.exe$|.*\\\\certutil\\.exe$|.*\\\\cscript\\.exe$|.*\\\\forfiles\\.exe$|.*\\\\hh\\.exe$|.*\\\\mshta\\.exe$|.*\\\\regsvr32\\.exe$|.*\\\\rundll32\\.exe$|.*\\\\schtasks\\.exe$|.*\\\\scrcons\\.exe$|.*\\\\scriptrunner\\.exe$|.*\\\\sh\\.exe$|.*\\\\wmic\\.exe$|.*\\\\wscript\\.exe$)") AND
        NOT (ParentCommandLine =~ "\\\\Program\\sFiles\\\\Amazon\\\\WorkspacesConfig\\\\Scripts\\\\" OR CommandLine =~ "\\\\Program\\sFiles\\\\Amazon\\\\WorkspacesConfig\\\\Scripts\\\\") AND
        NOT (NewProcessName =~ "\\\\certutil\\.exe$" AND CommandLine =~ "-verifystore\\s") AND
        NOT (NewProcessName =~ "\\\\wmic\\.exe$" AND CommandLine =~ "(?=.*qfe\\slist|.*diskdrive\\s|.*csproduct\\s|.*computersystem\\s|.*os\\s)")
    )
