title: Nslookup PowerShell Download Cradle
status: Developed
description: Detects a powershell download cradle using nslookup. This cradle uses nslookup to extract payloads from DNS records.
references:
    - https://twitter.com/Alh4zr3d/status/1566489367232651264
author: Amr Ashraf
date: 2024/12/24
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: ps_classic_start
detection:
    selection:
        EventID: 4104
        ScriptBlockText|contains|all:
            - 'powershell'
            - 'nslookup'
            - '[1]'
        ScriptBlockText|contains:
            - '-q=txt http'
            - '-querytype=txt http'
    condition: selection
falsepositives:
    - Unknown
level: medium
