title: Suspicious Execution of Powershell with Base64
status: Developed
description: Commandline to launch powershell with a base64 payload
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1059.001/T1059.001.md#atomic-test-20---powershell-invoke-known-malicious-cmdlets
    - https://unit42.paloaltonetworks.com/unit42-pulling-back-the-curtains-on-encodedcommand-powershell-attacks/
    - https://mikefrobbins.com/2017/06/15/simple-obfuscation-with-powershell-using-base64-encoding/
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        NewProcessName|endswith:
            - \powershell.exe
            - \pwsh.exe
        CommandLine|contains:
            - ' -e '
            - ' -en '
            - ' -enc '
            - ' -enco'
            - ' -ec '
        EventID: 4688
    filter_encoding:
        CommandLine|contains: ' -Encoding '
    filter_azure:
        ParentProcessName|contains:
            - 'C:\Packages\Plugins\Microsoft.GuestConfiguration.ConfigurationforWindows\'
            - '\gc_worker.exe'
    condition: selection and not 1 of filter_*
VQL: |
    LET ID_1755 = (
        (NewProcessName =~ "\\powershell\\.exe$" OR NewProcessName =~ "\\pwsh\\.exe$") AND
        (CommandLine =~ "(?=.* -e |.* -en |.* -enc |.* -enco|.* -ec )") AND
        NOT (CommandLine =~ " -Encoding " OR ParentProcessName =~ "C:\\Packages\\Plugins\\Microsoft\\.GuestConfiguration\\.ConfigurationforWindows\\|\\gc_worker\\.exe")
    )
falsepositives:
    - Unknown
level: medium
