title: HackTool - CrackMapExec PowerShell Obfuscation
status: Developed
description: The CrachMapExec pentesting framework implements a PowerShell obfuscation with some static strings detected by this rule.
references:
    - https://github.com/byt3bl33d3r/CrackMapExec
    - https://github.com/byt3bl33d3r/CrackMapExec/blob/0a49f75347b625e81ee6aa8c33d3970b5515ea9e/cme/helpers/powershell.py#L242
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.001
    - attack.defense-evasion
    - attack.t1027.005
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - NewProcessName|endswith:
              - '\powershell.exe'
              - '\pwsh.exe'
    selection_cli:
        CommandLine|contains:
            - 'join*split'
            - '( $ShellId[1]+$ShellId[13]+''x'')'
            - '( $PSHome[*]+$PSHOME[*]+'
            - '( $env:Public[13]+$env:Public[5]+''x'')'
            - '( $env:ComSpec[4,*,25]-Join'''')'
            - '[1,3]+''x''-Join'''')'
    selection_eventid:
        EventID: 4688
    condition: all of selection_*
fields:
    - ComputerName
    - User
    - CommandLine
falsepositives:
    - Unknown
level: high
VQL: |
    LET ID_1712 = (
        (NewProcessName =~ "\\powershell\\.exe$" OR NewProcessName =~ "\\pwsh\\.exe$") AND
        CommandLine =~ "(?=.*join\\*split|.*\\( \\$ShellId\\[1\\]\\+\\$ShellId\\[13\\]\\+''x''\\)|.*\\( \\$PSHome\\[\\*\\]\\+\\$PSHOME\\[\\*\\]\\+|.*\\( \\$env:Public\\[13\\]\\+\\$env:Public\\[5\\]\\+''x''\\)|.*\\( \\$env:ComSpec\\[4,\\*,25\\]-Join'''\\)|.*\\[1,3\\]\\+''x''-Join'''\\)"
    )
