title: Rorschach Ransomware Execution Activity
status: Developed
description: Detects Rorschach ransomware execution activity
references:
    - https://research.checkpoint.com/2023/rorschach-a-new-sophisticated-and-fast-ransomware/
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.003
    - attack.t1059.001
    - attack.defense-evasion
    - detection.emerging-threats
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        NewProcessName|endswith:
            - '\bcdedit.exe'
            - '\net.exe'
            - '\net1.exe'
            - '\netsh.exe'
            - '\wevtutil.exe'
            - '\vssadmin.exe'
        CommandLine|contains: '11111111'
        EventID: 4688
    VQL: |
        LET ID_1732 = (
            NewProcessName =~ "\\bcdedit\\.exe$" OR
            NewProcessName =~ "\\net\\.exe$" OR
            NewProcessName =~ "\\net1\\.exe$" OR
            NewProcessName =~ "\\netsh\\.exe$" OR
            NewProcessName =~ "\\wevtutil\\.exe$" OR
            NewProcessName =~ "\\vssadmin\\.exe$" AND
            CommandLine =~ "11111111"
        )
    condition: selection
falsepositives:
    - Unlikely
level: critical
