title: PowerShell Credential Prompt
status: Developed
description: Detects PowerShell calling a credential prompt
references:
    - https://twitter.com/JohnLaTwC/status/850381440629981184
    - https://t.co/ezOTGy1a1G
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.credential-access
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: ps_script
detection:
    selection:
        ScriptBlockText|contains: 'PromptForCredential'
        EventID: 4104
    condition: selection
falsepositives:
    - Unknown
level: high
