title: Raspberry Robin Subsequent Execution of Commands
status: Developed
description: Detects raspberry robin subsequent execution of commands.
references:
    - https://redcanary.com/blog/raspberry-robin/
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.001
    - detection.emerging-threats
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentProcessName|endswith: '\fodhelper.exe'
        NewProcessName|endswith:
            - '\rundll32.exe'
            - '\regsvr32.exe'
        CommandLine|contains|all:
            - 'odbcconf.exe'
            - 'regsvr'
            - 'shellexec_rundll'
        CommandLine|contains:
            - 'installdriver'
            - 'setfiledsndir'
            - 'vkipdse'
        CommandLine|endswith|windash:
            - '/a'
            - '/f'
            - '/s'
        EventID: 4688
    condition: selection
    VQL: |
        LET ID_1730 = (
            ParentProcessName =~ "\\fodhelper\\.exe$" AND
            (NewProcessName =~ "\\rundll32\\.exe$" OR
             NewProcessName =~ "\\regsvr32\\.exe$") AND
            CommandLine =~ "(?=.*odbcconf\\.exe)(?=.*regsvr)(?=.*shellexec_rundll)" AND
            (CommandLine =~ "installdriver" OR
             CommandLine =~ "setfiledsndir" OR
             CommandLine =~ "vkipdse") AND
            (CommandLine =~ "/a$" OR
             CommandLine =~ "/f$" OR
             CommandLine =~ "/s$")
        )
falsepositives:
    - Unlikely
level: high
