title: Suspicious PowerShell Download and Execute Pattern
status: Experimental
description: Detects suspicious PowerShell download patterns that are often used in malicious scripts, stagers or downloaders (make sure that your backend applies the strings case-insensitive)
references:
    - https://gist.github.com/jivoi/c354eaaf3019352ce32522f916c03d70
    - https://www.trendmicro.com/en_us/research/22/j/lv-ransomware-exploits-proxyshell-in-attack.html
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        EventID: 4688
        CommandLine|contains: # make sure that your backend applies the strings case-insensitive
            - 'IEX ((New-Object Net.WebClient).DownloadString'
            - 'IEX (New-Object Net.WebClient).DownloadString'
            - 'IEX((New-Object Net.WebClient).DownloadString'
            - 'IEX(New-Object Net.WebClient).DownloadString'
            - ' -command (New-Object System.Net.WebClient).DownloadFile('
            - ' -c (New-Object System.Net.WebClient).DownloadFile('
    condition: selection
falsepositives:
    - Software installers that pull packages from remote systems and execute them
level: high
VQL: |
    LET ID_1772 = (
        CommandLine =~ "(?=.*IEX\\s*\\(\\(New-Object\\s*Net\\.WebClient\\)\\.DownloadString|.*IEX\\s*\\(New-Object\\s*Net\\.WebClient\\)\\.DownloadString|.*IEX\\(\\(New-Object\\s*Net\\.WebClient\\)\\.DownloadString|.*IEX\\(New-Object\\s*Net\\.WebClient\\)\\.DownloadString|.*-command\\s*\\(New-Object\\s*System\\.Net\\.WebClient\\)\\.DownloadFile\\(|.*-c\\s*\\(New-Object\\s*System\\.Net\\.WebClient\\)\\.DownloadFile\\()"
    )
