title: Potential Emotet Activity
status: Developed
description: Detects all Emotet like process executions that are not covered by the more generic rules
references:
    - https://app.any.run/tasks/e13ab713-64cf-4b23-ad93-6dceaa5429ac/
    - https://app.any.run/tasks/81f3c28c-c686-425d-8a2b-a98198d244e1/
    - https://app.any.run/tasks/97f875e8-0e08-4328-815f-055e971ba754/
    - https://app.any.run/tasks/84fc9b4a-ea2b-47b1-8aa6-9014402dfb56/
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.001
    - attack.defense-evasion
    - attack.t1027
    - detection.emerging-threats
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        EventID: 4688
        CommandLine|contains:
            - ' -e* PAA'
            - 'JABlAG4AdgA6AHUAcwBlAHIAcAByAG8AZgBpAGwAZQ' # $env:userprofile
            - 'QAZQBuAHYAOgB1AHMAZQByAHAAcgBvAGYAaQBsAGUA' # $env:userprofile
            - 'kAGUAbgB2ADoAdQBzAGUAcgBwAHIAbwBmAGkAbABlA' # $env:userprofile
            - 'IgAoACcAKgAnACkAOwAkA' # "('*');$
            - 'IAKAAnACoAJwApADsAJA' # "('*');$
            - 'iACgAJwAqACcAKQA7ACQA' # "('*');$
            - 'JABGAGwAeAByAGgAYwBmAGQ'
            - 'PQAkAGUAbgB2ADoAdABlAG0AcAArACgA' # =$env:temp+(
            - '0AJABlAG4AdgA6AHQAZQBtAHAAKwAoA' # =$env:temp+(
            - '9ACQAZQBuAHYAOgB0AGUAbQBwACsAKA' # =$env:temp+(
    filter:
        CommandLine|contains:
            - 'fAAgAEMAbwBuAHYAZQByAHQAVABvAC0ASgBzAG8AbgAgAC0ARQByAHIAbwByAEEAYwB0AGkAbwBuACAAUwBpAGwAZQBuAHQAbAB5AEMAbwBuAHQAaQBuAHUAZQ'
            - 'wAIABDAG8AbgB2AGUAcgB0AFQAbwAtAEoAcwBvAG4AIAAtAEUAcgByAG8AcgBBAGMAdABpAG8AbgAgAFMAaQBsAGUAbgB0AGwAeQBDAG8AbgB0AGkAbgB1AGUA'
            - '8ACAAQwBvAG4AdgBlAHQAVABvAC0ASgBzAG8AbgAgAC0ARQByAHIAbwByAEEAYwB0AGkAbwBuACAAUwBpAGwAZQBuAHQAbAB5AEMAbwBuAHQAaQBuAHUAZQ'
    condition: selection and not filter
    VQL: |
        LET ID_1729 = (
            CommandLine =~ "(?=.* -e\\* PAA|.*JABlAG4AdgA6AHUAcwBlAHIAcAByAG8AZgBpAGwAZQ|.*QAZQBuAHYAOgB1AHMAZQByAHAAcgBvAGYAaQBsAGUA|.*kAGUAbgB2ADoAdQBzAGUAcgBwAHIAbwBmAGkAbABlA|.*IgAoACcAKgAnACkAOwAkA|.*IAKAAnACoAJwApADsAJA|.*iACgAJwAqACcAKQA7ACQA|.*JABGAGwAeAByAGgAYwBmAGQ|.*PQAkAGUAbgB2ADoAdABlAG0AcAArACgA|.*0AJABlAG4AdgA6AHQAZQBtAHAAKwAoA|.*9ACQAZQBuAHYAOgB0AGUAbQBwACsAKA)" AND
            NOT CommandLine =~ "(?=.*fAAgAEMAbwBuAHYAZQByAHQAVABvAC0ASgBzAG8AbgAgAC0ARQByAHIAbwByAEEAYwB0AGkAbwBuACAAUwBpAGwAZQBuAHQAbAB5AEMAbwBuAHQAaQBuAHUAZQ|.*wAIABDAG8AbgB2AGUAcgB0AFQAbwAtAEoAcwBvAG4AIAAtAEUAcgByAG8AcgBBAGMAdABpAG8AbgAgAFMAaQBsAGUAbgB0AGwAeQBDAG8AbgB0AGkAbgB1AGUA|.*8ACAAQwBvAG4AdgBlAHQAVABvAC0ASgBzAG8AbgAgAC0ARQByAHIAbwByAEEAYwB0AGkAbwBuACAAUwBpAGwAZQBuAHQAbAB5AEMAbwBuAHQAaQBuAHUAZQ)"
        )
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unlikely
level: high
