title: Trap Signals Usage
status: Experimental
description: Detects the use of the `trap` command, which allows programs and shells to specify commands that execute upon receiving interrupt signals. This can be used for persistence or malicious execution.
author: Amr Ashraf
logsource:
  category: process_creation
  product: unix
detection:
  selection:
    - ProcessName: "trap"
      CommandLine|contains: "signals"
  condition: selection
fields:
  - ProcessName
  - CommandLine
  - ParentProcessName
  - ProcessPath
  - User
  - Hostname
level: medium
tags:
  - attack.execution
  - attack.persistence
  - t1154
falsepositives:
  - Legitimate usage of the `trap` command for signal handling in scripts or programs