title: Suspicious PowerShell Parameter Substring
status: Experimental
description: Detects suspicious PowerShell invocation with a parameter substring
references:
    - http://www.danielbohannon.com/blog-1/2017/3/12/powershell-execution-argument-obfuscation-how-it-can-make-detection-easier
author: Amr Ashraf
date: 2024/12/24
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        EventID: 4688
        NewProcessName|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        CommandLine|contains:
            - ' -windowstyle h '
            - ' -windowstyl h'
            - ' -windowsty h'
            - ' -windowst h'
            - ' -windows h'
            - ' -windo h'
            - ' -wind h'
            - ' -win h'
            - ' -wi h'
            - ' -win h '
            - ' -win hi '
            - ' -win hid '
            - ' -win hidd '
            - ' -win hidde '
            - ' -NoPr '
            - ' -NoPro '
            - ' -NoProf '
            - ' -NoProfi '
            - ' -NoProfil '
            - ' -nonin '
            - ' -nonint '
            - ' -noninte '
            - ' -noninter '
            - ' -nonintera '
            - ' -noninterac '
            - ' -noninteract '
            - ' -noninteracti '
            - ' -noninteractiv '
            - ' -ec '
            - ' -encodedComman '
            - ' -encodedComma '
            - ' -encodedComm '
            - ' -encodedCom '
            - ' -encodedCo '
            - ' -encodedC '
            - ' -encoded '
            - ' -encode '
            - ' -encod '
            - ' -enco '
            - ' -en '
            - ' -executionpolic '
            - ' -executionpoli '
            - ' -executionpol '
            - ' -executionpo '
            - ' -executionp '
            - ' -execution bypass'
            - ' -executio bypass'
            - ' -executi bypass'
            - ' -execut bypass'
            - ' -execu bypass'
            - ' -exec bypass'
            - ' -exe bypass'
            - ' -ex bypass'
            - ' -ep bypass'
            - ' /windowstyle h '
            - ' /windowstyl h'
            - ' /windowsty h'
            - ' /windowst h'
            - ' /windows h'
            - ' /windo h'
            - ' /wind h'
            - ' /win h'
            - ' /wi h'
            - ' /win h '
            - ' /win hi '
            - ' /win hid '
            - ' /win hidd '
            - ' /win hidde '
            - ' /NoPr '
            - ' /NoPro '
            - ' /NoProf '
            - ' /NoProfi '
            - ' /NoProfil '
            - ' /nonin '
            - ' /nonint '
            - ' /noninte '
            - ' /noninter '
            - ' /nonintera '
            - ' /noninterac '
            - ' /noninteract '
            - ' /noninteracti '
            - ' /noninteractiv '
            - ' /ec '
            - ' /encodedComman '
            - ' /encodedComma '
            - ' /encodedComm '
            - ' /encodedCom '
            - ' /encodedCo '
            - ' /encodedC '
            - ' /encoded '
            - ' /encode '
            - ' /encod '
            - ' /enco '
            - ' /en '
            - ' /executionpolic '
            - ' /executionpoli '
            - ' /executionpol '
            - ' /executionpo '
            - ' /executionp '
            - ' /execution bypass'
            - ' /executio bypass'
            - ' /executi bypass'
            - ' /execut bypass'
            - ' /execu bypass'
            - ' /exec bypass'
            - ' /exe bypass'
            - ' /ex bypass'
            - ' /ep bypass'
    condition: selection
falsepositives:
    - Unknown
level: high
VQL: |
    LET ID_1773 = (
        (NewProcessName =~ "(?=.*\\\\powershell\\.exe$|.*\\\\pwsh\\.exe$)") AND
        (CommandLine =~ "(?=.*\\s-windowstyle\\sh\\s|.*\\s-windowstyl\\sh|.*\\s-windowsty\\sh|.*\\s-windowst\\sh|.*\\s-windows\\sh|.*\\s-windo\\sh|.*\\s-wind\\sh|.*\\s-win\\sh|.*\\s-wi\\sh|.*\\s-win\\sh\\s|.*\\s-win\\shi\\s|.*\\s-win\\shid\\s|.*\\s-win\\shidd\\s|.*\\s-win\\shidde\\s|.*\\s-NoPr\\s|.*\\s-NoPro\\s|.*\\s-NoProf\\s|.*\\s-NoProfi\\s|.*\\s-NoProfil\\s|.*\\s-nonin\\s|.*\\s-nonint\\s|.*\\s-noninte\\s|.*\\s-noninter\\s|.*\\s-nonintera\\s|.*\\s-noninterac\\s|.*\\s-noninteract\\s|.*\\s-noninteracti\\s|.*\\s-noninteractiv\\s|.*\\s-ec\\s|.*\\s-encodedComman\\s|.*\\s-encodedComma\\s|.*\\s-encodedComm\\s|.*\\s-encodedCom\\s|.*\\s-encodedCo\\s|.*\\s-encodedC\\s|.*\\s-encoded\\s|.*\\s-encode\\s|.*\\s-encod\\s|.*\\s-enco\\s|.*\\s-en\\s|.*\\s-executionpolic\\s|.*\\s-executionpoli\\s|.*\\s-executionpol\\s|.*\\s-executionpo\\s|.*\\s-executionp\\s|.*\\s-execution\\sbypass|.*\\s-executio\\sbypass|.*\\s-executi\\sbypass|.*\\s-execut\\sbypass|.*\\s-execu\\sbypass|.*\\s-exec\\sbypass|.*\\s-exe\\sbypass|.*\\s-ex\\sbypass|.*\\s-ep\\sbypass|.*\\s\\/windowstyle\\sh\\s|.*\\s\\/windowstyl\\sh|.*\\s\\/windowsty\\sh|.*\\s\\/windowst\\sh|.*\\s\\/windows\\sh|.*\\s\\/windo\\sh|.*\\s\\/wind\\sh|.*\\s\\/win\\sh|.*\\s\\/wi\\sh|.*\\s\\/win\\sh\\s|.*\\s\\/win\\shi\\s|.*\\s\\/win\\shid\\s|.*\\s\\/win\\shidd\\s|.*\\s\\/win\\shidde\\s|.*\\s\\/NoPr\\s|.*\\s\\/NoPro\\s|.*\\s\\/NoProf\\s|.*\\s\\/NoProfi\\s|.*\\s\\/NoProfil\\s|.*\\s\\/nonin\\s|.*\\s\\/nonint\\s|.*\\s\\/noninte\\s|.*\\s\\/noninter\\s|.*\\s\\/nonintera\\s|.*\\s\\/noninterac\\s|.*\\s\\/noninteract\\s|.*\\s\\/noninteracti\\s|.*\\s\\/noninteractiv\\s|.*\\s\\/ec\\s|.*\\s\\/encodedComman\\s|.*\\s\\/encodedComma\\s|.*\\s\\/encodedComm\\s|.*\\s\\/encodedCom\\s|.*\\s\\/encodedCo\\s|.*\\s\\/encodedC\\s|.*\\s\\/encoded\\s|.*\\s\\/encode\\s|.*\\s\\/encod\\s|.*\\s\\/enco\\s|.*\\s\\/en\\s|.*\\s\\/executionpolic\\s|.*\\s\\/executionpoli\\s|.*\\s\\/executionpol\\s|.*\\s\\/executionpo\\s|.*\\s\\/executionp\\s|.*\\s\\/execution\\sbypass|.*\\s\\/executio\\sbypass|.*\\s\\/executi\\sbypass|.*\\s\\/execut\\sbypass|.*\\s\\/execu\\sbypass|.*\\s\\/exec\\sbypass|.*\\s\\/exe\\sbypass|.*\\s\\/ex\\sbypass|.*\\s\\/ep\\sbypass)")
    )
