title: PowerShell DownloadFile
status: Developed
description: Detects the execution of powershell, a WebClient object creation and the invocation of DownloadFile in a single command line
references:
    - https://www.fireeye.com/blog/threat-research/2020/03/apt41-initiates-global-intrusion-campaign-using-multiple-exploits.html
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.001
    - attack.command-and-control
    - attack.t1104
    - attack.t1105
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - 'powershell'
            - '.DownloadFile'
            - 'System.Net.WebClient'
        EventID: 4688
    condition: selection
falsepositives:
    - Unknown
level: high
