title: Potentially Suspicious WebDAV LNK Execution
status: Developed
description: Detects possible execution via LNK file accessed on a WebDAV server.
references:
    - https://www.trellix.com/en-us/about/newsroom/stories/research/beyond-file-search-a-novel-method.html
    - https://micahbabinski.medium.com/search-ms-webdav-and-chill-99c5b23ac462
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.001
    - attack.t1204
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        EventID: 4688
        ParentProcessName|endswith: '\explorer.exe'
        NewProcessName|endswith:
            - '\cmd.exe'
            - '\cscript.exe'
            - '\mshta.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\wscript.exe'
        CommandLine|contains: '\DavWWWRoot\'
    condition: selection
falsepositives:
    - Unknown
level: medium
VQL: |
    LET ID_1787 = (
        ParentProcessName =~ "\\explorer\\.exe$" AND
        (NewProcessName =~ "\\cmd\\.exe$" OR
         NewProcessName =~ "\\cscript\\.exe$" OR
         NewProcessName =~ "\\mshta\\.exe$" OR
         NewProcessName =~ "\\powershell\\.exe$" OR
         NewProcessName =~ "\\pwsh\\.exe$" OR
         NewProcessName =~ "\\wscript\\.exe$") AND
        CommandLine =~ "\\\\DavWWWRoot\\\\"
    )
