title: Detect Radmin Viewer Utility Execution
status: Experimental
description: Detects the execution of Radmin Viewer utility which may indicate unauthorized remote access.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith:
      - 'Radmin.exe'
  condition: selection
VQL: |
  LET ID_1492 = (
      NewProcessName =~ "Radmin\\.exe$"
  )
fields:
  - CommandLine
  - Image
  - ParentImage
  - User
falsepositives:
  - Legitimate use of Radmin Viewer for remote management.
level: high
tags:
  - attack.execution
  - T1072
