title: Detection of PowerShell Execution via Sqlps.exe
status: Developed
description: |
    This rule detects execution of a PowerShell code through the sqlps.exe utility, which is included in the standard set of utilities supplied with the MSSQL Server.
    Script blocks are not logged in this case, so this utility helps to bypass protection mechanisms based on the analysis of these logs.
references:
        - https://learn.microsoft.com/en-us/sql/tools/sqlps-utility?view=sql-server-ver15
        - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Sqlps/
        - https://twitter.com/bryon_/status/975835709587075072
author: 'Amr Ashraf'
date: 2024-12-24
tags:
        - attack.execution
        - attack.t1059.001
        - attack.defense-evasion
        - attack.t1127
logsource:
        category: process_creation
        product: windows
detection:
        selection_parent:
                ParentProcessName|endswith: '\sqlps.exe'
        selection_image:
                - NewProcessName|endswith: '\sqlps.exe'
                - EventID: 4688
        filter_image:
                ParentProcessName|endswith: '\sqlagent.exe'
        condition: selection_parent or (selection_image and not filter_image)
        VQL: |
            LET ID_1734 = (
                (ParentProcessName =~ "\\sqlps\\.exe$") OR
                (NewProcessName =~ "\\sqlps\\.exe$" AND NOT ParentProcessName =~ "\\sqlagent\\.exe$")
            )
falsepositives:
        - Direct PS command execution through SQLPS.exe is uncommon, childprocess sqlps.exe spawned by sqlagent.exe is a legitimate action.
level: medium
