title: Potential PowerShell Obfuscation Via Reversed Commands
status: Experimental
description: Detects the presence of reversed PowerShell commands in the CommandLine. This is often used as a method of obfuscation by attackers
references:
    - https://2019.offzone.moscow/ru/report/hunting-for-powershell-abuses/
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=66
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - EventID: 4688
        - NewProcessName|endswith:
              - '\powershell.exe'
              - '\pwsh.exe'
    selection_cli:
        CommandLine|contains:
            - 'hctac'
            - 'kaerb'
            - 'dnammoc'
            - 'ekovn' # Also covers 'ekovni'
            - 'eliFd'
            - 'rahc'
            - 'etirw'
            - 'golon'
            - 'tninon'
            - 'eddih'
            - 'tpircS'
            - 'ssecorp'
            - 'llehsrewop'
            - 'esnopser'
            - 'daolnwod'
            - 'tneilCbeW'
            - 'tneilc'
            - 'ptth'
            - 'elifotevas'
            - '46esab'
            - 'htaPpmeTteG'
            - 'tcejbO'
            - 'maerts'
            - 'hcaerof'
            - 'retupmoc'
    filter_main_encoded_keyword:
        CommandLine|contains:
            - ' -EncodedCommand '
            - ' -enc '
    condition: all of selection_* and not 1 of filter_main_*
falsepositives:
    - Unlikely
level: high
VQL: |
    LET ID_1747 = (
        (NewProcessName =~ "\\powershell\\.exe$" OR NewProcessName =~ "\\pwsh\\.exe$") AND
        CommandLine =~ "(?=.*hctac|.*kaerb|.*dnammoc|.*ekovn|.*eliFd|.*rahc|.*etirw|.*golon|.*tninon|.*eddih|.*tpircS|.*ssecorp|.*llehsrewop|.*esnopser|.*daolnwod|.*tneilCbeW|.*tneilc|.*ptth|.*elifotevas|.*46esab|.*htaPpmeTteG|.*tcejbO|.*maerts|.*hcaerof|.*retupmoc)" AND
        NOT CommandLine =~ "(?=.* -EncodedCommand |.* -enc )"
    )
