title: Invoke-Obfuscation Via Use MSHTA
status: Developed
description: Detects Obfuscated Powershell via use MSHTA in Scripts
references:
    - https://github.com/SigmaHQ/sigma/issues/1009   # (Task31)
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - 'set'
            - '&&'
            - 'mshta'
            - 'vbscript:createobject'
            - '.run'
            - '(window.close)'
        EventID: 4688
    condition: selection
falsepositives:
    - Unknown
level: high
VQL: |
    LET ID_1721 = (
        CommandLine =~ "(?=.*set)(?=.*&&)(?=.*mshta)(?=.*vbscript:createobject)(?=.*\\.run)(?=.*\\(window\\.close\\))"
    )
