title: HackTool - Covenant PowerShell Launcher
status: Developed
description: Detects suspicious command lines used in Covenant launchers
references:
    - https://posts.specterops.io/covenant-v0-5-eee0507b85ba
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1059.001
    - attack.t1564.003
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        CommandLine|contains|all:
            - '-Sta'
            - '-Nop'
            - '-Window'
            - 'Hidden'
        CommandLine|contains:
            - '-Command'
            - '-EncodedCommand'
        EventID: 4688
    selection_2:
        CommandLine|contains:
            - 'sv o (New-Object IO.MemorySteam);sv d '
            - 'mshta file.hta'
            - 'GruntHTTP'
            - '-EncodedCommand cwB2ACAAbwAgA'
        EventID: 4688
    condition: 1 of selection_*
level: high
