title: Powershell Inline Execution From A File
status: Developed
description: Detects inline execution of PowerShell code from a file
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=50
author: Amr Ashraf
date: 2024-12-24
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: process_creation
detection:
    selection_exec:
        CommandLine|contains:
            - 'iex '
            - 'Invoke-Expression '
            - 'Invoke-Command '
            - 'icm '
        EventID: 4688
    selection_read:
        CommandLine|contains:
            - 'cat '
            - 'get-content '
            - 'type '
    selection_raw:
        CommandLine|contains: ' -raw'
    condition: all of selection_*
VQL: |
    LET ID_1757 = (
        (CommandLine =~ "(?=.*iex |.*Invoke-Expression |.*Invoke-Command |.*icm )") AND
        (CommandLine =~ "(?=.*cat |.*get-content |.*type )") AND
        (CommandLine =~ " -raw")
    )
falsepositives:
    - Unknown
level: medium
