title: First Time Seen Commonly Abused Remote Access Tool Execution
description: Detects processes with names or code signatures resembling commonly abused remote access tools (RATs) being executed for the first time in the environment. Such tools can be used for command and control, persistence, or other malicious activities.
status: Developed
date: 2024-12-01
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|contains:
      - "AeroAdmin.exe"
      - "AnyDesk.exe"
      - "AteraAgent.exe"
      - "ISLLight.exe"
      - "ISLLightClient.exe"
      - "LogMeIn.exe"
      - "RemotePC.exe"
      - "rustdesk.exe"
      - "Supremo.exe"
      - "teamviewer.exe"
      - "UltraVNC.exe"
      - "vncviewer.exe"
  condition: selection
fields:
  - process_name
  - process_path
  - parent_process_name
  - user_name
  - host_name
falsepositives:
  - Legitimate use by IT or support teams with authorized remote access tools
level: medium
tags:
  - attack.command_and_control
  - attack.T1219
