title: Masquerading as FreeBSD or Linux crond process. - DFE-002-E-000-0002
id: DFE-002-E-000-0002
status: experimental
description: |
  Detection Description:
  Detects Masquerading as FreeBSD or Linux crond process..
  
  Status:
  experimental
  
  Threat Mapping:
  MITRE ATT&CK Technique(s): T1036 – Masquerading
  Kill Chain Phase: Defense Evasion
  
  Data Sources:
  MITRE Data Source: Process: Process Creation
  Product targeted by the Rule: Linux Server
  Service in the product that provides the log: auditd
  
  Detection Logic:
  See Sigma detection section.
  
  False Positive Considerations:
  See falsepositives section.
  
  Severity and Risk Rating:
  Severity Level: Medium
  
  References:
  See references section.
  
  Author:
  HXP Detection team
  
  Use Case Sheet Details:
  - L3 use cases per L2: 15
  - L1 Use Case Name: Defence Evasion
  - L1 Use Case Identifier: DFE
  - L2 Use Case Name: Masquerading & Rename System Utilities
  - L2 Use Case Identifier: DFE-002
  - Rule Identifier: DFE-002-E-000-0002
  - Technical Use Case Name: Masquerading as FreeBSD or Linux crond process.
  - Use Case Description:
  - Log source type: Linux Servers
  - Detection Technology: SIEM
  - Scope: All assets
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/techniques/T1036/
tags:
  - attack.defense_evasion
  - attack.t1036
logsource:
  category: process_creation
  product: linux
  service: auditd
detection:
  \
          selection:
            Image|endswith:
              - '/crond'
              - '/cron'
          legit_paths:
            Image|startswith:
              - '/usr/sbin/'
              - '/usr/bin/'
              - '/sbin/'
          condition: selection and not legit_paths
falsepositives:
  - Legitimate portable apps or custom deployments in non-standard paths
  - IT troubleshooting tools renamed for packaging
  - Software updates executed from temporary directories (verify publisher/path)
level: medium
