title: HackTool - Mimikatz Kirbi File Creation
status: Experimental
description: Detects the creation of files created by mimikatz such as ".kirbi", "mimilsa.log", etc.
date: 2021-11-08
Author: Amr Ashraf
tags:
    - attack.credential-access
    - T1003.001
logsource:
    category: file_event
    product: windows
detection:
    selection:
        EventID: 11
        TargetFilename|endswith:
            - '.kirbi' # Kerberos tickets
            - 'mimilsa.log' # MemSSP default file
            - 'mimikatz'
    condition: selection
falsepositives:
    - Unlikely
level: critical