title: Detect Suspicious Additions to SSH Authorized Keys
id: detect-ssh-authorized-keys-addition
status: Developed
description: Detects suspicious additions to the SSH authorized_keys file by monitoring file modifications and focusing on the process and user context.
author: Amr Ashraf
logsource:
  category: file_event
  product: linux
detection:
  selection:
    EventID: 'auditd'
    FileName|endswith: '/.ssh/authorized_keys'
    Access: 'WRITE'
  filter_process:
    ProcessName|contains:
      - 'vim'
      - 'nano'
      - 'echo'
      - 'cat'
  condition: selection and (filter_process or filter_user)
fields:
  - EventID
  - FileName
  - Access
  - User
  - ProcessName
  - CommandLine
level: high
tags:
  - attack.persistence
  - attack.privilege_escalation
  - t1098
falsepositives:
  - Legitimate key additions by authorized users or processes
  - Administrative tasks using non-standard tools
