title: Potential UAC Bypass Via Sdclt
status: Experimental
author: Amr Ashraf
date: 2024/11/09
description: A General detection for sdclt being spawned as an elevated process. This could be an indicator of sdclt being used for bypass UAC techniques.
tags:
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        NewProcessName|endswith: sdclt.exe
        MandatoryLabel: S-1-16-12288
    condition: process_creation and selection
VQL: |
  LET ID_1221 = (
      NewProcessName =~ "sdclt\\.exe$" AND
      MandatoryLabel == "S-1-16-12288"
  )
falsepositives:
    - Unknown
level: medium