title: UAC Bypass WSReset
status: Developed
author: Amr Ashraf
date: 2024/11/09
description: Detects the pattern of UAC Bypass via WSReset usable by default sysmon-config
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        NewProcessName|endswith: \wsreset.exe
        MandatoryLabel:
            - S-1-16-12288
            - S-1-16-16384
    condition: process_creation and selection
VQL: |
  LET ID_1223 = (
      NewProcessName =~ "\\wsreset\\.exe$" AND
      (MandatoryLabel == "S-1-16-12288" OR MandatoryLabel == "S-1-16-16384")
  )
falsepositives:
    - Unknown
level: high