title: HackTool - Empire PowerShell UAC Bypass
status: Developed
author: Amr Ashraf
date: 2024/11/09
description: Detects some Empire PowerShell UAC bypass methods
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
    - car.2019-04-001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|re:
            - ' -NoP *-NonI *-w *Hidden *-c *$x=$((gp *HKCU:Software\Microsoft\Windows Update).Update)'
            - ' -NoP *-NonI *-c *$x=$((gp *HKCU:Software\Microsoft\Windows Update).Update);'
    condition: process_creation and selection
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
level: critical