title: UAC Bypass Using PkgMgr and DISM
status: Developed
author: Amr Ashraf
date: 2024/11/09
description: Detects the pattern of UAC Bypass using pkgmgr.exe and dism.exe (UACMe 23)
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \pkgmgr.exe
        NewProcessName|endswith: \dism.exe
        MandatoryLabel:
            - S-1-16-12288
            - S-1-16-16384
    condition: process_creation and selection
    VQL: |
      LET ID_1220 = (
          ParentProcessName =~ "\\pkgmgr\\.exe$" AND
          NewProcessName =~ "\\dism\\.exe$" AND
          (MandatoryLabel == "S-1-16-12288" OR MandatoryLabel == "S-1-16-16384")
      )
falsepositives:
    - Unknown
level: high