title: UAC Bypass Using ChangePK and SLUI
status: Experimental
author: Amr Ashraf
date: 2024/11/09
description: Detects an UAC bypass that uses changepk.exe and slui.exe (UACMe 61)
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        NewProcessName|endswith: \changepk.exe
        ParentProcessName|endswith: \slui.exe
        MandatoryLabel:
            - S-1-16-12288
            - S-1-16-16384
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
VQL:
  LET ID_1212 = (
      NewProcessName =~ "\\changepk\\.exe$" AND
      ParentProcessName =~ "\\slui\\.exe$" AND
      (MandatoryLabel == "S-1-16-12288" OR MandatoryLabel == "S-1-16-16384")
  )