title: UAC Bypass Using Windows Media Player - Process
status: Experimental
author: Amr Ashraf
date: 2024/11/09
description: Detects the pattern of UAC Bypass using Windows Media Player osksupport.dll (UACMe 32)
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection1:
        NewProcessName: C:\Program Files\Windows Media Player\osk.exe
        MandatoryLabel:
            - S-1-16-12288
            - S-1-16-16384
    selection2:
        ParentCommandLine: '"C:\Windows\system32\mmc.exe" "C:\Windows\system32\eventvwr.msc" /s'
        NewProcessName: C:\Windows\System32\cmd.exe
        MandatoryLabel:
            - S-1-16-12288
            - S-1-16-16384
    condition: process_creation and (1 of selection*)
VQL: |
  LET ID_1222 = (
      (NewProcessName == "C:\\Program Files\\Windows Media Player\\osk.exe" AND
       (MandatoryLabel == "S-1-16-12288" OR MandatoryLabel == "S-1-16-16384")) OR
      (ParentCommandLine == '"C:\\Windows\\system32\\mmc.exe" "C:\\Windows\\system32\\eventvwr.msc" /s' AND
       NewProcessName == "C:\\Windows\\System32\\cmd.exe" AND
       (MandatoryLabel == "S-1-16-12288" OR MandatoryLabel == "S-1-16-16384"))
  )
falsepositives:
    - Unknown
level: high