title: UAC Bypass Using Event Viewer RecentViews
status: Developed
author: Amr Ashraf
date: 2024/11/09
description: Detects the pattern of UAC Bypass using Event Viewer RecentViews
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_path:
        # Example: ysoserial.exe -o raw -f BinaryFormatter - g DataSet -c calc > RecentViews & copy RecentViews %LOCALAPPDATA%\Microsoft\EventV~1\RecentViews & eventvwr.exe
        CommandLine|contains:
            - \Event Viewer\RecentViews
            - \EventV~1\RecentViews
    selection_redirect:
        CommandLine|contains: '>'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high