title: Potentially Suspicious Event Viewer Child Process
description: Detects uncommon or suspicious child processes of "eventvwr.exe" which might indicate a UAC bypass attempt
status: Experimental
author: Amr Ashraf
date: 2024/11/25
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
    - car.2019-04-001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \eventvwr.exe
    filter_main_generic:
        NewProcessName|endswith:
            - \Windows\System32\mmc.exe
            - \Windows\System32\WerFault.exe
            - \Windows\SysWOW64\WerFault.exe
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: high
VQL:
  LET ID_1210 = (
      ParentProcessName =~ "\\eventvwr\\.exe$" AND
      NOT (NewProcessName =~ "\\Windows\\System32\\mmc\\.exe$" OR
           NewProcessName =~ "\\Windows\\System32\\WerFault\\.exe$" OR
           NewProcessName =~ "\\Windows\\SysWOW64\\WerFault\\.exe$")
  )