title: UAC Bypass Using IEInstal - Process
status: Developed
author: Amr Ashraf
date: 2024/11/09
description: Detects the pattern of UAC Bypass using IEInstal.exe (UACMe 64)
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        MandatoryLabel:
            - S-1-16-12288
            - S-1-16-16384
        ParentProcessName|endswith: \ieinstal.exe
        NewProcessName|contains: \AppData\Local\Temp\
        NewProcessName|endswith: consent.exe
    condition: process_creation and selection
VQL: |
  LET ID_1217 = (
      (MandatoryLabel == "S-1-16-12288" OR MandatoryLabel == "S-1-16-16384") AND
      ParentProcessName =~ "\\ieinstal\\.exe$" AND
      NewProcessName =~ "\\AppData\\Local\\Temp\\.*consent\\.exe$"
  )
falsepositives:
    - Unknown
level: high