title: UAC Bypass Using Consent and Comctl32 - Process
status: Experimental
author: Amr Ashraf
date: 2024/11/09
description: Detects the pattern of UAC Bypass using consent.exe and comctl32.dll (UACMe 22)
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \consent.exe
        NewProcessName|endswith: \werfault.exe
        MandatoryLabel:
            - S-1-16-12288
            - S-1-16-16384
    condition: process_creation and selection
VQL: |
  LET ID_1214 = (
      ParentProcessName =~ "\\consent\\.exe$" AND
      NewProcessName =~ "\\werfault\\.exe$" AND
      (MandatoryLabel == "S-1-16-12288" OR MandatoryLabel == "S-1-16-16384")
  )
falsepositives:
    - Unknown
level: high