title: UAC Bypass Tools Using ComputerDefaults
status: Developed
author: Amr Ashraf
date: 2024/11/09
description: Detects tools such as UACMe used to bypass UAC with computerdefaults.exe (UACMe 59)
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        NewProcessName: C:\Windows\System32\ComputerDefaults.exe
    filter:
        ParentProcessName|contains:
            - :\Windows\System32
            - :\Program Files
    condition: process_creation and (selection and not filter)
falsepositives:
    - Unknown
level: high
VQL:
  LET ID_1213 = (
      NewProcessName == "C:\\Windows\\System32\\ComputerDefaults.exe" AND
      NOT (ParentProcessName =~ ":\\\\Windows\\\\System32" OR ParentProcessName =~ ":\\\\Program Files")
  )