title: Mounting Hidden Shares
status: Developed
description: Detects the enumeration of mounted shares using the built-in Windows tools `net.exe` or `net1.exe`. This behavior can be indicative of lateral movement or discovery activities.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - ProcessName:
        - "net.exe"
        - "net1.exe"
      CommandLine|contains:
        - "use"
        - "\\\\"
  filter:
      ParentProcessName|contains: "net.exe"
  condition: selection and not filter
fields:
  - ProcessName
  - ParentProcessName
  - CommandLine
  - ParentProcessPath
  - User
  - Hostname
level: medium
tags:
  - attack.lateral_movement
  - t1077
falsepositives:
  - Legitimate administrative tasks or authorized software enumerating shares