title: Potential WMI Lateral Movement WmiPrvSE Spawned PowerShell
description: Detects Powershell as a child of the WmiPrvSE process. Which could be a sign of lateral movement via WMI.
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.execution
    - attack.t1047
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: '\WmiPrvSE.exe'
    selection_img:
        - Image|endswith:
              - '\powershell.exe'
              - '\pwsh.exe'
        - OriginalFileName:
              - 'PowerShell.EXE'
              - 'pwsh.dll'
    condition: all of selection_*
falsepositives:
    - AppvClient
    - CCM
    - WinRM
level: medium
