title: Local Network Connection Initiated By Script Interpreter
description: |
    Detects a script interpreter (Wscript/Cscript) initiating a local network connection to download or execute a script hosted on a shared folder.
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.command-and-control
    - attack.t1105
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 5156
        Channel: Security
    selection:
        Direction: '%%14593'
        Application|endswith:
            - \wscript.exe
            - \cscript.exe
        DestAddress|cidr:
            - 127.0.0.0/8
            - 10.0.0.0/8
            - 172.16.0.0/12
            - 192.168.0.0/16
            - 169.254.0.0/16
            - ::1/128    # IPv6 loopback
            - fe80::/10    # IPv6 link-local addresses
            - fc00::/7    # IPv6 private addresses
    condition: network_connection and selection
falsepositives:
    - Legitimate scripts
level: medium