title: Detect Transient Systemd Service or Timer Creation (System Level)
status: Developed
description: Detects the use of the `systemd-run` command to create transient system-level systemd services or timers.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: linux
detection:
  selection_system_level:
    CommandLine|contains|all:
      - 'systemd-run'
    CommandLine|contains|any:
      - '--unit='
      - '--on-calendar='
  condition: selection_system_level
fields:
  - EventID
  - CommandLine
  - User
  - ParentProcessName
falsepositives:
  - Legitimate system administration tasks using `systemd-run`
level: high
tags:
  - attack.persistence
  - attack.execution
  - attack.t1053.005
