title: UAC Bypass Using DismHost
status: Developed
author: Amr Ashraf
date: 2024/11/09
description: Detects the pattern of UAC Bypass using DismHost DLL hijacking (UACMe 63)
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|contains|all:
            - C:\Users\
            - \AppData\Local\Temp\
            - \DismHost.exe
        MandatoryLabel:
            - S-1-16-12288
            - S-1-16-16384
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high