title: UAC Bypass Using NTFS Reparse Point - Process
status: Developed
author: Amr Ashraf
date: 2024/11/09
description: Detects the pattern of UAC Bypass using NTFS reparse point and wusa.exe DLL hijacking (UACMe 36)
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection1:
        CommandLine|startswith: '"C:\Windows\system32\wusa.exe"  /quiet C:\Users\'
        CommandLine|endswith: \AppData\Local\Temp\update.msu
        MandatoryLabel:
            - S-1-16-12288
            - S-1-16-16384
    selection2:
        ParentCommandLine: '"C:\Windows\system32\dism.exe" /online /quiet /norestart /add-package /packagepath:"C:\Windows\system32\pe386" /ignorecheck'
        CommandLine|contains|all:
            - C:\Users\
            - \AppData\Local\Temp\
            - \dismhost.exe {
        MandatoryLabel:
            - S-1-16-12288
            - S-1-16-16384
        NewProcessName|endswith: \DismHost.exe
    condition: process_creation and (1 of selection*)
falsepositives:
    - Unknown
level: high
