title: Clipboard Used for Command Execution
description: Detects the use of clipboard for storing or executing commands on Windows systems.
author: Amr Ashraf
date: 2024-12-06
status: developed
severity: medium
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains: 'clip <'
  condition: selection
falsepositives:
  - System administrators using clipboard for command transfer
tags:
  - attack.execution
  - attack.T1115
fields:
  - CommandLine
  - ParentImage
  - ParentCommandLine
