title: Detect Radmin Viewer Utility Execution
status: Developed
description: Detects the execution of Radmin Viewer utility which may indicate unauthorized remote access.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
      - 'Radmin.exe'
    Image|endswith:
      - '\Radmin Viewer 3\Radmin.exe'
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - User
falsepositives:
  - Legitimate use of Radmin Viewer for remote management.
level: high
tags:
  - attack.execution
  - attack.t1021.001
