title: Local Job Scheduling Paths
status: Experimental
description: Detects file modifications in common job scheduling paths on Linux and macOS systems, such as crontab and LaunchDaemons, which may indicate attempts to establish persistence or periodic execution.
author: Amr Ashraf
logsource:
  category: file_event
  product: unix
detection:
  selection:
    - FilePath|contains:
        - "/etc/crontab"
        - "/etc/cron.d"
        - "LaunchDaemons"
  condition: selection
fields:
  - FilePath
  - FileName
  - User
  - Hostname
  - Action
level: medium
tags:
  - attack.execution
  - attack.persistence
  - t1168
falsepositives:
  - Legitimate administrative or scheduled maintenance tasks
