title: Audio Capture Using Device Audio Commandlet
description: Detects the use of AudioDeviceCmdlets via PowerShell for capturing device audio.
author: Amr Ashraf
date: 2024-12-06
status: developed
severity: medium
logsource:
  category: script_block
  product: windows
detection:
  selection:
    EventID: 4104
    message|contains: 'WindowsAudioDevice-Powershell-Cmdlet'
  condition: selection
falsepositives:
  - Legitimate use of AudioDeviceCmdlets for system audio management.
tags:
  - attack.collection
  - attack.T1123
fields:
  - CommandLine
  - ParentCommandLine
  - Image
