title: Disable UAC notification via registry keys - PRE-002-E-000-0015
id: PRE-002-E-000-0015
status: experimental
description: |
  Detection Description:
  Detects Disable UAC notification via registry keys.
  
  Status:
  experimental
  
  Threat Mapping:
  MITRE ATT&CK Technique(s): T1548.002 – Bypass User Account Control
  Kill Chain Phase: Privilege Escalation
  
  Data Sources:
  MITRE Data Source: Windows Registry: Registry Key Modification
  Product targeted by the Rule: Windows Server
  Service in the product that provides the log: sysmon
  
  Detection Logic:
  See Sigma detection section.
  
  False Positive Considerations:
  See falsepositives section.
  
  Severity and Risk Rating:
  Severity Level: High
  
  References:
  See references section.
  
  Author:
  HXP Detection team
  
  Use Case Sheet Details:
  - L3 use cases per L2: 19
  - L1 Use Case Name: Privilege Escalation
  - L1 Use Case Identifier: PRE
  - L2 Use Case Name: Abuse of System Elevation Controls
  - L2 Use Case Identifier: PRE-002
  - Rule Identifier: PRE-002-E-000-0015
  - Technical Use Case Name: Disable UAC notification via registry keys
  - Use Case Description:
  - Log source type: Windows Servers
  - Detection Technology: SIEM
  - Scope: All assets
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/techniques/T1548/002/
tags:
  - attack.privilege_escalation
  - attack.t1548.002
logsource:
  category: registry_set
  product: windows
detection:
\
          selection:
            TargetObject|contains:
              - '\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\PromptOnSecureDesktop'
              - '\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\ConsentPromptBehaviorAdmin'
              - '\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\ConsentPromptBehaviorUser'
          condition: selection
falsepositives:
  - Red team / security testing
  - Rare administrative registry edits or troubleshooting
level: high
