title: Linux Setuid Binary Enumeration via find Command - PRE-002-E-000-0003
id: PRE-002-E-000-0003
status: experimental
description: |
  Detection Description:
  Detects Linux Setuid Binary Enumeration via find Command.
  
  Status:
  experimental
  
  Threat Mapping:
  MITRE ATT&CK Technique(s): T1548.001 – Setuid and Setgid
  Kill Chain Phase: Privilege Escalation
  
  Data Sources:
  MITRE Data Source: Process: Process Creation
  Product targeted by the Rule: Linux Server
  Service in the product that provides the log: auditd
  
  Detection Logic:
  See Sigma detection section.
  
  False Positive Considerations:
  See falsepositives section.
  
  Severity and Risk Rating:
  Severity Level: Medium
  
  References:
  See references section.
  
  Author:
  HXP Detection team
  
  Use Case Sheet Details:
  - L3 use cases per L2: 19
  - L1 Use Case Name: Privilege Escalation
  - L1 Use Case Identifier: PRE
  - L2 Use Case Name: Abuse of System Elevation Controls
  - L2 Use Case Identifier: PRE-002
  - Rule Identifier: PRE-002-E-000-0003
  - Technical Use Case Name: Linux Setuid Binary Enumeration via find Command
  - Use Case Description:
  - Log source type: Linux Servers
  - Detection Technology: SIEM
  - Scope: All assets
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/techniques/T1548/001/
tags:
  - attack.privilege_escalation
  - attack.t1548.001
logsource:
  category: process_creation
  product: linux
  service: auditd
detection:
selection:
  Image|endswith:
    - '/find'
  CommandLine|contains:
    - '-perm'
suid_bits:
  CommandLine|contains:
    - '-4000'
    - '4000'
    - '-2000'
    - '2000'
condition: selection and suid_bits
falsepositives:
  - Security/compliance audits
  - System administrators enumerating SUID/SGID files
level: medium
