title: UAC Bypass with WSReset Registry Modification - PRE-002-E-000-0019
id: PRE-002-E-000-0019
status: experimental
description: |
  Detection Description:
  Detects UAC Bypass with WSReset Registry Modification.
  
  Status:
  experimental
  
  Threat Mapping:
  MITRE ATT&CK Technique(s): T1548.002 – Bypass User Account Control
  Kill Chain Phase: Privilege Escalation
  
  Data Sources:
  MITRE Data Source: Windows Registry: Registry Key Modification
  Product targeted by the Rule: Windows Server
  Service in the product that provides the log: sysmon
  
  Detection Logic:
  See Sigma detection section.
  
  False Positive Considerations:
  See falsepositives section.
  
  Severity and Risk Rating:
  Severity Level: High
  
  References:
  See references section.
  
  Author:
  HXP Detection team
  
  Use Case Sheet Details:
  - L3 use cases per L2: 19
  - L1 Use Case Name: Privilege Escalation
  - L1 Use Case Identifier: PRE
  - L2 Use Case Name: Abuse of System Elevation Controls
  - L2 Use Case Identifier: PRE-002
  - Rule Identifier: PRE-002-E-000-0019
  - Technical Use Case Name: UAC Bypass with WSReset Registry Modification
  - Use Case Description:
  - Log source type: Windows Servers
  - Detection Technology: SIEM
  - Scope: All assets
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/techniques/T1548/002/
tags:
  - attack.privilege_escalation
  - attack.t1548.002
logsource:
  category: registry_set
  product: windows
detection:
\
          selection:
            TargetObject|contains: '\AppX82a6gwre4fdg3bt635tn5ctqjf8msdd2\Shell\open\command'
          value_names:
            TargetObject|endswith:
              - '\(Default)'
              - '\DelegateExecute'
          condition: selection and value_names
falsepositives:
  - Red team / security testing
  - Rare administrative registry edits or troubleshooting
level: high
