title: Linux Setuid Binary Discovery via ls and grep - PRE-002-E-000-0004
id: PRE-002-E-000-0004
status: experimental
description: |
  Detection Description:
  Detects Linux Setuid Binary Discovery via ls and grep.
  
  Status:
  experimental
  
  Threat Mapping:
  MITRE ATT&CK Technique(s): T1548.001 – Setuid and Setgid
  Kill Chain Phase: Privilege Escalation
  
  Data Sources:
  MITRE Data Source: Process: Process Creation
  Product targeted by the Rule: Linux Server
  Service in the product that provides the log: auditd
  
  Detection Logic:
  See Sigma detection section.
  
  False Positive Considerations:
  See falsepositives section.
  
  Severity and Risk Rating:
  Severity Level: Medium
  
  References:
  See references section.
  
  Author:
  HXP Detection team
  
  Use Case Sheet Details:
  - L3 use cases per L2: 19
  - L1 Use Case Name: Privilege Escalation
  - L1 Use Case Identifier: PRE
  - L2 Use Case Name: Abuse of System Elevation Controls
  - L2 Use Case Identifier: PRE-002
  - Rule Identifier: PRE-002-E-000-0004
  - Technical Use Case Name: Linux Setuid Binary Discovery via ls and grep
  - Use Case Description:
  - Log source type: Linux Servers
  - Detection Technology: SIEM
  - Scope: All assets
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/techniques/T1548/001/
tags:
  - attack.privilege_escalation
  - attack.t1548.001
logsource:
  category: process_creation
  product: linux
  service: auditd
detection:
selection_shell:
  Image|endswith:
    - '/bash'
    - '/sh'
  CommandLine|contains|all:
    - 'ls'
    - 'grep'
suid_hint:
  CommandLine|contains:
    - 'setuid'
    - 'suid'
    - 'rws'
    - '4000'
condition: selection_shell and suid_hint
falsepositives:
  - Security/compliance audits
  - System administrators enumerating SUID/SGID files
level: medium
