title: Detect Wordlist Scanning Activity with Threshold
id: detect-wordlist-scanning-threshold
status: Experimental
description: Detects excessive 404 or 403 responses within a specific time frame, which may indicate wordlist-based scanning on web servers.
author: Amr Ashraf
logsource:
  category: webserver
  product: any
detection:
  selection:
    StatusCode: [404, 403]
  timeframe: 1m
  condition: selection | count() > 20
fields:
  - StatusCode
  - RequestURI
  - UserAgent
  - SourceIP
  - Timestamp
  - Hostname
level: medium
tags:
  - attack.reconnaissance
  - t1595.003
falsepositives:
  - Automated vulnerability scanning by authorized tools.
  - Web server misconfigurations causing excessive 404 responses.
