title: Detect malicious useragents
id: detect-wordlist-scanning
status: Experimental
description: Detects malicious useragents
author: Amr Ashraf
logsource:
  category: webserver
  product: any
detection:
  selection:
    - UserAgent|contains:
        - 'gobuster'
        - 'dirb'
        - 'ffuf'
        - 'nikto'
        - 'nmap'
  condition: selection
fields:
  - StatusCode
  - RequestURI
  - UserAgent
  - SourceIP
  - Timestamp
  - Hostname
level: medium
tags:
  - attack.reconnaissance
  - t1595.003
