title: Detect Suspicious Local Account Enumeration
status: Developed
description: Detects suspicious commands or processes used to enumerate local accounts, commonly seen in post-exploitation activities.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - NewProcessName|endswith:
        - '\net.exe'
        - '\net1.exe'
      CommandLine|contains|re:
        - ' localgroup *administrators'
        - ' user'
        - ' accounts'
  selection_!:
    - NewProcessName|endswith:
        - '\cmd.exe'
      CommandLine|contains|re:
        - 'wmic *useraccount *get'
        - 'whoami */all'
        - 'net *user'
  selection_2:
    - NewProcessName|endswith:
        - '\powershell.exe'
      CommandLine|contains:
        - 'Get-LocalUser'
        - 'Get-LocalGroupMember'
  exclusion:
    - ParentImage|endswith:
        - '\mmc.exe'
  condition: (selection or selection_1 or selection_2) and not exclusion
fields:
  - Image
  - CommandLine
  - ParentImage
  - User
  - Hostname
  - ProcessId
  - ParentProcessId
level: medium
tags:
  - attack.discovery
  - attack.t1087.001
falsepositives:
  - Legitimate administrative tasks by IT staff.
  - Scheduled scripts or monitoring tools querying account information.
