title: Shadow Copies Deletion Using Operating Systems Utilities
description: Shadow Copies deletion using operating systems utilities
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.defense-evasion
    - attack.impact
    - attack.t1070
    - attack.t1490
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection1_img:
        - NewProcessName|endswith:
              - \powershell.exe
              - \pwsh.exe
              - \wmic.exe
              - \vssadmin.exe
              - \diskshadow.exe
        - OriginalFileName:
              - PowerShell.EXE
              - pwsh.dll
              - wmic.exe
              - VSSADMIN.EXE
              - diskshadow.exe
    selection1_cli:
        CommandLine|contains|all:
            - shadow    # will match "delete shadows" and "shadowcopy delete" and "shadowstorage"
            - delete
    selection2_img:
        - NewProcessName|endswith: \wbadmin.exe
        - OriginalFileName: WBADMIN.EXE
    selection2_cli:
        CommandLine|contains|all:
            - delete
            - catalog
            - quiet   # will match -quiet or /quiet
    selection3_img:
        - NewProcessName|endswith: \vssadmin.exe
        - OriginalFileName: VSSADMIN.EXE
    selection3_cli:
        CommandLine|contains|all:
            - resize
            - shadowstorage
        CommandLine|contains:
            - unbounded
            - /MaxSize=
    condition: process_creation and ((all of selection1*) or (all of selection2*) or (all of selection3*))
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Legitimate Administrator deletes Shadow Copies using operating systems utilities for legitimate reason
    - LANDesk LDClient Ivanti-PSModule (PS EncodedCommand)
level: high
ruletype: Sigma
