title: CRA-E-0007 Unauthorized Access to Cached Credentials 
description: Detects unauthorized access attempts to cached credentials through registry access or SAM database access at different locations on windows.
references:
  - https://attack.mitre.org/techniques/T1003/005/
  - https://www.praetorian.com/blog/how-to-detect-and-dump-credentials-from-the-windows-registry/
  - https://woshub.com/cached-domain-logon-credentials-windows/ 
status: Developed
author: Shahbaz Ahmad
date: 11/11/2024
logsource:
  product: windows
  service: security
detection:
  selection_1:
    EventID: 4663
    ObjectType: key
    ObjectName|contains: '\SECURITY\Cache'
  selection_2:
    EventID: 4663
    ObjectType: file
    ObjectName|contains: '\System32\config\SAM'
  selection_3:
    EventID: 4663
    ObjectType: key
    ObjectName|contains: '\SAM'
  selection_4:
    EventID: 4663
    ObjectType: file
    ObjectName|contains: '\Repair\SAM' 
  selection_5:
    EventID: 4688 
    ProcessName|endswith: '\reg.exe'
    CommandLine|contains:
      - 'save'
      - 'HKLM\SAM'
  condition: selection_1 or selection_2 or selection_3 or selection_4 or selection_5
fields: 
  - ObjectName
  - EventID
  - ObjectType
  - ProcessName
  - CommandLine
falsepositives:
  - Authorized activity
level: high
tags:
  - attack.credential_access
  - attack.t1003.005
