title: CRA-E-0006 Suspicious LSA Secrets Access Using reg.exe
description: Detects usage of reg.exe to query or export LSA Secrets, potentially indicating credential dumping attempts.
references:
  - https://attack.mitre.org/techniques/T1003/004/
  - https://www.ired.team/offensive-security/credential-access-and-credential-dumping/dumping-lsa-secrets
  - https://www.praetorian.com/blog/how-to-detect-and-dump-credentials-from-the-windows-registry/
status: Developed
author: Shahbaz Ahmad
date: 11/11/2024
logsource:
  product: windows
  category: process_creation 
detection:
  selection_1:
    EventID: 4688
    ProcessName|endswith: '\reg.exe'
    CommandLine|contains:
      - 'save'
      - 'HKLM\SECURITY'
  selection_2:
    EventID: 4688
    ProcessName|endswith: '\reg.exe'
    CommandLine|contains:
      - 'save'
      - 'HKLM\System'
  condition: selection_1 or selction_2
fields:
  - EventID
  - CommandLine
  - ProcessName
falsepositives:
  - Legitimate administrative tasks involving accessing the registry.
level: high
tags:
  - attack.credential_access
  - attack.t1003.004