title: Detect Password Spray Attacks
status: 
description: This rule detects potential password spray attacks based on high numbers of failed login attempts, suspicious use of bad usernames, and abnormal account lockout patterns.
author: Shunaid Shafique
date: 2024-11-06
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4625  # Failed login attempts
    Status: 0xC000006A  # Incorrect password
  groupby:
    - TargetUserName
    - SourceIP
  timeframe: 1h
  condition: count() > 100
  or:
    - selection:
        EventID: 4740  # Account lockout events
      timeframe: 1h
      condition: count() > 5
    - selection:
        EventID: 4625
        TargetUserName: ["guest", "admin", "test*", "user*"]  # Example of common usernames
      timeframe: 1h
      condition: count() > 10
    - selection:
        EventID: 4624  # Successful logins
      condition: count() < 10
      timeframe: 1h
      groupby:
        - SourceIP
  falsepositives:
    - User training sessions
    - Administrative account management
  level: high
tags:
  - attack.persistence
  - attack.credential_access
  - attack.initial_access
  - attack.technique: T1110.003  # Password Spraying
