title: Suspicious SCP Usage
status: Developed
description: Detects potentially malicious usage of SCP for file transfer.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
      - 'scp'
      - '@'
  condition: selection
fields:
  - CommandLine
  - ParentCommandLine
  - User
  - ProcessName
falsepositives:
  - Routine usage of SCP for file transfers by administrators or users.
level: medium
tags:
  - attack.command_and_control
  - attack.t1105
