title: Suspicious Rundll32 Execution With Image Extension
description: Detects the execution of Rundll32.exe with DLL files masquerading as image files
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.defense-evasion
    - attack.t1218.011
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \rundll32.exe
        - OriginalFileName: RUNDLL32.exe
    selection_cli:
        CommandLine|contains:
            - .bmp
            - .cr2
            - .eps
            - .gif
            - .ico
            - .jpeg
            - .jpg
            - .nef
            - .orf
            - .png
            - .raw
            - .sr2
            - .tif
            - .tiff
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
