title: LOL-Binary Copied From System Directory
description: |
    Detects a suspicious copy operation that tries to copy a known LOLBIN from system (System32, SysWOW64, WinSxS) directories to another on disk in order to bypass detections based on locations.
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.defense-evasion
    - attack.t1036.003
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_tools_cmd:
        CommandLine|contains: 'copy '
        NewProcessName|endswith: \cmd.exe
    selection_tools_pwsh:
        CommandLine|contains:
            - copy-item
            - ' copy '
            - 'cpi '
            - ' cp '
        NewProcessName|endswith:
            - \powershell.exe
            - \pwsh.exe
    selection_tools_other:
        - NewProcessName|endswith:
              - \robocopy.exe
              - \xcopy.exe
        - OriginalFileName:
              - robocopy.exe
              - XCOPY.EXE
    selection_target_path:
        CommandLine|contains:
            - \System32
            - \SysWOW64
            - \WinSxS
    selection_target_lolbin:
        CommandLine|contains:
            # Note: add more binaries to increase coverage
            - \bitsadmin.exe
            - \calc.exe
            - \certutil.exe
            - \cmdl32.exe
            - \cscript.exe
            - \mshta.exe
            - \rundll32.exe
            - \wscript.exe
    condition: process_creation and (1 of selection_tools_* and all of selection_target_*)
falsepositives:
    - Unknown
level: high

