title: Script Interpreter Execution From Suspicious Folder
description: Detects a suspicious script execution in temporary folders or folders accessible by environment variables
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.execution
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_proc_image:
        NewProcessName|endswith:
            - \cscript.exe
            - \mshta.exe
            - \wscript.exe
    selection_proc_flags:
        CommandLine|contains:
            - ' -ep bypass '
            - ' -ExecutionPolicy bypass '
            - ' -w hidden '
            - '/e:javascript '
            - '/e:Jscript '
            - '/e:vbscript '
    selection_proc_original:
        OriginalFileName:
            - cscript.exe
            - mshta.exe
            - wscript.exe
    selection_folders_1:
        CommandLine|contains:
            - :\Perflogs\
            - :\Users\Public\
            - \AppData\Local\Temp
            - \AppData\Roaming\Temp
            - \Temporary Internet
            - \Windows\Temp
    selection_folders_2:
        - CommandLine|contains|all:
              - :\Users\
              - \Favorites\
        - CommandLine|contains|all:
              - :\Users\
              - \Favourites\
        - CommandLine|contains|all:
              - :\Users\
              - \Contacts\
    condition: process_creation and (1 of selection_proc_* and 1 of selection_folders_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
