title: CRA-006-E-000-0021-Dump LSASS.exe Memory using comsvcs.dll
id: cra-006-e-000-0021
status: experimental
description: Detects LSASS memory dumping using comsvcs.dll and rundll32 which could indicate credential access activities
references:
    - https://attack.mitre.org/techniques/T1003.001/
author: HexaPrime Detection Team
date: 2025/12/13
tags:
    - attack.T1003.001
    - attack.credential_access
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith: '\rundll32.exe'
        CommandLine|contains|all:
            - 'comsvcs.dll'
            - 'MiniDump'
            - 'lsass'
    condition: selection
falsepositives:
    - System troubleshooting activities
    - Authorized memory analysis
level: high