title: Potential WPAD Spoofing via DNS Record Creation
status: Experimental
date: 2024-12-01
author: Amr Ashraf
logsource:
  category: directory_service
  product: windows
detection:
  selection:
    EventID: 5137
    EventAction:
      - "Directory Service Changes"
      - "directory-service-object-modified"
    ObjectDN: 
      - "DC=wpad,*"
  condition: selection
fields:
  - EventID
  - EventAction
  - ObjectDN
  - SubjectUserSid
  - SubjectUserName
  - Timestamp
falsepositives:
  - Legitimate DNS record changes made by authorized administrators or automated processes.
  - Expected additions of "wpad" records for legitimate configurations.
level: medium
tags:
  - attack.credential_access
  - attack.T1557
description: |
  Identifies the creation of a "wpad" DNS record potentially meant for WPAD spoofing attacks. WPAD spoofing can be used by attackers to exploit systems with default WPAD configurations, enabling privilege escalation or lateral movement.
references:
  - "https://www.thehacker.recipes/ad/movement/mitm-and-coerced-authentications/wpad-spoofing#through-adidns-spoofing"
  - "https://cube0x0.github.io/Pocing-Beyond-DA/"
setup: |
  The 'Audit Directory Service Changes' logging policy must be configured for (Success, Failure).
  Steps to implement the logging policy with Advanced Audit Configuration:
  
