title: Detect Credentials Stored in Files Linux
id: detect-credentials-in-files
status: Experimental
description: Detects access to files or commands searching for stored credentials, which may indicate malicious activity or mismanagement.
author: Amr Ashraf
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    - Image|endswith:
        - '/bin/grep'
        - '/bin/find'
        - '/bin/cat'
      CommandLine|contains:
        - 'password'
        - 'key'
        - 'token'
        - 'secret'
  condition: selection 
fields:
  - Image
  - CommandLine
  - FilePath
  - User
  - Hostname
  - ParentImage
  - ProcessId
level: high
tags:
  - attack.credential_access
  - t1552.001
  - attack.unsecured_credentials
falsepositives:
  - Legitimate administrative tasks or debugging operations.
