title: Detect Volume Shadow Copy Creation via WMI
status: Developed
description: Detects the use of WMI (wmic shadowcopy call create) to create a Volume Shadow Copy, which may be used to access sensitive files like NTDS.dit.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:  
    EventID: 4688
    NewProcessName|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'call'
      - 'create'
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - ParentCommandLine
  - User
falsepositives:
  - Legitimate use by system administrators for backup or troubleshooting
  - Automated scripts for creating backups
level: critical
tags:
  - attack.credential_access
  - attack.t1003.003
  - attack.persistence
  - attack.discovery
