title: Detect NTDS.dit Dumping via NTDSUtil
id: 2364e33d-ceab-4641-8468-bfb1d7cc2723
status: Developed
description: Detects the use of NTDSUtil to dump the Active Directory database (NTDS.dit) using the Install From Media (IFM) backup functionality.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith: '\ntdsutil.exe'
    CommandLine|contains:
      - 'ac '
      - ' i ' 
      - 'ntds'
      - 'ifm'
      - 'create'
      -  'full'
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - ParentCommandLine
  - User
falsepositives:
  - Legitimate administrative tasks for Active Directory backup or recovery
  - Testing or debugging activities in lab environments
level: critical
tags:
  - attack.credential_access
  - attack.t1003.003
  - attack.execution
  - attack.persistence
