title: IFM detected - ESENT
description: Detects scenarios where an attacker attempts to create an IFM image (usually used for deploying domain controllers to reduce replication traffic) for dumping credentials.
status: Experimental
author: Amr Ashraf
date: 2024/11/09
logsource:
  product: windows
  service: application # provider: ESENT
detection:
  selection:
    EventID:
      - 325 # The database engine created a new database
      - 326 # The database engine attached a new database
      - 327 # The database engine detached a database
    EventData|contains:
      - '\ntds.dit'
  condition: selection
falsepositives:
- Administrator creating a IFM image
- Backup program or script
level: high