title: Detect File Timestomping via PowerShell
status: Developed
description: Detects attempts to modify file creation, last modified, or last access timestamps using PowerShell commands.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: script_block_logging
  product: windows
detection:
  selection_creation_time:
    ScriptBlock|contains:
      - '.CreationTime ='
  selection_last_write_time:
    ScriptBlock|contains:
      - '.LastWriteTime ='
  selection_last_access_time:
    ScriptBlock|contains:
      - '.LastAccessTime ='
  condition: selection_creation_time or selection_last_write_time or selection_last_access_time
fields:
  - ScriptBlock
  - User
  - Hostname
falsepositives:
  - Legitimate administrative actions to adjust file timestamps.
level: high
tags:
  - attack.defense_evasion
  - attack.t1070.006
