title: Detect LSASS Dumping via .NET Createdump Utility
status: Developed
description: Detects the use of the .NET `createdump` utility to create an LSASS memory dump, often used for credential theft attacks.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith: '\createdump.exe'
    CommandLine|contains|all:
      - '-u'
      - '-f'
      - 'lsa'
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - ParentCommandLine
  - User
falsepositives:
  - Legitimate administrative or debugging tasks using `createdump`
  - Development or troubleshooting processes involving memory dumps
level: critical
tags:
  - attack.credential_access
  - attack.t1003.001
  - attack.execution
