# testing for FP needed
title: Mimikatz Detection LSASS Access
description: Detects process access to LSASS which is typical for Mimikatz (0x1000 PROCESS_QUERY_ LIMITED_INFORMATION, 0x0400 PROCESS_QUERY_ INFORMATION "only old
    versions", 0x0010 PROCESS_VM_READ)
status: Developed
author: Amr Ashraf
date: 2024/11/09
logsource:
    product: windows
    category: process_access
detection:
    selection:
        TargetImage|endswith: '\lsass.exe'
        GrantedAccess:
            - '0x1410'
            - '0x1010'
            - '0x410'
    filter:
        SourceImage|startswith: 
            - 'C:\Program Files\WindowsApps\'
            - 'C:\Windows\System32\'
        SourceImage|endswith: '\GamingServices.exe'
    condition: selection and not filter
fields:
    - ComputerName
    - User
    - SourceImage
falsepositives:
    - Some security products access LSASS in this way.
level: high
