title: Detect Registry Parsing with pypykatz
status: Developed
description: Detects the execution of `pypykatz` to parse registry hives and obtain stored credentials, specifically targeting the `live lsa` functionality.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|contains:
      - '\python'
    CommandLine|contains|all:
      - 'live'
      - 'lsa'
  condition: selection 
fields:
  - CommandLine
  - Image
  - ParentImage
  - ParentCommandLine
  - User
falsepositives:
  - Legitimate security research or administrative tasks using `pypykatz`
  - Python scripts with similar keywords but unrelated functionality
level: critical
tags:
  - attack.credential_access
  - attack.t1003.002
  - attack.execution
