title: Suspicious Access Using Local Account Without Domain Identifier
description: Detects logons using local accounts that lack a domain identifier, which may indicate attempts to use local privileges or access local administrator accounts without domain authentication.
status: Developed
author: Amr Ashraf
logsource:
  category: logon
  product: windows
detection:
  selection:
    EventID: 4624
    TargetUserSid: 
      - "S-1-5-21-*"
    LogonType:
      - 3
      - 10
  filter_domain_sid:
    TargetUserSid: 
      - "S-1-5-21-{Domain id}-*"   # Filter for Domain ids valid in the environment
      - "S-1-5-21-{Domain id}-*"
  condition: selection and not filter_domain_sid
fields:
  - EventID
  - TargetUserSid
  - TargetUserName
  - LogonType
  - TargetDomainName
  - IpAddress
level: high
tags:
  - attack.lateral_movement
  - attack.privilege_escalation
  - attack.t1078
falsepositives:
  - Legitimate logons by local accounts, such as for maintenance on non-domain-joined systems.
