title: PsExec Service Execution
description: Detects launch of the PSEXESVC service, which means that this system was the target of a psexec remote execution
status: Developed
author: Amr Ashraf
date: 2024/11/11
tags:
    - attack.execution
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - NewProcessName: C:\Windows\PSEXESVC.exe
        - OriginalFileName: psexesvc.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate administrative tasks
level: medium