title: Masquerading as legitemate Adobe executable [medium]
status: test
description: Masquerading as legitemate executable APT1 activity
references:
    - Threat intel feed "https://andreacristaldi.github.io/APTmap/"
tags:
    - attack.defence_evasion
    - attack.t1036.005
author: Amr Ashraf
logsource:
    product: windows
    category: process_execution
detection:
    selection:
        Image|contains:
          - 'AcroRD32.exe'
          - 'AcroRD64.exe'
    filter:
        Image|contains:
          - 'acrobat reader'
    condition: selection
falsepositives:
    - unknown
level: medium

