title: Linux Domain/Local Group & Account Enumeration [Medium]
description: Detects commands used to enumerate domain and local groups on domain-joined Linux endpoints.
status: Developed
author: Yuliya Volkova
date: 2024/11/12
modified: 2024/11/20
logsource:
  category: process_creation
  product: linux
detection:
  selection1:
    image|endswith:
      - "/cat"
      - "/ed"
      - "/head"
      - "/more"
      - "/nano"
      - "/tail"
      - "/vi"
      - "/vim'
      - "/ls"
    commandline|contains: # Default logs; need to check logging in client
      - "/etc/sssd/sssd.conf"
      - "/etc/nsswitch.conf"
      - "/etc/krb5.conf"
      # Sensitive files
      - "/etc/passwd"
      - "/etc/shadow"
      - "/etc/sudoers"
  selection2:
    commandline|contains|any:
      - "ldapdomaindump" 
      - "ldapsearch"
      - "ldapwhoami"
      - "wbinfo -u"
      - "wbinfo -g"
      - "net ads search"
  selection3:
      image|endswith: 
      - "/id"
  selection4:
      image|endswith: # Default logs; need to check logging in client
      - "/lastlog"
  condition: selection1 OR selection2 # Does not require exclusion at this point in time
fields:
  - Image
  - Commandline
  - User
  - Hostname
falsepositives:
  - Legitimate administrative queries by authorized users.
  - Routine configuration checks or system scripts.
level: medium
tags:
  - attack.account_discovery
  - attack.t1087.001
  - attack.t1087.002