title: Suspicious RDP Redirect Using TSCON
description: Detects a suspicious RDP session redirect using tscon.exe
status: Developed
author: Amr Ashraf
date: 2024/11/11
tags:
    - attack.lateral-movement
    - attack.t1563.002
    - attack.t1021.001
    - car.2013-07-002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: ' /dest:rdp-tcp#'
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
