title: Hijack Legit RDP Session to Move Laterally
description: Detects the usage of tsclient share to place a backdoor on the RDP source machine's startup folder
author: Amr
status: Developed
tags:
    - attack.command-and-control
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        Image|endswith: '\mstsc.exe'
        TargetFilename|contains: '\Microsoft\Windows\Start Menu\Programs\Startup\'
    condition: selection
falsepositives:
    - Unlikely
level: high
