title: Possible RDP Hijacking
description: Detects a suspicious RDP session redirect using tscon.exe
status: Developed
author: Amr Ashraf
date: 2024/11/11
logsource:
    product: windows
    service: security
    description: Process Creation with command line option logging needs to be turned on.
detection:
  selection:
    Channel: Security
    EventID: 4688
    CommandLine: '*/dest*rdp-tcp*'
  condition: selection
falsepositives:
  - Unknown
tags:
  - attack.lateral_movement
  - attack.t1563.002
  - attack.t1021.001
