title: Windows System Information discovery using WMI utility [low]
status: test
description: System Information Discovery using Commandline utility
references:
    - Threat intel feed "https://andreacristaldi.github.io/APTmap/"
tags:
    - attack.discovery
    - attack.t1082
author: Amr Ashraf
logsource:
    product: Windows
    category: process_execution
detection:
    selection:
        CommandLine|contains|all: 
          - 'get-wmiObject' 
          - '-class '
    selection2:
        CommandLine|Contains:
          - 'Win32_Processor'
          - 'Win32_PhysicalMemory'
          - 'Win32_DiskDrive'
          - 'Win32_NetworkAdapterConfiguration'
          - 'Win32_OperatingSystem'
          - 'Win32_BIOS'
    condition: selection and selection2
falsepositives:
    - legitemate use
level: low

