title: Windows Information discovery via powershell history [medium]
status: test
description: System Information Discovery using Commandline utility
references:
    - Threat intel feed "https://andreacristaldi.github.io/APTmap/"
tags:
    - attack.discovery
    - attack.t1082
author: Amr Ashraf
logsource:
    product: Windows
    category: process_execution
detection:
    selection:
        CommandLine|contains|all: 
          - 'Get-History'
          - '(Get-PSReadlineOption).HistorySavePath'
    condition: selection
falsepositives:
    - legitemate use
level: medium

