title: Windows System Information discovery using systeminfo [low]
status: test
description: System Information Discovery using Commandline utility
references:
    - Threat intel feed "https://andreacristaldi.github.io/APTmap/"
tags:
    - attack.discovery
    - attack.t1082
author: Amr Ashraf
logsource:
    product: Windows
    category: process_execution
detection:
    selection:
        Image|contains: 
          - '\systeminfo'
    condition: selection
falsepositives:
    - legitemate use
level: low

