title: Windows Information discovery via registry [medium]
status: test
description: System Information Discovery using Commandline utility
references:
    - Threat intel feed "https://andreacristaldi.github.io/APTmap/"
tags:
    - attack.discovery
    - attack.t1082
author: Amr Ashraf
logsource:
    product: Windows
    category: process_execution
detection:
    selection:
        CommandLine|contains|all: 
          - 'reg '
          - 'query' 
          - 'HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion'
    selection2:
        CommandLine|contains:
          - 'ProductName'
          - 'CurrentBuildNumber'
    condition: selection and selection2
falsepositives:
    - legitemate use
level: medium

