title: Detect Clearing Bash History
status: Developed
description: Detects attempts to clear or manipulate Bash history using various methods such as `rm`, `echo`, or `truncate`.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: linux
detection:
  selection_rm:
    CommandLine|contains: 'rm'
    CommandLine|contains: '.bash_history'
  selection_echo:
    CommandLine|contains: 'echo ""'
    CommandLine|contains: '.bash_history'
  selection_truncate:
    CommandLine|contains: 'truncate'
    CommandLine|contains: '.bash_history'
  selection_cat_dev_null:
    CommandLine|contains: 'cat /dev/null'
    CommandLine|contains: '.bash_history'
  condition: selection_rm or selection_echo or selection_truncate or selection_cat_dev_null
fields:
  - CommandLine
  - User
  - ProcessID
  - ParentProcessID
falsepositives:
  - Legitimate administrative tasks to clear or reset user history.
level: high
tags:
  - attack.defense_evasion
  - attack.t1070.004
