title: DFE-006-E-000-0006-Microsoft.Workflow.Compiler.exe Payload Execution
id: dfe-006-e-000-0006
status: experimental
description: Detects execution of Microsoft.Workflow.Compiler.exe used to execute arbitrary payloads for defense evasion
references:
    - https://attack.mitre.org/techniques/T1218/
    - https://lolbas-project.github.io/lolbas/Binaries/Microsoft.Workflow.Compiler/
author: HexaPrime Detection Team
date: 2025/12/13
tags:
    - attack.T1218
    - attack.defense_evasion
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith: '\Microsoft.Workflow.Compiler.exe'
    condition: selection
falsepositives:
    - Legitimate workflow compilation
    - .NET development activities
level: high