title: DFE-006-E-000-0007-Renamed Microsoft.Workflow.Compiler.exe Payload Executions
id: dfe-006-e-000-0007
status: experimental
description: Detects renamed Microsoft.Workflow.Compiler.exe used to execute arbitrary payloads for defense evasion
references:
    - https://attack.mitre.org/techniques/T1218/
    - https://attack.mitre.org/techniques/T1036.003/
author: HexaPrime Detection Team
date: 2025/12/13
tags:
    - attack.T1218
    - attack.T1036.003
    - attack.defense_evasion
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        OriginalFileName: 'Microsoft.Workflow.Compiler.exe'
    filter:
        Image|endswith: '\Microsoft.Workflow.Compiler.exe'
    condition: selection and not filter
falsepositives:
    - Legitimate renamed workflow compiler
    - Custom deployment scripts
level: high