title: DFE-006-E-000-0032-IEExec XmlTextReader Execution
id: dfe-006-e-000-0032
status: experimental
description: Detects ieexec.exe execution which can be used for defense evasion and bypassing application whitelisting
references:
    - https://attack.mitre.org/techniques/T1218/
    - https://lolbas-project.github.io/lolbas/Binaries/Ieexec/
author: HexaPrime Detection Team
date: 2025/12/13
tags:
    - attack.T1218
    - attack.defense_evasion
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith: '\ieexec.exe'
    condition: selection
falsepositives:
    - Legitimate Internet Explorer operations
    - ClickOnce application deployment
level: medium