title: File Download Via Bitsadmin To A Suspicious Target Folder
description: Detects usage of bitsadmin downloading a file to a suspicious target folder
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1197
    - attack.s0190
    - attack.t1036.003
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \bitsadmin.exe
    selection_flags:
        CommandLine|contains:
            - ' /transfer '
            - ' /create '
            - ' /addfile '
    selection_folder:
        CommandLine|contains:
            - '\Perflogs'
            - '\ProgramData\'
            - '\Temp\'
            - '\Users\Public\'
            - '\Windows\'
            - '\AppData\Local\Temp\'
            - '\AppData\Roaming\'
            - '\Desktop\'
            - '%ProgramData%'
            - '%public%'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
VQL:
    LET ID_1065 = (
        NewProcessName =~ "\\bitsadmin\\.exe$" AND
        CommandLine =~ "(?=.* /transfer |.* /create |.* /addfile )" AND
        CommandLine =~ "(?=.*\\\\Perflogs|.*\\\\ProgramData\\\\|.*\\\\Temp\\\\|.*\\\\Users\\\\Public\\\\|.*\\\\Windows\\\\|.*\\\\AppData\\\\Local\\\\Temp\\\\|.*\\\\AppData\\\\Roaming\\\\|.*\\\\Desktop\\\\|.*%ProgramData%|.*%public%)"
    )

