title: Regsvr32 Anomaly
description: Detects various anomalies in relation to regsvr32.exe
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.defense-evasion
    - attack.t1218.010
    - car.2019-04-002
    - car.2019-04-003
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection1:
        CommandLine|contains: \Temp\
        NewProcessName|endswith: \regsvr32.exe
    selection2:
        NewProcessName|endswith: \regsvr32.exe
        ParentProcessName|endswith:
            - \powershell.exe
            - \pwsh.exe
            - \powershell_ise.exe
            - \cmd.exe
    selection4a:
        CommandLine|contains|all:
            - '/i:'
            - http
        CommandLine|contains: scrobj.dll
        NewProcessName|endswith: \regsvr32.exe
    selection4b:
        CommandLine|contains|all:
            - '/i:'
            - ftp
        CommandLine|endswith: scrobj.dll
        NewProcessName|endswith: \regsvr32.exe
    selection5:
        NewProcessName|endswith:
            - \cscript.exe
            - \wscript.exe
        ParentProcessName|endswith: \regsvr32.exe
    selection6:
        CommandLine|contains: '..\..\..\Windows\System32\regsvr32.exe '
        NewProcessName|endswith: \EXCEL.EXE
    selection7:
        ParentProcessName|endswith: \mshta.exe
        NewProcessName|endswith: \regsvr32.exe
    selection8:
        CommandLine|contains:
            - \AppData\Local
            - C:\Users\Public
        NewProcessName|endswith: \regsvr32.exe
    selection9: # suspicious extensions https://twitter.com/Max_Mal_/status/1542461200797163522/photo/3
        CommandLine|endswith:
            - .jpg
            - .jpeg
            - .png
            - .gif
            - .bin
            - .tmp
            - .temp
            - .txt
        NewProcessName|endswith: \regsvr32.exe
    filter1:
        CommandLine|contains:
            - \AppData\Local\Microsoft\Teams
            - \AppData\Local\WebEx\WebEx64\Meetings\atucfobj.dll
    filter2:
        CommandLine|contains: \Program Files\Box\Box\Temp\
        ParentProcessName: C:\Program Files\Box\Box\FS\streem.exe
    filter_legitimate:
        CommandLine|endswith: /s C:\Windows\System32\RpcProxy\RpcProxy.dll
    condition: process_creation and (1 of selection* and not 1 of filter*)
    VQL: |
        LET ID_1070 = (
            (NewProcessName =~ "\\regsvr32\\.exe$" AND CommandLine =~ "\\Temp\\") OR
            (NewProcessName =~ "\\regsvr32\\.exe$" AND ParentProcessName =~ "(?=.*\\powershell\\.exe$|.*\\pwsh\\.exe$|.*\\powershell_ise\\.exe$|.*\\cmd\\.exe$)") OR
            (NewProcessName =~ "\\regsvr32\\.exe$" AND CommandLine =~ "(?=.* /i:.*http.*scrobj\\.dll)") OR
            (NewProcessName =~ "\\regsvr32\\.exe$" AND CommandLine =~ "(?=.* /i:.*ftp.*scrobj\\.dll)") OR
            (NewProcessName =~ "(?=.*\\cscript\\.exe$|.*\\wscript\\.exe$)" AND ParentProcessName =~ "\\regsvr32\\.exe$") OR
            (NewProcessName =~ "\\EXCEL\\.EXE$" AND CommandLine =~ "..\\..\\..\\Windows\\System32\\regsvr32\\.exe ") OR
            (NewProcessName =~ "\\regsvr32\\.exe$" AND ParentProcessName =~ "\\mshta\\.exe$") OR
            (NewProcessName =~ "\\regsvr32\\.exe$" AND CommandLine =~ "(?=.*\\AppData\\Local|.*C:\\Users\\Public)") OR
            (NewProcessName =~ "\\regsvr32\\.exe$" AND CommandLine =~ "(?=.*\\.jpg$|.*\\.jpeg$|.*\\.png$|.*\\.gif$|.*\\.bin$|.*\\.tmp$|.*\\.temp$|.*\\.txt$)") AND
            NOT (CommandLine =~ "(?=.*\\AppData\\Local\\Microsoft\\Teams|.*\\AppData\\Local\\WebEx\\WebEx64\\Meetings\\atucfobj\\.dll)" OR
                 CommandLine =~ "\\Program Files\\Box\\Box\\Temp\\" AND ParentProcessName == "C:\\Program Files\\Box\\Box\\FS\\streem.exe" OR
                 CommandLine =~ "/s C:\\Windows\\System32\\RpcProxy\\RpcProxy\\.dll$")
        )
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
level: high

