title: Suspicious Rundll32 Execution With Image Extension
description: Detects the execution of Rundll32.exe with DLL files masquerading as image files
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.defense-evasion
    - attack.t1218.011
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \rundll32.exe
    selection_cli:
        CommandLine|contains:
            - .bmp
            - .cr2
            - .eps
            - .gif
            - .ico
            - .jpeg
            - .jpg
            - .nef
            - .orf
            - .png
            - .raw
            - .sr2
            - .tif
            - .tiff
    condition: process_creation and (all of selection_*)
    VQL: |
        LET ID_1075 = (
            NewProcessName =~ "\\rundll32\\.exe$" AND
            CommandLine =~ "(?=.*\\.bmp|.*\\.cr2|.*\\.eps|.*\\.gif|.*\\.ico|.*\\.jpeg|.*\\.jpg|.*\\.nef|.*\\.orf|.*\\.png|.*\\.raw|.*\\.sr2|.*\\.tif|.*\\.tiff)"
        )
falsepositives:
    - Unknown
level: high

