# needs FP testing
title: Imports Registry Key From a File
description: Detects the import of the specified file to the registry with regedit.exe.
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.t1112
    - attack.defense-evasion
logsource:
    category: process_creation
    product: windows
detection:
    selection_process_creation:
        EventID: 4688
        NewProcessName|endswith: \regedit.exe
        CommandLine|contains:
            - '.reg'
    filter_1:
        CommandLine|contains|windash:
            - ' -e '
            - ' -a '
            - ' -c '
    condition: selection_process_creation and not filter_1
fields:
    - ParentProcessName
    - CommandLine
falsepositives:
    - Legitimate import of keys
    - Evernote
level: medium