title: Whoami Execution From Privileged Process
description: Detects the execution of "whoami.exe" by privileged accounts that are often abused by threat actors
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.privilege-escalation
    - attack.discovery
    - attack.t1033
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \whoami.exe
    VQL:
        LET ID_1077 = (
            (NewProcessName =~ "\\whoami\\.exe$")
        )
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high

