title: Suspicious Cmd Execution via WMI
description: Detects suspicious command execution (cmd) via Windows Management Instrumentation (WMI) on a remote host. This could be indicative of adversary lateral movement.
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.execution
    - attack.t1047
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        NewProcessName|endswith: \cmd.exe
        ParentProcessName|endswith: \WmiPrvSE.exe
    condition: process_creation and selection
    VQL:
        LET ID_1076 = (
            (NewProcessName =~ "\\cmd\\.exe$" AND ParentProcessName =~ "\\WmiPrvSE\\.exe$")
        )
falsepositives:
    - Unknown
level: medium
