title: PowerShell Download and Execution Cradles
description: Detects PowerShell download and execution cradles.
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.execution
    - attack.t1059
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_download:
        CommandLine|contains:
            - '.DownloadString('
            - .'DownloadFile('
            - 'Invoke-WebRequest '
            - ' iwr'
    selection_iex:
        CommandLine|contains:
            - ';iex $'
            - '| IEX'
            - '|IEX '
            - 'I`E`X'
            - 'I`EX'
            - 'IE`X'
            - 'iex '
            - 'IEX ('
            - 'IEX('
            - 'Invoke-Expression'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Some PowerShell installers were seen using similar combinations. Apply filters accordingly
level: high
VQL:
    LET ID_1069 = (
        CommandLine =~ "(?=.*\\.DownloadString\\(|.*\\.DownloadFile\\(|.*Invoke-WebRequest |.* iwr)" AND
        CommandLine =~ "(?=.*;iex \\$|.*\\| IEX|.*\\|IEX |.*I`E`X|.*I`EX|.*IE`X|.*iex |.*IEX \\(|.*IEX\\(|.*Invoke-Expression)"
    )

