title: Suspicious Desktopimgdownldr Command
description: Detects a suspicious Microsoft desktopimgdownldr execution with parameters used to download files from the Internet
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.command-and-control
    - attack.t1105
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        EventID: 4688
        CommandLine|contains: ' /lockscreenurl:'
    selection1_filter:
        CommandLine|contains:
            - '.jpg'
            - '.jpeg'
            - '.png'
    selection_reg:
        EventID: 4688
        CommandLine|contains|all:
            - 'reg'
            - 'delete'
            - '\PersonalizationCSP'
    condition: ( selection1 and not selection1_filter ) or selection_reg
    VQL: |
        LET ID_1073 = (
            (CommandLine =~ " /lockscreenurl:" AND NOT CommandLine =~ "(?=.*\\.jpg|.*\\.jpeg|.*\\.png)") OR
            (CommandLine =~ "(?=.*reg|.*delete|.*\\PersonalizationCSP)")
        )
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - False positives depend on scripts and administrative tools used in the monitored environment
level: high
