title: Detect Zipping of Files for Staging via Script Block Logging
status: Developed
description: Detects the use of PowerShell script block logging to identify attempts to zip files or folders, which may indicate data staging for exfiltration.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: script_block_logging
  product: windows
detection:
  selection:
    ScriptBlock|contains:
      - 'Compress-Archive'
  condition: selection
fields:
  - ScriptBlock
  - User
  - HostName
  - ProcessId
falsepositives:
  - Legitimate administrative or backup operations involving the compression of files using PowerShell.
level: medium
tags:
  - attack.collection
  - attack.t1074.001
