# filters may be needed based on the environment
title: Outbound RDP Connections Over Non-Standard Tools
description: |
    Detects Non-Standard tools initiating a connection over port 3389 indicating possible lateral movement.
    An initial baseline is required before using this utility to exclude third party RDP tooling that you might use.
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.lateral-movement
    - attack.t1021.001
    - car.2013-07-002
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 5156
        Channel: Security
    selection:
        DestPort: 3389
        Direction: '%%14593'
    filter_main_mstsc:
        Application|contains:
            - \Windows\System32\mstsc.exe
            - \Windows\SysWOW64\mstsc.exe
    condition: network_connection and (selection and not 1 of filter_main_*)
falsepositives:
    - Third party RDP tools
level: high

