title: Persistence via Screensaver
status: Developed
description: Detects persistence via screensaver by monitoring modifications to the screensaver registry path, which attackers may exploit to execute malicious payloads. Excludes legitimate screensaver changes made via the Control Panel.
author: Amr Ashraf
logsource:
  category: registry
  product: windows
detection:
  selection:
    EventID: 4657
    ObjectName|contains: '\Control Panel\Desktop\SCRNSAVE.EXE'
  exclusion:
    - ProcessName|contains: 'rundll32.exe'
    - CommandLine|contains: 'shell32.dll,Control_RunDLL desk.cpl,ScreenSaver'
  condition: selection and not exclusion
fields:
  - RegistryPath
  - RegistryKey
  - RegistryValue
  - ProcessPath
  - ParentProcessPath
  - CommandLine
  - User
  - Hostname
level: medium
tags:
  - attack.persistence
  - t1180
falsepositives:
  - Legitimate administrative or user changes to screensaver settings
  - Authorized software updates affecting the screensaver configuration