title: Bruteforce via password reset
description: Detects if a attacker attempts to reset multiple times a user password to perform a bruteforce attack. 
status: Experimental
author: Amr Ashraf
date: 2024/11/09
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
      - 4723 # reset of own user's password
      - 4724 # reset of user's password by another user
  condition: selection | count() by TargetSid, host > 10
falsepositives:
- ADFS, DirSync 
level: high