title: Detect Service Start Type Modification
description: Detects changes to the start type of services.
status: Developed
author: Amr Ashraf
logsource:
  product: windows
  service: system
detection:
  selection:
    EventID: 7040
  condition: selection
fields:
 - EventID
 - ServiceName
 - StartType
 - PreviousStartType
falsepositives:
 - Legitimate changes to service start types
level: high
tags:
 - attack.persistence
 - attack.t1543.003