title: Detect Obfuscated Commands with Base64
status: Experimental
description: Detects base64-encoded commands that are decoded and executed via bash.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    CommandLine|contains|all:
      - 'base64'
      - '| bash'
  condition: selection
fields:
  - CommandLine
  - User
  - ParentImage
  - Image
  - Hostname
falsepositives:
  - Base64 operations in legitimate scripting or data manipulation tasks.
level: high
tags:
  - attack.execution
  - attack.persistence
  - attack.t1059.004
