title: Detect Unexpected Shell Spawn
status: Experimental
description: Detects the spawning of shells using utilities like awk, busybox, cpan, or emacs, which is indicative of restricted environment breakouts.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: linux
detection:
  awk_shell_spawn:
    CommandLine|contains|all:
      - 'awk'
      - 'BEGIN {system("/bin/sh &")}'
  busybox_shell_spawn:
    CommandLine|contains: 'busybox sh &'
  cpan_shell_spawn:
    CommandLine|contains|all:
      - 'echo'
      - 'exec "/bin/sh &"'
      - 'cpan'
  emacs_shell_spawn:
    CommandLine|contains|all:
      - 'emacs'
      - '--eval'
      - '(term "/bin/sh &")'
  condition: awk_shell_spawn or busybox_shell_spawn or cpan_shell_spawn or emacs_shell_spawn
fields:
  - CommandLine
  - User
  - ParentImage
  - Image
  - Hostname
falsepositives:
  - Advanced system administrators using these tools for legitimate purposes.
level: critical
tags:
  - attack.execution
  - attack.persistence
  - attack.t1059.004
