title: Detect Disabling Windows Defender
id: detect-disabling-windows-defender-logs
status: Developed
description: Detects attempts to disable Windows Defender using event logs that indicate changes to Defender configuration or service status.
author: Amr Ashraf
date: 2024-11-24
logsource:
  category: windows
  product: windows
detection:
  selection:
    # this selection needs research the log source, but the other will detect the same
    EventID: 5004
    ProviderName: 'Microsoft-Windows-Windows Defender'
    Message:
      - 'Real-time protection feature has been disabled'
      - 'Antivirus settings have been disabled'
      - 'Defender Antivirus service stopped'

  selection2:
    EventID: 5001
  condition: selection
fields:
  - EventID
  - ProviderName
  - Message
  - User
  - Hostname
level: high
tags:
  - attack.defense_evasion
  - attack.t1562.001
falsepositives:
  - Legitimate administrative tasks or updates
