# new values for this event ID should be checked on testing
title: Disable Windows Prefetch
description: Detects registry changes to disable prefetch, potentially hiding execution artifacts.
author: Amr Ashraf
date: 2024-12-06
status: Experimental
logsource:
  category: windows
  product: windows
  service: security
detection:
  selection:
    EventID: 4657
    ObjectName|contains: 'SYSTEM\CurrentControlSet\Control\Session Manager\Memory Management\PrefetchParameters'
    ObjectValueName|contains: 'EnablePrefetcher'
    NewValue: '0'
  condition: selection
falsepositives:
  - System optimization by administrators
tags:
  - attack.defense_evasion
  - attack.T1112
severity: high
fields:
  - ObjectName
  - ObjectValueName
  - NewValue
