title: Firewall Disabled via Netsh
description: Detects netsh commands that turns off the Windows firewall
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.defense-evasion
    - attack.t1562.004
    - attack.s0108
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \netsh.exe
    selection_cli_1:
        # Example: netsh firewall set opmode disable
        CommandLine|contains|all:
            - 'firewall'
            - 'set'
            - 'opmode'
            - 'disable'
    selection_cli_2:
        # Example: netsh advfirewall set currentprofile state off
        CommandLine|contains|all:
            - "advfirewall"
            - "set"
            - "state"
            - "off"
    condition: process_creation and (selection_img and 1 of selection_cli_*)
falsepositives:
    - Legitimate administration activity
level: medium
VQL: |
    LET ID_1183 = (
        (NewProcessName =~ "\\netsh\\.exe$") AND
        (
            CommandLine =~ "(?=.*firewall)(?=.*set)(?=.*opmode)(?=.*disable)" OR
            CommandLine =~ "(?=.*advfirewall)(?=.*set)(?=.*state)(?=.*off)"
        )
    )