# new values for this event ID should be checked on testing
title: Detect Credential Guard Disabling
id: detect-credential-guard-disabling
status: Experimental
description: Detects attempts to disable Credential Guard through registry or Group Policy.
author: Amr Ashraf
logsource:
  category: registry
  product: windows
detection:
  selection:
    EventID: 4657
    ObjectName|contains: 'SYSTEM\CurrentControlSet\Control\Lsa\LsaCfgFlags'
    NewValue: '0'
  condition: selection
fields:
  - EventID
  - RegistryKey
  - NewValue
  - User
level: high
tags:
  - attack.defense_evasion
  - attack.t1574.002
falsepositives:
  - Legitimate administrative actions
