title: Detect AppLocker Policy Bypass
id: detect-applocker-policy-bypass
status: Experimental
description: Detects attempts to bypass AppLocker using executables or scripts.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|contains: '\regsvr32.exe'
    CommandLine|contains: 'scrobj.dll'
  condition: selection
fields:
  - Image
  - CommandLine
  - User
level: high
tags:
  - attack.execution
  - attack.t1218.010
falsepositives:
  - Authorized use of Regsvr32 for legitimate tasks
VQL: |
  LET ID_1162 = (
      NewProcessName =~ "(?=.*\\regsvr32\\.exe)" AND
      CommandLine =~ "(?=.*scrobj\\.dll)"
  )
