# new values for this event ID should be checked on testing
title: Detect Disabling Data Execution Prevention (DEP)
id: detect-dep-disabling
status: Experimental
description: Detects attempts to disable DEP by modifying memory management registry keys.
author: Amr Ashraf
logsource:
  category: registry
  product: windows
detection:
  selection:
    EventID: 4657
    ObjectName|contains: 'SYSTEM\CurrentControlSet\Control\Session Manager\Memory Management'
    ObjectValueName|contains: 'DisableDEP'
    NewValue: '1'
  condition: selection
fields:
  - EventID
  - RegistryKey
  - RegistryValueName
  - NewValue
level: high
tags:
  - attack.defense_evasion
  - attack.t1562
falsepositives:
  - Rare but possible legitimate configuration changes
