# needs testing as it may generate FP
title: Detect Disabling Windows Defender Firewall
id: detect-disabling-windows-defender-firewall-logs
status: Experimental
description: Detects attempts to disable Windows Defender Firewall using event logs that indicate changes to firewall settings.
author: Amr Ashraf
date: 2024-11-24
modified: 2024-11-30
logsource:
  category: windows
  product: windows
detection:
  selection:
    - EventID: 
      - 4950
      - 4956
    - ProviderName: 'Microsoft-Windows-Security-Auditing'
    - Message|contains: 
        - 'A Windows Firewall setting has changed'
        - 'Windows Firewall has changed the active profile'
  condition: selection
fields:
  - EventID
  - ProviderName
  - Message
  - User
  - Hostname
level: high
tags:
  - attack.defense_evasion
  - attack.t1562.004
falsepositives:
  - Legitimate administrative changes or system updates
