title: WMIC Execution of BITSAdmin for File Transfer
status: test
author: Amr Ashraf
description: Detects the use of WMIC executing BITSAdmin, a technique observed in Wizard Spider's ransomware campaigns.
references:
  - https://attack.mitre.org/techniques/T1105/
  - https://attack.mitre.org/groups/G0102/
tags:
  - attack.execution
  - attack.t1105
  - attack.t1197
logsource:
    category: process_creation (EID 1)
    service: sysmon
    product: windows
detection:
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains: 'process call create'
  selection_bitsadmin:
    CommandLine|contains: 'bitsadmin'
  selection_transfer:
    CommandLine|contains:
      - 'transfer'
      - 'addfile'
  condition: selection_wmic and selection_bitsadmin and selection_transfer
falsepositives:
  - Legitimate software updates using BITSAdmin via WMIC (rare).
level: high

