title: NTDS.dit Credential Dumping via NTDSUtil and Volume Shadow Copy
status: test
author: Amr Ashraf
description: Detects attempts to dump Active Directory credentials by extracting the NTDS.dit file using NTDSUtil, VSSAdmin, or direct file copying.
references:
  - https://attack.mitre.org/techniques/T1003/003/
  - https://attack.mitre.org/groups/G0102/
tags:
  - attack.credential_access
  - attack.t1003.003
logsource:
    category: process_creation
    service: sysmon
    product: windows
detection:
  selection_ntdsutil:
    Image|endswith: '\ntdsutil.exe'
    CommandLine|contains:
      - ' snapshot '
      - ' activate instance ntds '
      - ' create '
  selection_vssadmin:
    # FP test required
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains:
      - ' create shadow '
      - ' list shadows '
  selection_copy:
    Image|endswith: '\cmd.exe'
    CommandLine|contains:
      - 'copy C:\Windows\NTDS\ntds.dit '
      - 'xcopy C:\Windows\NTDS\ntds.dit '
      - 'robocopy C:\Windows\NTDS\ntds.dit '
  condition: selection_ntdsutil or selection_vssadmin or selection_copy
falsepositives:
  - Legitimate Active Directory maintenance by administrators.
level: critical

