title: Credential Acquisition via Registry Hive Dumping
status: test
author: Amr Ashraf
references:
  - https://github.com/Yamato-Security/hayabusa-rules/tree/main/hayabusa/sigma/builtin/deprecated/proc_creation_win_credential_acquisition_registry_hive_dumping.yml
logsource:
    category: process_creation
    service: sysmon
    product: windows
detection:
  selection_1:
    - Image|endswith: \reg.exe
  selection_2:
    CommandLine|contains:
      - ' save '
      - ' export '
  selection_3:
    CommandLine|contains:
      - hklm\sam
      - hklm\security
      - HKEY_LOCAL_MACHINE\SAM
      - HKEY_LOCAL_MACHINE\SECURITY
  condition: all of selection_*
level: high
