title: WDigest Registry Key Modification for Credential Caching
status: test
author: Amr Ashraf
description: Detects modifications to the WDigest registry key, which allows plaintext credentials to be stored in memory, a technique used by Wizard Spider.
references:
  - https://attack.mitre.org/techniques/T1112/
  - https://attack.mitre.org/groups/G0102/
  - https://docs.microsoft.com/en-us/windows-server/security/credentials-protection-and-management
tags:
  - attack.persistence
  - attack.t1112
logsource:
  category: registry_event (EID 13)
  service: sysmon
  product: windows
# Sysmon Event ID 13 is required "Reported"
detection:
  selection:
    TargetObject|contains: '\System\CurrentControlSet\Control\SecurityProviders\WDigest\UseLogonCredential'
    Details|contains: 'DWORD (0x00000001)'
  condition: selection
falsepositives:
  - Some security tools or administrative configurations may modify this registry key.
level: high
