title: Domain Admin Enumeration and AD Computer Account Collection
status: test
description: Detects the use of `net group "Domain Admins" /DOMAIN` and `Get-ADComputer` PowerShell cmdlet, which are techniques used by Wizard Spider for account enumeration and Active Directory data collection.
tags:
    - attack.discovery
    - attack.t1087.002
    - attack.t1069.002
author: Amr Ashraf
logsource:
    category: process_creation
    service: sysmon
    product: windows
detection:
    selection1:
        - CommandLine|contains|all: 
            - ' net '
            - ' group '
            - 'Domain Admins'
            - ' /DOMAIN'
    selection2:
        - CommandLine|contains: 'Get-ADComputer'
    condition: (all of selection1) or selection2
falsepositives:
    - Legitimate administrative activity
    - Scripts or tools used by system administrators for routine checks
level: medium