title: Security Software Discovery via WMI
status: test
author: Amr Ashraf
description: Detects the use of WMI queries to enumerate installed security software, a technique used by Wizard Spider for security evasion.
references:
  - https://attack.mitre.org/techniques/T1518/001/
  - https://attack.mitre.org/groups/G0102/
tags:
  - attack.discovery
  - attack.t1518.001
logsource:
    category: process_creation
    service: sysmon
    product: windows
detection:
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains:
      - ' product get name '
      - ' /namespace:\\root\SecurityCenter2 path AntiVirusProduct '
  selection_powershell:
    Image|endswith: '\powershell.exe'
    CommandLine|contains:
      - 'Get-WmiObject -Namespace root\SecurityCenter2 -Class AntiVirusProduct'
      - 'gwmi -Namespace root\SecurityCenter2 -Class AntiVirusProduct'
  condition: selection_wmic or selection_powershell
falsepositives:
  - Security audits or legitimate administrative queries.
level: high

