title: Group Policy Preferences (GPP) Credential Theft via PowerShell
status: test
author: Amr Ashraf
description: Detects the use of PowerShell cmdlets Get-GPPPassword and Find-GPOPassword to extract plaintext credentials from Group Policy Preferences (GPP), a technique used by Wizard Spider.
references:
  - https://attack.mitre.org/techniques/T1552/006/
  - https://attack.mitre.org/groups/G0102/
tags:
  - attack.credential_access
  - attack.t1552.006
logsource:
    category: process_creation
    service: sysmon
    product: windows
detection:
  selection_powershell:
    Image|endswith: '\powershell.exe'
    CommandLine|contains:
      - 'Get-GPPPassword'
      - 'Find-GPOPassword'
      - 'Invoke-GPPPassword'
  selection_file_access:
    Image|endswith: '\powershell.exe'
    CommandLine|contains:
      - 'SYSVOL'
      - 'Groups.xml'
  condition: selection_powershell or selection_file_access
fields:
  - Image
  - CommandLine
  - ParentImage
  - ParentCommandLine
  - User
falsepositives:
  - Penetration testing activities.
  - Legitimate security assessments.
level: high

