title: Batch Script Executing WMIC with BITSAdmin
status: test
author: Amr Ashraf
description: Detects batch script execution where WMIC is used to call BITSAdmin for downloading payloads, a technique used by Wizard Spider.
references:
  - https://attack.mitre.org/techniques/T1105/
  - https://attack.mitre.org/groups/G0102/
tags:
  - attack.execution
  - attack.t1105
logsource:
    category: process_creation
    service: sysmon
    product: windows
detection:
  selection_batch:
    ParentImage|endswith:
      - '\cmd.exe'
      - '\powershell.exe'
    CommandLine|contains: '.bat'
  selection_wmic:
    CommandLine|contains: 'wmic '
  selection_bitsadmin:
    CommandLine|contains: 'bitsadmin'
  condition: selection_batch and selection_wmic and selection_bitsadmin
falsepositives:
  - Some administrative scripts using BITSAdmin and WMIC.
level: high

