title: Local Administrator Account Creation
status: test
author: Amr Ashraf
description: Detects local administrator account creation via command-line utilities, a common persistence technique used by Wizard Spider.
references:
  - https://attack.mitre.org/techniques/T1136/001/
  - https://attack.mitre.org/groups/G0102/
tags:
  - attack.persistence
  - attack.t1136.001
logsource:
    category: process_creation
    service: sysmon
    product: windows
detection:
  selection_net_user:
    Image|endswith: '\net.exe'
    CommandLine|contains: ' user '
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains: ' path Win32_UserAccount '
  selection_powershell:
    Image|endswith: '\powershell.exe'
    CommandLine|contains: 'New-LocalUser'
  selection_admin:
    CommandLine|contains:
      - ' /add '
      - ' /domain '   
      - ' /active:yes '
      - ' administrators'
  condition: (selection_net_user or selection_wmic or selection_powershell) and selection_admin
falsepositives:
  - Legitimate user creation by administrators.
level: high
