# Will be better to use Event ID 11 but we don't have it for now "Reported"
title: Suspicious Startup Folder Persistence
status: test
description: Detects when a file with a suspicious extension is running from startup folder
references:
    - https://github.com/last-byte/PersistenceSniper
tags:
    - attack.persistence
    - attack.t1547.001
author: Amr Ashraf
logsource:
    product: windows
    category: Process_Creation (EID 1)
    service: sysmon
detection:
    selection:
        CommmandLinee|contains: '\Windows\Start Menu\Programs\Startup\'
        CommmandLinee|endswith:
            - '.vbs'
            - '.vbe'
            - '.bat'
            - '.ps1'
            - '.hta'
            - '.dll'
            - '.jar'
            - '.msi'
            - '.scr'
            - '.cmd'
    condition: selection
falsepositives:
    - Rare legitimate usage of some of the extensions mentioned in the rule
level: high

