title: Potential Startup Shortcut Persistence
status: test
description: |
    Detects PowerShell writing startup shortcuts.
references:
    - https://redcanary.com/blog/intelligence-insights-october-2021/
    - https://github.com/redcanaryco/atomic-red-team/blob/36d49de4c8b00bf36054294b4a1fcbab3917d7c5/atomics/T1547.001/T1547.001.md#atomic-test-7---add-executable-shortcut-link-to-user-startup-folder
tags:
    - attack.persistence
    - attack.t1547.001
author: Amr Ashraf
logsource:
    product: windows
    category: Process_Creation (EID 1)
    service: sysmon
detection:
    selection:
        CommandLine|contains: '\start menu\programs\startup\'
        CommandLine|endswith: '.lnk'
    condition: selection
falsepositives:
    - Depending on your environment accepted applications may leverage this at times. It is recommended to search for anomalies inidicative of malware.
level: high

