title: Detect Domain Account Manipulation Using PowerShell
status: Developed
description: Detects PowerShell script blocks used to create domain accounts and add them to high-privilege groups.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: script_block_logging
  product: windows
detection:
  selection_account_creation:
    ScriptBlock|contains:
      - 'New-ADUser'
      - '-Enabled:$False'
  selection_group_addition:
    ScriptBlock|contains:
      - 'Add-ADGroupMember'
      - 'Domain Admins'
  condition: selection_account_creation or selection_group_addition
fields:
  - ScriptBlock
  - User
  - HostApplication
  - ParentCommandLine
falsepositives:
  - Legitimate administrative tasks using Active Directory PowerShell module.
level: critical
tags:
  - attack.privilege_escalation
  - attack.t1098
