title: User Account Creation
status: Developed
description: Detects the creation of local users via the `net.exe` or `net1.exe` command, a tactic often used for persistence or credential access.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - ProcessName:
        - "net.exe"
        - "net1.exe"
      ParentProcessName|ne: "net.exe"
      CommandLine|contains:
        - "user"
        - "/ad"
  condition: selection
fields:
  - ProcessName
  - CommandLine
  - ParentProcessName
  - ProcessPath
  - User
  - Hostname
level: medium
tags:
  - attack.persistence
  - attack.credential_access
  - t1136
falsepositives:
  - Legitimate administrative creation of user accounts
  - Authorized IT or system scripts creating accounts
