# Needs FP testing
title: Detect Mass File Copying Activity
status: Developed
description: Detects tools or scripts used for automated file copying, such as RoboCopy or rsync.
author: Amr Ashraf
logsource:
  category: process_creation
  platform: windows
  log_source: Security.evtx
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith:
      - 'robocopy.exe'
      - 'xcopy.exe'
      - 'powershell.exe'
    CommandLine|contains|re:
      - '/mir'
      - 'Copy-Item *-Recurse'
  condition: selection
fields:
  - NewProcessName
  - CommandLine
level: medium
tags:
  - attack.collection
  - attack.exfiltration
  - attack.t1119
  - attack.t1052.001
falsepositives:
  - Legitimate data transfers or backups
triage:
  - Verify the source and destination of the file copying activity.
  - Check if the activity is scheduled or part of a known backup process.
  - Investigate the user account that initiated the process.
  - Review the command line arguments for any unusual or suspicious parameters.
  - Correlate with other security events to identify potential malicious activity.
VQL: |
  LET ID_1229 = (NewProcessName =~ ("robocopy.exe"|"xcopy.exe"|"powershell.exe") AND CommandLine =~ ("/mir"|"Copy-Item -Recurse"))