title: PowerShell Keylogging Script
description: Detects the use of Win32 API functions in PowerShell scripts that can capture user keystrokes. Attackers may use this technique to steal credentials or other sensitive information.
status: Developed
date: 2024-12-01
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  suspicious_keylogging_script:
    EventID: 4104
    ScriptBlockText|contains:
      - 'GetAsyncKeyState'
      - 'NtUserGetAsyncKeyState'
      - 'GetKeyboardState'
      - 'Get-Keystrokes'
      - 'SetWindowsHookA'
      - 'SetWindowsHookW'
      - 'SetWindowsHookEx'
      - 'SetWindowsHookExA'
      - 'NtUserSetWindowsHookEx'
      - 'GetForegroundWindow'
      - 'GetWindowTextA'
      - 'GetWindowTextW'
      - 'WM_KEYBOARD_LL'
      - 'WH_MOUSE_LL'
  condition: suspicious_keylogging_script
fields:
  - ScriptBlockText
  - SecurityID
falsepositives:
  - Authorized PowerShell scripts used by administrators or for legitimate testing
level: high
tags:
  - attack.collection
  - attack.execution
  - attack.T1056
  - attack.T1056.001
  - attack.T1059
  - attack.T1059.001
  - attack.T1106
