title: Automated Data Collection via PowerShell
description: Detects PowerShell commands used for recursively searching and copying files for data collection.
author: Amr Ashraf
date: 2024-12-06
status: Experimental
severity: medium
logsource:
  category: script_block
  product: windows
detection:
  selection:
    EventID: 4104
    CommandLine|contains:
      - "Get-ChildItem"
      - "-Recurse"
      - ".doc"
  condition: selection
falsepositives:
  - Legitimate administrative or backup activities.
tags:
  - attack.collection
  - attack.T1119
fields:
  - CommandLine
  - ParentCommandLine
  - Image