# FP testing Req
title: Detect Unauthorized Access to OST or PST Files
status: Experimental
description: Detects unauthorized access to Outlook data files (.ost or .pst) by processes that are not trusted, which may indicate potential data exfiltration or credential harvesting.
author: Amr Ashraf
logsource:
  category: file_access
  platform: windows
  log_source: Security.evtx
detection:
  selection:
    EventID: 4663 
    ObjectType: file
    ObjectName|endswith:
      - ".ost"
      - ".pst"
  exclusion:
    ProcessName|contains:
      - "OUTLOOK.EXE"  # Trusted Microsoft Outlook process
      - "scanpst.exe"  # Known PST file repair tool
      - "scanost.exe"  # Known OST file repair tool
  condition: selection and not exclusion
fields:
  - ObjectType
  - ObjectName
  - ProcessName
level: high
tags:
  - attack.collection
  - attack.t1005
falsepositives:
  - Backup or archiving software accessing these files
  - File repair tools or administrative actions
triage:
  - Verify the process accessing the OST or PST file.
  - Check if the process is a known and trusted application.
  - Investigate the user account associated with the process.
  - Review recent activities on the system for any signs of compromise.
  - Correlate with other security events to identify potential malicious behavior.
