title: Detect Mass File Copying Activity
status: Developed
description: Detects tools or scripts used for automated file copying, such as RoboCopy or rsync.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith:
      - 'robocopy.exe'
      - 'xcopy.exe'
      - 'powershell.exe'
    CommandLine|contains:
      - '/mir'
      - 'Copy-Item -Recurse'
  condition: selection
fields:
  - NewProcessName
  - CommandLine
level: medium
tags:
  - attack.collection
  - attack.exfiltration
  - t1119
falsepositives:
  - Legitimate data transfers or backups
