title: Detect Loading of Compression Libraries
status: Experimental
description: Detects processes loading known compression libraries for archiving data.
author: Amr Ashraf
logsource:
  category: dll_loading
  platform: windows
  log_source: Sysmon.evtx
detection:
  selection:
    EventID: 7
    Image|endswith:
      - '.exe'
      - '.py'
      - '.dll'
    ImageLoaded|contains:
      - 'zlib.dll'
      - 'libarchive.dll'
      - 'SharpZipLib.dll'
      - '7z.dll'
  condition: selection
fields:
  - Image
  - ImageLoaded
level: medium
tags:
  - attack.collection
  - t1560.002
falsepositives:
  - Legitimate applications using compression libraries
triage:
  - Investigate the process that loaded the compression library.
  - Check the reputation and digital signature of the process.
  - Determine if the process is expected to use compression libraries.
  - Review the process execution history and related activities.
  - Correlate with other security events to identify potential malicious behavior.
