title: Audio Capture via PowerShell
description: Detects audio capture via PowerShell Cmdlet.
author: Amr Ashraf
status: Developed
tags:
    - attack.collection
    - attack.t1123
logsource:
    category: process_creation
    platform: windows
    log_source: Security.evtx
detection:
    selection_process_creation:
        EventID: 4688
        NewProcessName|endswith:
            - \powershell.exe
            - \pwsh.exe
        CommandLine|contains:
            - 'WindowsAudioDevice-Powershell-Cmdlet'
            - 'Toggle-AudioDevice'
            - 'Get-AudioDevice '
            - 'Set-AudioDevice '
            - 'Write-AudioDevice '
    selection_scriptblock:
        EventID: 4104
        ScriptBlockText|contains:
            - 'WindowsAudioDevice-Powershell-Cmdlet'
            - 'Toggle-AudioDevice'
            - 'Get-AudioDevice '
            - 'Set-AudioDevice '
            - 'Write-AudioDevice '
    condition: selection_process_creation or selection_scriptblock
falsepositives:
    - Legitimate audio capture by legitimate user.
level: medium
triage:
    - Investigate the source of the PowerShell command.
    - Check the user account that executed the command.
    - Verify if the command is part of a legitimate administrative task.
    - Look for other suspicious activities around the same timeframe.
    - Review the system's audio device settings and changes.

