title: Automated Data Collection via Command Prompt
description: Detects automated data collection using Command Prompt to gather .docx files from the system.
author: Amr Ashraf
date: 2024-12-06
status: developed
severity: medium
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    CommandLine|contains|all:
      - 'dir '
      - 'c:'
      - '/b' 
      - '/s'
      - ' .docx'
  selection_1:
    CommandLine|contains|all:
      - 'for '
      - '/R' 
      - 'c:\'
      - 'in'
      - '.docx'
  condition: selection or selection_1
falsepositives:
  - Legitimate scripts or administrative tasks scanning for and copying files.
tags:
  - attack.collection
  - attack.T1119
fields:
  - CommandLine
  - ParentCommandLine
  - Image
VQL: |
  LET ID_1517 = (
            (CommandLine =~ "dir " and CommandLine =~ "c:" and CommandLine =~ "/b" and CommandLine =~ "/s" and CommandLine =~ " .docx")
            OR (CommandLine =~ "for " and CommandLine =~ "/R" and CommandLine =~ "C:\" and CommandLine =~ "in" and CommandLine =~ " .docx")
      )