title: PowerShell Mailbox Collection Script
description: Detects PowerShell scripts containing methods and classes that can be used to collect data from local or remote mailboxes. This activity could indicate adversaries targeting user emails to collect sensitive information.
status: Experimental
date: 2024-12-01
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  suspicious_mailbox_collection:
    EventID: 4104
    ScriptBlockText|contains:
      - 'Microsoft.Office.Interop.Outlook'
      - 'Interop.Outlook.olDefaultFolders'
      - '::olFolderInBox'
      - 'Microsoft.Exchange.WebServices.Data.Folder'
      - 'Microsoft.Exchange.WebServices.Data.FileAttachment'
  condition: suspicious_mailbox_collection
fields:
  - EventID
  - ScriptBlockText
  - SecurityID
falsepositives:
  - Authorized PowerShell scripts for mailbox management by administrators
  - Testing or development activities in controlled environments
level: medium
tags:
  - attack.collection
  - attack.execution
  - attack.T1114
  - attack.T1114.001
  - attack.T1114.002
  - attack.T1059
  - attack.T1059.001
