title: PowerShell Script with Webcam Video Capture Capabilities
description: Detects PowerShell scripts that include functionality to record webcam video. Attackers may use this technique to spy on or extort victims.
status: Developed
date: 2024-12-01
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  suspicious_webcam_script:
    EventID: 4104
    ScriptBlockText|contains:
      - 'NewFrameEventHandler'
      - 'VideoCaptureDevice'
      - 'DirectX.Capture.Filters'
      - 'VideoCompressors'
      - 'Start-WebcamRecorder'
      - 'capCreateCaptureWindowA'
      - 'capCreateCaptureWindow'
      - 'capGetDriverDescription'
      - 'avicap32.dll'
      - 'avicap32'
  condition: suspicious_webcam_script
fields:
  - EventID
  - ScriptBlockText
falsepositives:
  - Authorized PowerShell scripts for testing or legitimate video recording purposes
level: medium
tags:
  - attack.collection
  - attack.execution
  - attack.T1125
  - attack.T1059
  - attack.T1059.001
