title: Detect Data Exfiltration via PowerShell Process Creation
status: Developed
description: Detects PowerShell or PowerShell Core activity involving file creation and data exfiltration using `Invoke-WebRequest` with the PUT method, identified through process creation logs.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains|all:
      - 'Invoke-WebRequest'
      - '-Method '
      - 'Put'
      - '-InFile'
  condition: selection
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate administrative scripts or automation involving file uploads
  - Monitoring or logging tools transferring files as part of their operations
level: critical
tags:
  - attack.exfiltration
  - attack.t1041
  - attack.execution
VQL:
  LET ID_1408 = (
    (NewProcessName =~ "\\powershell\\.exe$" OR NewProcessName =~ "\\pwsh\\.exe$") AND
    CommandLine =~ "(?=.*Invoke-WebRequest|.*-Method |.*Put|.*-InFile)"
  )
