title: Detect Data Exfiltration via PowerShell Invoke-WebRequest PUT
status: Developed
description: Detects PowerShell activity involving file creation and data exfiltration using `Invoke-WebRequest` with the PUT method.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: script
  product: windows
detection:
  selection:
    EventID: 4104
    ScriptBlockText|contains|all:
      - 'New-Item'
      - 'Invoke-WebRequest'
      - '-Method'
      - ' Put'
  selection_content:
    ScriptBlockText|contains|any:
      - '-ContentType "application/octet-stream"'
      - '-InFile'
  condition: selection or selection_content
fields:
  - EventID
  - ScriptBlockText
  - UserID
  - Computer
  - LogonID
falsepositives:
  - Legitimate use of PowerShell scripts for file uploads in authorized workflows
  - Administrative tasks involving file creation and remote transfers
level: critical
tags:
  - attack.exfiltration
  - attack.t1041
  - attack.execution
