title: Detect LSASS Dumping via RdrLeakDiag
status: Developed
description: Detects the use of the `rdrleakdiag.exe` tool to dump LSASS memory, a technique often used for credential theft.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4988
    Image|endswith:
      - '\rdrleakdiag.exe'
    CommandLine|contains|all:
      - "/p"
      - "/o"
      - "dmp"
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - ParentCommandLine
  - User
falsepositives:
  - Legitimate administrative or debugging tasks using `rdrleakdiag.exe`
level: critical
tags:
  - attack.credential_access
  - attack.t1003.001
  - attack.execution
