title: Accessing WinAPI in PowerShell for Credentials Dumping
status: Developed
description: Detects Accessing to lsass.exe by Powershell
author: Amr Ashraf
date: 2024/11/13
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID:
            - 8
            - 10
        SourceImage|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        TargetImage|endswith: '\lsass.exe'
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
    - attack.credential_access
    - attack.t1003.001
