title: Potential Credential Dumping Via LSASS Process Clone
description: Detects a suspicious LSASS process process clone that could be a sign of credential dumping activity
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.credential-access
    - attack.t1003
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \Windows\System32\lsass.exe
        NewProcessName|endswith: \Windows\System32\lsass.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: critical
ruletype: Sigma
