title: Credential Dumping Attempt Via WerFault
status: Developed
description: Detects process LSASS memory dump using WerFault dumping.
author: Amr Ashraf
date: 2024/11/10
logsource:
    category: process_access
    product: windows
detection:
    selection:
        SourceImage|endswith: '\WerFault.exe'
        TargetImage|endswith: '\lsass.exe'
        GrantedAccess: '0x1FFFFF'
    condition: selection
falsepositives:
    - Actual failures in lsass.exe that trigger a crash dump (unlikely)
level: high