title: Potential Credential Dumping Activity Via LSASS
description: |
    Detects process access requests to the LSASS process with specific call trace calls and access masks.
    This behaviour is expressed by many credential dumping tools such as Mimikatz, NanoDump, Invoke-Mimikatz, Procdump and even the Taskmgr dumping feature.
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.credential-access
    - attack.t1003.001
logsource:
    category: process_access
    product: windows
detection:
    selection:
        EventID: 
            - "8"
            - "10"
        TargetImage|endswith: '\lsass.exe'
        GrantedAccess|contains:
            - '0x1038'
            - '0x1438'
            - '0x143a'
        CallTrace|contains:
            - 'dbgcore.dll'
            - 'dbghelp.dll'
    condition: selection
falsepositives:
    - Unknown
level: medium
