title: Detect LSASS Memory Dumping via ProcDump
status: Developed
description: Detects the use of Sysinternals ProcDump to dump the memory of lsass.exe, a technique often used for offline credential theft attacks.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    Image|endswith: '\procdump.exe'
    CommandLine|contains:
      - "-ma"
      - "lsass.exe"
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - ParentCommandLine
  - User
falsepositives:
  - Legitimate use by administrators for debugging or troubleshooting
level: critical
tags:
  - attack.credential_access
  - attack.t1003.001
  - attack.execution
