title: Potential Credential Dumping Via LSASS SilentProcessExit Technique
description: Detects changes to the Registry in which a monitor program gets registered to dump the memory of the lsass.exe process
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.credential-access
    - attack.t1003.001
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|contains: 'Microsoft\Windows NT\CurrentVersion\SilentProcessExit\lsass.exe'
    condition: selection
falsepositives:
    - Unlikely
level: critical
