title: Manipulation of User Computer or Group Security Principals Across AD Through PS
description: |
    Adversaries may create a domain account to maintain access to victim systems.
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.persistence
    - attack.t1136.002
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    ps_script:
        EventID: 4104
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection:
        ScriptBlockText|contains: System.DirectoryServices.AccountManagement
    condition: ps_script and selection
falsepositives:
    - Legitimate administrative script
level: medium