title: Windows proccess discovery using WMI utility [low]
status: test
description: Proess Discovery using Commandline utility
references:
    - Threat intel feed "https://andreacristaldi.github.io/APTmap/"
tags:
    - attack.discovery
    - attack.t1057
author: Amr Ashraf
logsource:
    product: Windows
    category: process_execution
detection:
    selection:
        CommandLine|contains|all: 
          - 'get-wmiObject' 
          - '-class '
          - 'Win32_Process'
    condition: selection
falsepositives:
    - legitemate use
level: low

