title: Audio Capture Using Device Audio Commandlet
description: Detects the use of AudioDeviceCmdlets via PowerShell for capturing device audio.
author: Amr Ashraf
date: 2024-12-06
status: developed
level: medium
logsource:
  category: script_block_logging
  Platform: windows
  log_source: PowerShell Operational.evtx
detection:
  selection:
    EventID: 4104
    message|contains: 'WindowsAudioDevice-Powershell-Cmdlet'
  condition: selection
falsepositives:
  - Legitimate use of AudioDeviceCmdlets for system audio management.
tags:
  - attack.collection
  - attack.T1123
fields:
  - CommandLine
  - ParentCommandLine
  - Image
triage:
  - Investigate the source of the PowerShell script execution.
  - Check the user account that executed the script.
  - Verify if the use of AudioDeviceCmdlets is legitimate or part of a known task.
  - Look for other suspicious activities around the same timeframe.
  - Correlate with other alerts to identify potential malicious behavior.
