title: Suspicious Redirection to Local Admin Share
description: Detects a suspicious output redirection to the local admins share, this technique is often found in malicious scripts or hacktool stagers
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.exfiltration
    - attack.t1048
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_redirect:
        CommandLine|contains: '>'
    selection_share:
        CommandLine|contains:
            - \\\\127.0.0.1\\admin$\\
            - \\\\localhost\\admin$\\
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
VQL: |
  LET ID_1103 = (
      CommandLine =~ "(?=.*>.*)" AND
      (CommandLine =~ "(?=.*\\\\127\\.0\\.0\\.1\\\\admin\\$\\\\|.*\\\\localhost\\\\admin\\$\\\\)")
  )

