title: Registry Dump of SAM Creds and Secrets
description: Adversaries may attempt to extract credential material from the Security Account Manager (SAM) database either through Windows Registry where the SAM database is stored
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.credential-access
    - T1003.004
    - T1003.005
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_reg:
        CommandLine|contains: 
            - ' save '
            - ' export '
    selection_key:
        CommandLine|contains:
            - 'HKLM\sam'
            - 'HKLM\system'
            - 'HKLM\security'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
VQL: |
    LET ID_1016 = (
        (CommandLine =~ "(?=.* save |.* export )") AND
        (CommandLine =~ "(?=.*HKLM\\sam|.*HKLM\\system|.*HKLM\\security)")
    )
