title: Detect Credential Listing via cmdkey
status: Developed
description: Detects the use of `cmdkey /list` to enumerate stored credentials on a system.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith: '\cmdkey.exe'
    CommandLine|contains: "/list"
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - ParentCommandLine
  - User
falsepositives:
  - Legitimate use by system administrators for credential management
  - Automation scripts that rely on stored credentials
level: high
tags:
  - attack.credential_access
  - attack.discovery
  - attack.t1555
VQL: |
  LET ID_1388 = (
      NewProcessName =~ "\\cmdkey\\.exe$" AND
      CommandLine =~ "(?=.*\\/list)"
  )
