title: Interactive AT Job
description: Detects an interactive AT job, which may be used as a form of privilege escalation.
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.privilege-escalation
    - attack.t1053.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: interactive
        NewProcessName|contains: \at.exe
    condition: process_creation and selection
falsepositives:
    - Unlikely (at.exe deprecated as of Windows 8)
level: high
VQL:
  LET ID_1125 = (
      CommandLine =~ "(?=.*interactive)" AND
      NewProcessName =~ "(?=.*\\at\\.exe)"
  )

