title: Detect Scheduled Task Creation via schtasks
status: Experimental
description: Detects the use of the `schtasks` command to create or modify scheduled tasks. This is often abused for persistence or execution.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith: '\schtasks.exe'
    CommandLine|contains:
      - '/Create'
      - '/Run'
      - '/Delete'
  condition: selection
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate use by administrators to create, modify, or delete scheduled tasks
  - IT automation or maintenance scripts
level: high
tags:
  - attack.persistence
  - T1053.005
VQL:
  LET ID_1463 = (
    NewProcessName =~ "\\\\schtasks\\.exe$" AND CommandLine =~ "(?=.*\\/Create|.*\\/Run|.*\\/Delete)"
  )
