title: Suspicious Add Scheduled Task From User AppData Temp
status: Experimental
description: schtasks.exe create task from user AppData\Local\Temp
author: Amr Ashraf
date: 2024/11/14
tags:
    - attack.execution
    - attack.t1053.005
logsource:
    product: windows
    category: process_creation
detection:
    schtasks:
        EventID: 4688
        NewProcessName|endswith: '\schtasks.exe'
    option:
        CommandLine|contains|all:
            - '/Create '
            - '\AppData\Local\Temp'
    condition: schtasks and option
falsepositives:
    - Unknown
level: high
VQL:
  LET ID_1126 = (
    NewProcessName =~ "\\\\schtasks\\.exe$" AND CommandLine =~ "(?=.*\\/Create\\s)(?=.*\\\\AppData\\\\Local\\\\Temp)"
  )
