title: Detect Task Scheduling Using 'at' Command
status: Experimental
description: Detects the use of the `at` command to schedule tasks "deprecated shouldn't be used". This can be used by attackers to execute commands or scripts at a later time.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:  
    EventID: 4688
    NewProcessName|endswith: '\at.exe'
  condition: selection
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate administrative use of the `at` command to schedule tasks
level: medium
tags:
  - attack.persistence
  - T1053.005
VQL:
  LET ID_1460 = (
    NewProcessName =~ "\\\\at\\.exe$"
  )
