title: Potential Credential Dumping Via LSASS Process Clone
description: Detects a suspicious LSASS process process clone that could be a sign of credential dumping activity
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.credential-access
    - attack.t1003
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|contains: lsass
        NewProcessName|contains: lsass
    condition: process_creation and selection
falsepositives:
    - Unknown
level: critical

VQL: |
    LET ID_1032 = (
        ParentProcessName =~ ".*lsass.*" AND
        NewProcessName =~ ".*lsass.*"
    )
