title: Detect SAM File Dumping via WinPwn
status: Experimental
description: Detects the usage of WinPwn to dump the SAM file and retrieve NTLM hashes using the `samfile` command.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: script
  product: windows
detection:
  selection:
    EventID: 4104
    ScriptBlockText|contains:
      - 'WinPwn'
      - 'samfile'
  condition: selection
fields:
  - EventID
  - ScriptBlockText
  - UserID
  - Computer
  - LogonID
falsepositives:
  - Legitimate penetration testing or red team activities
  - Administrative tasks using custom PowerShell scripts
level: critical
tags:
  - attack.credential_access
  - attack.t1003.002
  - attack.execution
