title: Potential Persistence Using SilentProcessExit
description: Detects changes to the Registry in which a monitor program gets registered.
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.credential-access
    - attack.t1003.001
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        EventID: 13
        TargetObject|contains: 'SilentProcessExit'
    condition: selection
falsepositives:
    - Unlikely
level: Medium
