title: LSASS Memory Dump File Creation
description: LSASS memory dump creation using operating systems utilities. Procdump will use process name in output file if no name is specified
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.credential_access
    - T1003.001
logsource:
    category: file_event
    product: windows
detection:
    selection:
        EventID: 11
        TargetFilename|contains|all: 
            - 'lsass'
            - 'dmp'
    condition: selection
fields:
    - ComputerName
    - TargetFilename
falsepositives:
    - Dumping lsass memory for forensic investigation purposes by legitimate incident responder or forensic invetigator
    - Dumps of another process that contains lsass in its process name (substring)
level: high
