title: Potential Credential Dumping Via WER
description: Detects potential credential dumping via Windows Error Reporting LSASS Shtinkering technique which uses the Windows Error Reporting to dump lsass
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.credential-access
    - attack.t1003.001
logsource:
    product: windows
    category: process_creation
detection:
    selection_img:
        - EventID: 4688
        - NewProcessName|endswith: '\Werfault.exe'
    selection_cli:
        CommandLine|contains|all:
            - ' -u -p '
            - ' -ip '
            - ' -s '
    filter_lsass:
        ParentImage: 'C:\Windows\System32\lsass.exe'
    condition: all of selection_* and not 1 of filter_*
falsepositives:
    - Windows Error Reporting might produce similar behavior. In that case, check the PID associated with the "-p" parameter in the CommandLine.
level: high
VQL: |
    LET ID_1035 = (
        (NewProcessName =~ "\\Werfault\\.exe$") AND
        CommandLine =~ "(?=.* -u -p .* -ip .* -s )" AND
        NOT (ParentImage == "C:\\Windows\\System32\\lsass.exe")
    )
