title: MavInject Process Injection
description: Detects process injection using the signed Windows tool Mavinject32.exe
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.t1055.001
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: ' /INJECTRUNNING '
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
