# Needs FP testing
title: Suspicious Access Using Local Administrator Account
description: Detects logons using the local Administrator account (SID ending in -500), which could indicate lateral movement or privilege escalation attempts.
status: Developed
author: Amr Ashraf
logsource:
  category: logon
  product: windows
detection:
  selection:
    EventID: 4624
    TargetUserSid: '*-500'  # Local Administrator SID pattern
    LogonType:
      - 3
      - 10
  condition: selection
fields:
  - EventID
  - TargetUserSid
  - TargetUserName
  - LogonType
  - TargetDomainName
  - IpAddress
level: high
tags:
  - attack.privilege_escalation
  - attack.lateral_movement
  - attack.t1078
falsepositives:
  - Legitimate logons by IT administrators in isolated systems or in non-domain environments.
