title: Detect Brute Force Attempts on Windows [aggregation]
description: Detects repeated failed login attempts from the same source IP or targeting the same account on a Windows system for logon types 2, 3, and 10, indicative of brute-force activity.
status: Developed
author: Amr Ashraf
date: 2024/11/03
logsource:
  category: authentication
  product: windows
detection:
  selection:
    EventID: 4625                      
    LogonType:
      - 2   
      - 3   
      - 10  
  condition: selection | count() by source_ip > 10 within 5m or count() by user > 10  within 5m
fields:
  - source_ip
  - user
  - target_host
  - EventID
  - LogonType
falsepositives:
  - Automated scripts or applications with incorrect credentials
level: medium
tags:
  - attack.reconnaissance
  - attack.t1110
