title: Suspicious PFX File Creation
status: Developed
description: A general detection for processes creating PFX files. This could be an indicator of an adversary exporting a local certificate to a PFX file.
author: Amr Ashraf
date: 2024/11/12
logsource:
    product: windows
    category: file_event
detection:
    selection:
        EventID: 11
        TargetFileName|endswith: '.pfx'
    filter_main_windows_tmp_key:
        TargetFileName|contains|all:
            - '\Templates\Windows\Windows_TemporaryKey.pfx'
            - '\CMake\'
    condition: selection and not 1 of filter_main_*
falsepositives:
    - System administrators managing certificates.
level: medium
tags:
    - attack.credential-access
    - attack.t1552.004