title: Creation of Domain Backup DPAPI Private Key
status: Experimental
author: Amr Ashraf
date: 2024-12-01
description: |
    Detects the creation of Domain Backup DPAPI private keys on Windows systems. Adversaries may extract
    the DPAPI domain backup key from a Domain Controller (DC) to decrypt any domain user master key file, exposing user secrets.
logsource:
    category: file_event
    product: windows
detection:
    selection:
        EventID: 11
        TargetFileName|contains|re:
            - "ntds_capi_*.pfx"
            - "ntds_capi_*.pvk"
    condition: selection
fields:
    - FileName
    - EventID
    - EventType
    - FilePath
    - User
    - Hostname
falsepositives:
    - Legitimate domain administrator activities or updates to DPAPI backup keys.
    - Backup or recovery operations by authorized administrators.
level: high
tags:
    - attack.credential_access
    - attack.t1552
    - attack.t1552.004
    - attack.t1555
references:
    - https://www.dsinternals.com/en/retrieving-dpapi-backup-keys-from-active-directory/
    - https://posts.specterops.io/operational-guidance-for-offensive-user-dpapi-abuse-1fb7fac8b107
