title: Detect Changes to SID History Attribute
id: detect-sid-history-modification
status: Experimental
description: Detects modifications to the SIDHistory attribute of Active Directory user accounts, indicative of SID history injection.
author: Amr Ashraf
logsource:
  category: directory_service
  product: windows
detection:
  selection:
    EventID: 5136  # Directory object modification
    AttributeLDAPDisplayName: 'sIDHistory'
  condition: selection
fields:
  - EventID
  - SubjectUserName
  - ObjectName
  - AttributeLDAPDisplayName
  - AttributeValue
  - User
  - ComputerName
level: high
tags:
  - attack.privilege_escalation
  - attack.persistence
  - t1134.004
falsepositives:
  - Legitimate domain migration or account consolidation activities
