title: Suspicious PowerShell Execution with Base64 and Compression
status: test
description: Detects PowerShell execution with Base64 decoding and decompression, commonly used for obfuscation and malicious payload execution.
author: Amr Ashraf
references:
    - https://attack.mitre.org/techniques/T1059.001/
    - https://attack.mitre.org/techniques/T1140/
    - https://blog.talosintelligence.com/targeted-attacks-in-middle-east/
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1059.001
    - attack.t1140
logsource:
    category: process_creation
    product: windows
detection:
    selection_powershell_execution:
        Image|endswith:
            - '\powershell.exe'
    selection_obfuscation_flags:
        CommandLine|contains:
            - '-NoP'
            - '-NonI'
            - '-W Hidden'
            - '-Exec Bypass'
    selection_base64_compression:
        CommandLine|contains:
            - 'FromBase64String'
            - 'IO.Compression.DeflateStream'
            - 'IO.MemoryStream'
            - 'Invoke-Expression'
            - 'IEX'
    condition: selection_powershell_execution and (selection_obfuscation_flags and selection_base64_compression)
falsepositives:
    - Rare but possible use in legitimate administrative scripts
level: high
