title: Suspicious WScript Execution from AppData
status: test
description: Detects execution of WScript running a WSF script from AppData, a technique often used by malware for persistence.
author: Amr Ashraf
references:
    - https://attack.mitre.org/techniques/T1059.005/
    - https://attack.mitre.org/techniques/T1547.001/
    - https://blog.talosintelligence.com/targeted-attacks-in-middle-east/
tags:
    - attack.execution
    - attack.persistence
    - attack.t1059.005
    - attack.t1547.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_wscript_execution:
        Image|endswith: '\wscript.exe'
    selection_wsf_script:
        CommandLine|contains:
            - '.wsf'
    selection_suspicious_path:
        CommandLine|contains:
            - '\AppData\Roaming\Microsoft\Protect\'
            - '\AppData\Local\Microsoft\Protect\'
            - '\AppData\Roaming\'
            - '\AppData\Local\'
    condition: selection_wscript_execution and selection_wsf_script and selection_suspicious_path
falsepositives:
    - Legitimate administrative or automation scripts
level: high
