title: Suspicious Process Execution via COM Hijacking (Scripting.Dictionary CLSID)
status: test
description: Detects execution of wscript.exe or cscript.exe triggered via COM hijacking using the Scripting.Dictionary CLSID.
author: Amr Ashraf
references:
    - https://attack.mitre.org/techniques/T1546.015/
    - https://securelist.com/wirtes-campaign-in-the-middle-east-living-off-the-land-since-at-least-2019/105044/
tags:
    - attack.persistence
    - attack.defense_evasion
    - attack.t1546.015
logsource:
    category: process_creation
    product: windows
detection:
    selection_script_execution:
        Image|endswith:
            - '\wscript.exe'
            - '\cscript.exe'
    selection_suspicious_script:
        CommandLine|contains:
            - 'C:\ProgramData\Winrm.vbs'
            - 'C:\Users\Public\'
            - 'AppData\Local\'
            - 'AppData\Roaming\'
    selection_suspicious_parent:
        ParentImage|endswith:
            - '\rundll32.exe'
            - '\dllhost.exe'
            - '\regsvr32.exe'
            - '\mshta.exe'
            - '\explorer.exe'
    condition: selection_script_execution and (selection_suspicious_script or selection_suspicious_parent)
falsepositives:
    - Rare but possible legitimate use of COM objects triggering script execution
level: high
