title: Suspicious IExplorer Registry Run Key Persistence
status: test
author: Amr Ashraf
description: Detects the creation of a registry key named 'IExplorer' under the Run key, which can be used for persistence.
references:
    - https://attack.mitre.org/techniques/T1547/001/
    - https://blog.talosintelligence.com/targeted-attacks-in-middle-east/
tags:
    - attack.persistence
    - attack.t1547.001
    - windows
logsource:
    category: registry_event
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 13
        TargetObject|endswith: '\Software\Microsoft\Windows\CurrentVersion\Run\IExplorer'
    condition: selection
falsepositives:
    - Legitimate software using this registry key
level: high
