title: PowerShell Scripts Installed as Services
description: Detects powershell script installed as a Service
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.execution
    - attack.t1569.002
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: Service Control Manager
        EventID: 7045
        ImagePath|contains:
            - powershell
            - pwsh
    condition: system and selection
falsepositives:
    - Unknown
level: high

