title: LOLBAS Renamed
description: This is to detect when a LOLBAS (default Windows binary or script) was renamed in order to hide its execution. OringalFileName is the original filename in the PE header. From my tests, false positives should be low so I rated this as high.

status: Experimental
author: Amr Ashraf
date: 2024/11/09
logsource:
    product: windows
    service: sysmon
    definition: 'Sysmon needs to be installed and configured.'
detection:
    selection_basic:
        Channel: Microsoft-Windows-Sysmon/Operational
        EventID: 1
    selection_OriginalFilenameIsLOLBIN:
        - OriginalFileName|endswith: 'AppInstaller.exe'
        - OriginalFileName|endswith: 'Aspnet_Compiler.exe'
        - OriginalFileName|endswith: 'At.exe'
        - OriginalFileName|endswith: 'AtBroker.exe'
        - OriginalFileName|endswith: 'Bash.exe'
        - OriginalFileName|endswith: 'BitsAdmin.exe'
        - OriginalFileName|endswith: 'CertOC.exe'
        - OriginalFileName|endswith: 'CertReq.exe'
        - OriginalFileName|endswith: 'CertUtil.exe'
        - OriginalFileName|endswith: 'Cmd.exe'
        - OriginalFileName|endswith: 'Cmdkey.exe'
        - OriginalFileName|endswith: 'cmdl32.exe'
        - OriginalFileName|endswith: 'Cmstp.exe'
        - OriginalFileName|endswith: 'ConfigSecurityPolicy.exe'
        - OriginalFileName|endswith: 'Control.exe'
        - OriginalFileName|endswith: 'Csc.exe'
        - OriginalFileName|endswith: 'Cscript.exe'
        - OriginalFileName|endswith: 'DataSvcUtil.exe'
        - OriginalFileName|endswith: 'DesktopImgDownldr.exe'
        - OriginalFileName|endswith: 'DfSvc.exe'
        - OriginalFileName|endswith: 'Diantz.exe'
        - OriginalFileName|endswith: 'DiskShadow.exe'
        - OriginalFileName|endswith: 'dllhost.exe'
        - OriginalFileName|endswith: 'DnsCmd.exe'
        - OriginalFileName|endswith: 'EsentUtl.exe'
        - OriginalFileName|endswith: 'EventVwr.exe'
        - OriginalFileName|endswith: 'Expand.exe'
        - OriginalFileName|endswith: 'ExtExport.exe'
        - OriginalFileName|endswith: 'Extrac32.exe'
        - OriginalFileName|endswith: 'FindStr.exe'
        - OriginalFileName|endswith: 'Finger.exe'
        - OriginalFileName|endswith: 'FltMC.exe'
        - OriginalFileName|endswith: 'ForFiles.exe'
        - OriginalFileName|endswith: 'FTP.exe'
        - OriginalFileName|endswith: 'GfxDownloadWrapper.exe'
        - OriginalFileName|endswith: 'GpScript.exe'
        - OriginalFileName|endswith: 'HH.exe'
        - OriginalFileName|endswith: 'IMEWDBLD.exe'
        - OriginalFileName|endswith: 'Ie4uInit.exe'
        - OriginalFileName|endswith: 'IeExec.exe'
        - OriginalFileName|endswith: 'ILASM.exe'
        - OriginalFileName|endswith: 'InfDefaultInstall.exe'
        - OriginalFileName|endswith: 'InstallUtil.exe'
        - OriginalFileName|endswith: 'Jsc.exe'
        - OriginalFileName|endswith: 'MakeCab.exe'
        - OriginalFileName|endswith: 'MavInject.exe'
        - OriginalFileName|endswith: 'Microsoft.Workflow.Compiler.exe'
        - OriginalFileName|endswith: 'Mmc.exe'
        - OriginalFileName|endswith: 'MpCmdRun.exe'
        - OriginalFileName|endswith: 'Msbuild.exe'
        - OriginalFileName|endswith: 'MsConfig.exe'
        - OriginalFileName|endswith: 'Msdt.exe'
        - OriginalFileName|endswith: 'Mshta.exe'
        - OriginalFileName|endswith: 'MsiExec.exe'
        - OriginalFileName|endswith: 'NetSh.exe'
        - OriginalFileName|endswith: 'OdbcConf.exe'
        - OriginalFileName|endswith: 'OfflineScannerShell.exe'
        - OriginalFileName|endswith: 'OneDriveStandaloneUpdater.exe'
        - OriginalFileName|endswith: 'Pcalua.exe'
        - OriginalFileName|endswith: 'PcwRun.exe'
        - OriginalFileName|endswith: 'PktMon.exe'
        - OriginalFileName|endswith: 'PnpUtil.exe'
        - OriginalFileName|endswith: 'PresentationHost.exe'
        - OriginalFileName|endswith: 'Print.exe'
        - OriginalFileName|endswith: 'PrintBrm.exe'
        - OriginalFileName|endswith: 'Psr.exe'
        - OriginalFileName|endswith: 'Rasautou.exe'
        - OriginalFileName|endswith: 'Reg.exe'
        - OriginalFileName|endswith: 'Regasm.exe'
        - OriginalFileName|endswith: 'RegEdit.exe'
        - OriginalFileName|endswith: 'RegIni.exe'
        - OriginalFileName|endswith: 'Register-CimProvider.exe'
        - OriginalFileName|endswith: 'RegSvcs.exe'
        - OriginalFileName|endswith: 'RegSvr32.exe'
        - OriginalFileName|endswith: 'Replace.exe'
        - OriginalFileName|endswith: 'RpcPing.exe'
        - OriginalFileName|endswith: 'RunDll32.exe'
        - OriginalFileName|endswith: 'RunOnce.exe'
        - OriginalFileName|endswith: 'RunScriptHelper.exe'
        - OriginalFileName|endswith: 'Sc.exe'
        - OriginalFileName|endswith: 'SchTasks.exe'
        - OriginalFileName|endswith: 'ScriptRunner.exe'
        - OriginalFileName|endswith: 'SettingSyncHost.exe'
        - OriginalFileName|endswith: 'StorDiag.exe'
        - OriginalFileName|endswith: 'SyncAppvPublishingServer.exe'
        - OriginalFileName|endswith: 'TtdInject.exe'
        - OriginalFileName|endswith: 'TtTracer.exe'
        - OriginalFileName|endswith: 'VBC.exe'
        - OriginalFileName|endswith: 'Verclsid.exe'
        - OriginalFileName|endswith: 'ping.exe'
        - OriginalFileName|endswith: 'ipconfig.exe'
        - OriginalFileName|endswith: 'Wab.exe'
        - OriginalFileName|endswith: 'Wmic.exe'
        - OriginalFileName|endswith: 'WorkFolders.exe'
        - OriginalFileName|endswith: 'Wscript.exe'
        - OriginalFileName|endswith: 'WsReset.exe'
        - OriginalFileName|endswith: 'Wuauclt.exe'
        - OriginalFileName|endswith: 'Xwizard.exe'
        - OriginalFileName|endswith: 'ADPlus.exe'
        - OriginalFileName|endswith: 'AgentExecutor.exe'
        - OriginalFileName|endswith: 'Appvlp.exe'
        - OriginalFileName|endswith: 'Bginfo.exe'
        - OriginalFileName|endswith: 'Cdb.exe'
        - OriginalFileName|endswith: 'CoreGen.exe'
        - OriginalFileName|endswith: 'CSI.exe'
        - OriginalFileName|endswith: 'DefaultPack.exe'
        - OriginalFileName|endswith: 'DevtoolsLauncher.exe'
        - OriginalFileName|endswith: 'DNX.exe'
        - OriginalFileName|endswith: 'Dotnet.exe'
        - OriginalFileName|endswith: 'Dxcap.exe'
        - OriginalFileName|endswith: 'NTDSUtil.exe'
        - OriginalFileName|endswith: 'procdump.exe'
        - OriginalFileName|endswith: 'psexec.exe'
        - OriginalFileName|endswith: 'SqlDumper.exe'
        - OriginalFileName|endswith: 'winrm.vbs.exe'
        - OriginalFileName|endswith: 'powershell.exe'
        - OriginalFileName|endswith: 'xcopy.exe'
        - OriginalFileName|endswith: 'RoboCopy.exe'
    filter_OriginalFilenameAndProcessNameIsSame:
        Image|endswithfield: OriginalFileName
    condition: selection_basic and selection_OriginalFilenameIsLOLBIN and not filter_OriginalFilenameAndProcessNameIsSame
falsepositives:
tags:
    - lolbas
    - sysmon
references:
    - https://docs.microsoft.com/en-us/sysinternals/downloads/sysmon
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-block-rules
    - https://lolbas-project.github.io/
