title: Detect SYN Scan
description: Detects high volume of SYN packets without subsequent ACK packets, often indicating a SYN Scan.
status: Developed
author: Amr Ashraf
date: 2024/11/03
logsource:
  category: firewall
  product: any
detection:
  selection:
    packet: SYN
  condition: selection | count() by source_ip > 50 within 1m
fields:
  - source_ip
  - dest_ip
  - dest_port
  - packet
falsepositives:
  - Network diagnostics tools or load balancers performing health checks
level: medium
tags:
  - attack.reconnaissance
  - attack.t1046
