title: Detect Alternate Data Streams (ADS) File Creation
id: detect-ads-creation-access
status: Experimental
description: Detects creation of files with Alternate Data Streams (ADS) in NTFS.
author: Amr Ashraf
logsource:
  category: file_event
  product: windows
detection:
  selection:
    EventID: 11
    TargetFileName|contains: ':'
  exclusion:
    TargetFileName|endswith:
      - ':Zone.Identifier'
      - ':$DATA'
      - ':$INDEX_ALLOCATION'
      - '::'
      - ':\' 
    ParentProcessName|contains:	
      - 'compattelrunner.exe'
  condition: selection and not exclusion
fields:
  - EventID
  - TargetFileName
  - AccessMask
  - SubjectUserName
  - Hostname
level: medium
tags:
  - attack.persistence
  - attack.defense_evasion
  - detection.files
falsepositives:
  - Legitimate ADS usage (e.g., browser downloads with Zone.Identifier)
