title: Unauthorized Use of ScreenConnect for Remote Access
status: test
description: Detects execution of ScreenConnect, which adversaries like MuddyWater have abused for remote access and lateral movement.
author: Amr Ashraf
references:
    - https://attack.mitre.org/techniques/T1219/
    - https://attack.mitre.org/techniques/T1570/
tags:
    - attack.command_and_control
    - attack.lateral_movement
    - attack.t1219
    - attack.t1570
logsource:
    category: process_creation
    product: windows
detection:
    selection_screenconnect_execution:
        Image|endswith:
            - '\ScreenConnect.ClientService.exe'
            - '\ScreenConnect.WindowsClient.exe'
            - '\ScreenConnect.Service.exe'
            - '\ScreenConnect.Client.exe'
    condition: selection_screenconnect_execution
falsepositives:
    - Legitimate IT administrators using ScreenConnect for remote support
level: high
