title: Credential Dumping via Procdump
status: test
description: Detects Procdump being used to dump LSASS memory, a common credential dumping method.
author: Amr Ashraf
references:
    - https://attack.mitre.org/techniques/T1003/
tags:
    - attack.credential_access
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_image:
        Image|endswith: 
          - '\procdump64.exe'
          - '\procdump.exe'
    condition: selection_image and selection_commandline
falsepositives:
    - Legitimate memory analysis activities
level: high
