title: Mimikatz Execution
status: test
description: Detects execution of Mimikatz, often used for credential dumping.
author: Amr Ashraf
references:
    - https://attack.mitre.org/techniques/T1003/
tags:
    - attack.credential_access
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_image:
        - Image|endswith:
              - '\mimikatz.exe'
              - '\mimilib.dll'
              - '\mimispool.exe'
              - '\Invoke-Mimikatz.ps1'
    selection_commandline:
        - CommandLine|contains:
              - 'sekurlsa::logonpasswords'
              - 'lsadump::lsa'
              - 'kerberos::ticket'
              - 'sekurlsa::wdigest'
    condition: selection_image or selection_commandline
falsepositives:
    - Unlikly
level: high
