title: Credential Dumping via LaZagne
status: test
description: Detects execution of LaZagne, which is commonly used to extract stored credentials.
author: Amr Ashraf
references:
    - https://attack.mitre.org/techniques/T1003/
    - https://github.com/AlessandroZ/LaZagne
tags:
    - attack.credential_access
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_image:
        Image|endswith:
            - '\LaZagne.exe'
    selection_commandline:
        CommandLine|contains:
            - 'laZagne.exe all'
            - 'laZagne.exe browsers'
            - 'laZagne.exe windows'
            - 'laZagne.exe sysadmin'
    condition: selection_image or selection_commandline
falsepositives:
    - unlikly
level: high
