title: Execution via CMSTP with Malicious INF File
status: test
description: Detects the execution of CMSTP.exe with a malicious INF file, often used to execute payloads like POWERSTATS.
author: Amr Ashraf
references:
    - https://attack.mitre.org/techniques/T1218.003/
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1218.003
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmstp_execution:
        Image|endswith: '\cmstp.exe'
        CommandLine|contains:
            - '/s'
            - '/i'
    selection_suspicious_inf:
        CommandLine|contains:
            - '.inf'
    filter:
        CommandLine|contains:
            - 'C:\Windows\System32\'
    selection_execution_payload:
        CommandLine|contains:
            - 'powershell'
            - 'cmd.exe /c'
            - 'mshta.exe'
            - 'rundll32.exe'
            - 'regsvr32.exe'
            - 'cscript.exe'
            - 'wscript.exe'
    condition: (selection_cmstp_execution and selection_suspicious_inf and selection_execution_payload) and not filter
falsepositives:
    - Legitimate use of CMSTP for VPN profile installations
level: high
