# Check For FP before deploy
title: Masquerading as Windows Defender
status: test
description: Detects adversaries disguising malicious executables and registry key names as Windows Defender components, a technique used by MuddyWater.
author: Amr Ashraf
references:
    - https://attack.mitre.org/techniques/T1036/
    - https://attack.mitre.org/techniques/T1112/
tags:
    - attack.defense_evasion
    - attack.persistence
    - attack.t1036
    - attack.t1112
logsource:
    category: process_creation
    product: windows
detection:
    selection_image:
        Image|endswith:
            - '\MsMpEng.exe'
            - '\MpCmdRun.exe'
    selection_process_name_mismatch:
        Image|endswith:
            - '\Windows Defender\MsMpEng.exe'
            - '\Windows Defender\MpCmdRun.exe'
    condition: selection_image and not selection_process_name_mismatch
falsepositives:
    - Legitimate Windows Defender operations
level: high
