title: Obfuscated JavaScript Stored in an Image File
status: test
description: Detects execution of an image file containing obfuscated JavaScript code, a technique used by MuddyWater.
author: Amr Ashraf
references:
    - https://attack.mitre.org/techniques/T1027/
tags:
    - attack.defense_evasion
    - attack.t1027
logsource:
    category: Process_creation
    product: windows
detection:
    selection_script_execution:
        - Image|endswith:
              - '\wscript.exe'
              - '\cscript.exe'
        - CommandLine|contains:
              - '.jpg'
              - '.png'
              - '.jpeg'
    condition: selection_script_execution
falsepositives:
    - Legitimate script execution accessing image files
level: high
