title: Persistence via Registry Run Key
status: test
description: Detects modification of the Registry Run key to achieve persistence, a technique observed in MuddyWater attacks.
author: Amr Ashraf
references:
    - https://attack.mitre.org/techniques/T1547.001/
tags:
    - attack.persistence
    - attack.t1547.001
logsource:
    category: registry_event
    product: windows
detection:
    selection_registry_modification:
        EventType: "4657"
        TargetObject|contains:
            - '\Microsoft\Windows\CurrentVersion\Run'
            - '\Microsoft\Windows\CurrentVersion\Runonce'
        Image|contains:
            - '\powershell.exe'
            - '\mshta.exe'
            - '\cmd.exe'
            - '\temp\'
            - '\public\' 
    condition: selection_registry_modification and selection_suspicious_value
falsepositives:
    - Rare but possible legitimate application persistence via Run keys
level: high
