title: Kerberos Pre-authentication Disabled for User
status: Developed
author: Amr Ashraf
date: 2024-12-01
description: |
    Detects when Kerberos pre-authentication is disabled for a user account, which can enable offline password cracking attacks such as AS-REP roasting. This behavior is typically malicious and should not occur in a secure environment.
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        EventID: 4738
        winlog.api: "wineventlog"
        Message|contains: "'Don't Require Preauth' - Enabled"
    condition: selection
fields:
    - EventID
    - SubjectUserName
    - TargetUserName
    - winlog.api
    - Message
falsepositives:
    - Administrators intentionally modifying user account settings for specific purposes.
    - Misconfigurations during Active Directory maintenance.
level: medium
tags:
    - attack.credential_access
    - attack.t1558
    - attack.t1558.004
    - attack.t1562
    - attack.defense_evasion
    - attack.t1078
    - attack.t1078.002
    - attack.privilege_escalation
