title: Linux Domain Group Enumeration
description: Detects commands used to enumerate domain groups on Linux.
status: Developed
author: Yuliya Volkova
date: 2024/11/12
modified: 2024/11/12
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    Commandline|contains|any:
      - "ldapdomaindump" 
      - "ldapsearch"
      - "ldapwhoami"
      - "getent passwd"
      - "getent group"
      - "wbinfo -u"
      - "wbinfo -g"
      - "net ads search"
  selection1:
    Commandline|contains|any:
      - "cat /etc/sssd/sssd.conf"
      - "cat /etc/nsswitch.conf"
      - "ls -la /etc/krb5.conf"
  condition: selection OR selection1 # Does not require exclusion at this point in time
fields:
  - Image
  - Commandline
  - User
  - Hostname
falsepositives:
  - Legitimate administrative queries by authorized users.
  - Routine configuration checks or system scripts.
level: medium
tags:
  - attack.account_discovery
  - attack.t1087.002
