title: Detect Clearing Logs Using PowerShell
status: Developed
description: Detects the use of `Clear-EventLog` PowerShell cmdlet to delete Windows Event Logs, which may indicate log tampering.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: script_block_logging
  product: windows
detection:
  selection_scriptblock:
    ScriptBlock|contains:
      - 'Clear-EventLog'
      - 'Get-EventLog'
  condition: selection_scriptblock
fields:
  - ScriptBlock
  - User
  - Hostname
falsepositives:
  - Legitimate log clearing by administrators as part of system maintenance.
level: high
tags:
  - attack.defense_evasion
  - attack.t1070.001
