title: HXP Base - Windows Failed Logon (4625)
id: HXP-BASE-WIN-FAILED-4625
status: test
description: |
  Detection Description:
  Base rule matching Windows Security failed logon events (EventID 4625). Intended for re-use by correlation rules.

  Status:
  test

  Data Sources:
  MITRE Data Source: Authentication Logs
  Product targeted by the Rule: Windows
  Service in the product that provides the log: Security

  Author:
  HXP Detection team
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/datasources/DS0028/
logsource:
  category: authentication
  product: windows
  service: security
detection:
  selection:
    EventID: 4625
  filter_machine_accounts:
    TargetUserName|endswith: '$'
  filter_anonymous:
    TargetUserName:
      - "ANONYMOUS LOGON"
  condition: selection and not filter_machine_accounts and not filter_anonymous
falsepositives:
  - User mistypes password
level: low
tags:
  - attack.t1110
