title: HXP Base - Linux SSH Authentication Success
id: HXP-BASE-LINUX-SSHD-SUCCESS
status: test
description: |
  Detection Description:
  Base rule matching Linux SSH (sshd) authentication successes. Intended for re-use by correlation rules.

  Status:
  test

  Data Sources:
  MITRE Data Source: Authentication Logs
  Product targeted by the Rule: Linux
  Service in the product that provides the log: auth

  Author:
  HXP Detection team
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/datasources/DS0028/
logsource:
  category: authentication
  product: linux
  service: auth
detection:
  selection_process:
    process.name: sshd
  selection_success:
    message|contains:
      - "Accepted password"
      - "Accepted publickey"
  condition: selection_process and selection_success
falsepositives:
  - Normal SSH logons
level: low
tags:
  - attack.t1078
