title: Suspicious Access to LSA Registry Secrets
description: Detects suspicious access to LSA secrets in the Windows registry, which could indicate an attempt to steal credentials.
status: Developed
author: Amr Ashraf
date: 2024/11/11
logsource:
  category: registry
  product: windows
detection:
  selection:
    EventID: 13
    TargetObject|contains:
      - 'SYSTEM\CurrentControlSet\Control\Lsa'
      - 'SECURITY\Policy\Secrets'
  filter_whitelist:
    Image|contains:
      - '\services.exe'
      - '\lsass.exe'
  condition: selection and not filter_whitelist
fields:
  - EventID
  - Key
  - ProcessName
  - AccountName
  - TargetUserSid
level: high
tags:
  - attack.credential_access
  - attack.t1003.003
falsepositives:
  - Legitimate administrative tools accessing LSA secrets for legitimate purposes.
