title: certutil download activity [medium]
status: test
description: certutil download activity
references:
    - Internal Research
tags:
    - attack.command_and_control
    - attack.t1105
author: Amr Ashraf
logsource:
    product: Windows
    category: process_execution
detection:
    selection:
        Image|contains: 
          - '\certutil'
        CommandLine|contains:
          - 'urlcache '
          - 'verifyctl '

    condition: selection
falsepositives:
    - unknown
level: medium

