title: Curl upload File Linux [medium]
status: test
description: 
references:
    - Internal Research
tags:
    - attack.command_and_control
    - attack.t1105
author: Amr Ashraf
logsource:
    product: linux
    category: process_execution
detection:
    selection:
        Image|contains: 
          - '\curl'
        CommandLine|contains:
          - '-T '
          - '--upload-file '
          - '-d '
          - '--data'
    condition: selection
falsepositives:
    - possible backup operation, may require tuning after deployment
level: medium


