title: rsync remote file copy [medium]
status: test
description: 
references:
    - Internal Research
tags:
    - attack.command_and_control
    - attack.t1105
author: Amr Ashraf
logsource:
    product: Linux
    category: process_execution
detection:
    selection:
        CommandLine|contains|all:  # object field in LR
          - 'rsync ' # Space is imprtant
          - ' -r ' 
    filter:
        CommandLine|contains: # Object field in LR
          - 'command_start_' # nessus behavior
    condition: selection
falsepositives:
    - VA activities
level: medium

