title: Curl Download File Windows [medium]
status: test
description: 
references:
    - Internal Research
tags:
    - attack.command_and_control
    - attack.t1105
author: Amr Ashraf
logsource:
    product: Windows
    category: process_execution
detection:
    selection:
        Image|contains: 
          - '\curl'
        CommandLine|contains:
          - '-o '
    condition: selection
falsepositives:
    - possible backup operation, may require tuning after deployment
level: medium


