title: certutil from suspicious parent [medium]
status: test
description: 
references:
    - Internal Research
tags:
    - attack.command_and_control
    - attack.t1105
author: Amr Ashraf
logsource:
    product: Windows
    category: process_execution
detection:
    selection:
        Image|contains: 
          - '\certutil'
        ParentImage|contains:
          - 'cmd.exe'
          - 'powershell.exe'
          - 'pwsh.exe'
          - 'wscript.exe'
          - 'cscript.exe'
          - 'hh.exe'
          - 'mshta.exe'   
    condition: selection
falsepositives:
    - unknown
level: medium

