title: Linux Download File and Run [medium]
status: test
description: 
references:
    - Internal Research
tags:
    - attack.command_and_control
    - attack.t1105
author: Amr Ashraf
logsource:
    product: Linux
    category: process_execution
detection:
    selection:
      Image|contains:
        - 'curl '
      CommandLine|contains:
          - 'bash '
          - '|'
    condition: selection
falsepositives:
    - 
level: medium


