title: PowerShell Download [medium]
status: test
description: 
references:
    - Internal Research
tags:
    - attack.command_and_control
    - attack.t1105
author: Amr Ashraf
logsource:
    product: Windows
    category: process_execution
detection:
    selection:
        Image|contains: 
          - '\powershell'
          - '\pwsh'
        CommandLine|contains:
          - '.webclient'
          - '.downloadfile'
          - 'iwr '
          - 'invoke-webrequest'
    condition: selection
falsepositives:
    - unknown
level: medium

