title: Domain Account and Group Manipulate - PRE-008-E-000-0002
id: PRE-008-E-000-0002
status: experimental
description: |
  Detection Description:
  Detects Domain Account and Group Manipulate.
  
  Status:
  experimental
  
  Threat Mapping:
  MITRE ATT&CK Technique(s): T1098 – Account Manipulation
  Kill Chain Phase: Privilege Escalation
  
  Data Sources:
  MITRE Data Source: Active Directory: Active Directory Object Modification
  Product targeted by the Rule: Active Directory
  Service in the product that provides the log: Security
  
  Detection Logic:
  See Sigma detection section.
  
  False Positive Considerations:
  See falsepositives section.
  
  Severity and Risk Rating:
  Severity Level: High
  
  References:
  See references section.
  
  Author:
  HXP Detection team
  
  Use Case Sheet Details:
  - L3 use cases per L2: 5
  - L1 Use Case Name: Privilege Escalation
  - L1 Use Case Identifier: PRE
  - L2 Use Case Name: Account Privileges Manipulation
  - L2 Use Case Identifier: PRE-008
  - Rule Identifier: PRE-008-E-000-0002
  - Technical Use Case Name: Domain Account and Group Manipulate
  - Use Case Description:
  - Log source type: Active Directory
  - Detection Technology: SIEM
  - Scope: All assets
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/techniques/T1098/
tags:
  - attack.privilege_escalation
  - attack.t1098
logsource:
  category: group_management
  product: windows
  service: security
detection:
\
          selection:
            EventID:
              - 4720   # user created
              - 4722   # user enabled
              - 4725   # user disabled
              - 4726   # user deleted
              - 4738   # user changed
              - 4727   # security-enabled global group created
              - 4730   # security-enabled global group deleted
              - 4735   # security-enabled local group changed
              - 4737   # security-enabled global group changed
          condition: selection
falsepositives:
  - Legitimate group membership changes by IT administration
  - Automated identity provisioning / IGA processes
level: high
