title: Windows User Added to VPN Users Group - PRE-005-E-000-0005
id: PRE-005-E-000-0005
status: experimental
description: |
  Detection Description:
  Detects Windows User Added to VPN Users Group.
  
  Status:
  experimental
  
  Threat Mapping:
  MITRE ATT&CK Technique(s): T1098 – Account Manipulation
  Kill Chain Phase: Privilege Escalation
  
  Data Sources:
  MITRE Data Source: Active Directory: Active Directory Object Modification
  Product targeted by the Rule: Active Directory
  Service in the product that provides the log: Security
  
  Detection Logic:
  See Sigma detection section.
  
  False Positive Considerations:
  See falsepositives section.
  
  Severity and Risk Rating:
  Severity Level: High
  
  References:
  See references section.
  
  Author:
  HXP Detection team
  
  Use Case Sheet Details:
  - L3 use cases per L2: 6
  - L1 Use Case Name: Privilege Escalation
  - L1 Use Case Identifier: PRE
  - L2 Use Case Name: Local or Remote Admin Privilege Upgrade
  - L2 Use Case Identifier: PRE-005
  - Rule Identifier: PRE-005-E-000-0005
  - Technical Use Case Name: Windows User Added to VPN Users Group
  - Use Case Description:
  - Log source type: Active Directory
  - Detection Technology: SIEM
  - Scope: All assets
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/techniques/T1098/
tags:
  - attack.privilege_escalation
  - attack.t1098
logsource:
  category: group_management
  product: windows
  service: security
detection:
selection:
  EventID:
    - 4728
    - 4732
    - 4756
group_name_1:
  TargetUserName|contains:
    - 'VPN Users'
group_name_2:
  GroupName|contains:
    - 'VPN Users'
condition: selection and (group_name_1 or group_name_2)
falsepositives:
  - Legitimate group membership changes by IT administration
  - Automated identity provisioning / IGA processes
level: high
