title: Detect UDP Scan [aggregation]
description: Detects UDP scanning by monitoring for high volumes of ICMP Destination Unreachable responses, indicative of closed UDP ports being probed.
status: Developed
author: Amr Ashraf
date: 2024/11/03
logsource:
  category: firewall
  product: any
detection:
  selection:
    protocol: icmp
    icmp_type: "Destination Unreachable"
  condition: selection | count() by source_ip > 30 within 1m
fields:
  - source_ip
  - dest_ip
  - protocol
  - icmp_type
falsepositives:
  - Network misconfigurations or high ICMP traffic from diagnostics tools
level: medium
tags:
  - attack.reconnaissance
  - attack.t1046
