title: Detect Suspicious WMI Activity
status: Experimental
description: Detects suspicious Windows Management Instrumentation (WMI) activity that may indicate discovery, lateral movement, or execution.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - EventID: 4688
    - NewProcessName|endswith:
        - '\wmic.exe'
        - '\wmiprvse.exe'
        - '\winmgmt.exe'
      CommandLine|contains|re:
        - ' /node:'
        - ' /user:'
        - ' process *call *create'
        - ' path *win32_process'
        - ' call *create'
  condition: selection
fields:
  - Image
  - CommandLine
  - ParentImage
  - User
  - Hostname
  - ProcessId
  - ParentProcessId
level: medium
tags:
  - attack.execution
  - attack.lateral_movement
  - attack.discovery
  - t1047
  - t1569.002
  - t1028
falsepositives:
  - Legitimate administrative WMI usage for IT management
  - Scheduled tasks invoking WMI for monitoring purposes
VQL:
  LET ID_1343 = (
    (NewProcessName =~ "\\wmic\\.exe$" OR NewProcessName =~ "\\wmiprvse\\.exe$" OR NewProcessName =~ "\\winmgmt\\.exe$") AND
    CommandLine =~ "(?=.*\\/node:|.*\\/user:|.*process\\s*\\*call\\s*\\*create|.*path\\s*\\*win32_process|.*call\\s*\\*create)"
  )
