title: Detect WMI Rundll32 Execution
status: Experimental
description: Detects the use of WMI to execute a DLL function via rundll32.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    CommandLine|contains|all:
      - 'wmic '
      - '/node:'
      - 'rundll32.exe'
  condition: selection
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
falsepositives:
  - Legitimate administrative tasks
level: high
tags:
  - attack.execution
  - attack.t1218.011
VQL:
  LET ID_1453 = (
    CommandLine =~ "(?=.*wmic |.*/node:|.*rundll32\\.exe)"
  )
