title: Detect Kerberoasting Using Honeypot User Account
description: Detects potential Kerberoasting attempts by monitoring for service ticket requests (TGS) made for a known honeypot user account.
status: Experimental
author: Amr Ashraf
date: 2024/11/11
logsource:
  category: kerberos
  product: windows
detection:
  selection:
    EventID: 4769  # TGS Request Event
    ServiceAccount: 'HoneypotUser'  # The specific honeypot user account name
  condition: selection
fields:
  - EventID
  - ServiceAccount
  - AccountName
  - ClientAddress
  - TicketOptions
  - TargetDomainName
level: high
tags:
  - attack.kerberoasting
  - attack.t1203
falsepositives:
  - Legitimate service accounts or administrators requesting service tickets for the honeypot user.
  - Misconfigured systems that use the honeypot user for legitimate purposes.
