title: Detection of LDAP Queries for Honeypot Certificate
description: Detects LDAP queries for a honeypot certificate, which could indicate an attempt to interact with or misuse the certificate for malicious purposes.
status: Experimental
author: Amr Ashraf
logsource:
  category: network_traffic
  product: windows
detection:
  selection:
    Protocol: 'LDAP'
    Query:
      - 'honeypot.local'  # Replace with your honeypot certificate name
  condition: selection
fields:
  - Protocol
  - SourceIP
  - DestinationIP
  - Query
  - AccountName
  - ObjectName
level: high
tags:
  - attack.mitm
  - attack.credential_access
falsepositives:
  - Legitimate administrative requests or testing queries from authorized users.
