title: Credential Dumping by Pypykatz
status: test
description: Detects LSASS process access by pypykatz for credential dumping.
references:
    - https://github.com/skelsec/pypykatz
tags:
    - attack.credential_access
    - attack.t1003.001
author: Amr Ashraf
logsource:
    category: process_access (EID 10)
    service: sysmon
    product: windows
detection:
    selection:
        TargetImage|endswith: '\lsass.exe'
        CallTrace|contains|all:
            - 'C:\Windows\SYSTEM32\ntdll.dll+'
            - 'C:\Windows\System32\KERNELBASE.dll+'
            - 'libffi-7.dll'
            - '_ctypes.pyd+'
            - 'python3*.dll+'   # Pypy requires python>=3.6
        GrantedAccess: '0x1FFFFF'
    condition: selection
falsepositives:
    - Unknown
level: critical

