title: PowerShell Create Local User
status: test
description: Detects creation of a local user via PowerShell
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1136.001/T1136.001.md
tags:
    - attack.execution
    - attack.t1059.001
    - attack.persistence
    - attack.t1136.001
author: Amr Ashraf
logsource:
    product: windows
    category: Procewss_creation
detection:
    selection:
        Image|contains: 'New-LocalUser'
    condition: selection
falsepositives:
    - Legitimate user creation
level: medium

