title: PowerShell with a url in commandline [medium]
status: test
description: Detects Suspicious commands from powershell with urls.
tags:
    - attack.execution
    - attack.t1059.001
author: Amr Ashraf
logsource:
    product: windows
    category: process_creation
detection:
    selection:
      Image|contains: 
        - \powershell.exe
        - \pwsh.exe # PowerShell v6
        - \powershell_ise.exe # Development GUI
      CommandLine|contains:
        - ' http' # space before is importent to avoid FP with httpd directory
    filter:
      CommandLine|contains:
        - 'nessus'
        - 'amazonaws.com'
    condition: selection
falsepositives:
    - Scripting download or upload
level: medium

