title: PowerView PowerShell attack framework [high]
status: test
description: detects PowerView PowerShell attack framework, popular PowerShell framework
references:
    - https://adsecurity.org/?p=2921
tags:
    - attack.execution
    - attack.t1059.001
author: Amr Ashraf
logsource:
    product: windows
    category: process_execution
detection:
    selection:
      CommandLine|contains:
          - Get-NetUser
          - Get-NetGroup
          - Get-NetGroupMember
          - Get-NetLocalGroup
          - Get-NetSession
          - Invoke-UserHunter
          - Get-NetOU
          - Find-GPOLocation
          - Get-NetGPOGroup
          - Get-ObjectACL
          - Add-ObjectACL
          - Invoke-ACLScanner
          - Set-ADObject
          - Invoke-DowngradeAccount
          - Get-NetForest
          - Get-NetForestTrust
          - Get-NetForestDomain
          - Get-NetDomainTrust
          - Get-MapDomainTrust
    condition: selection
falsepositives:
    - unknown 
level: high

