title: Suspicious PowerShell Invocations - Generic
status: test
description: Detects suspicious PowerShell invocation command parameters
references:
    - Internal Research
tags:
    - attack.execution
    - attack.t1059.001
author: Amr Ashraf
logsource:
    product: windows
    category: Process_creation
detection:
    selection_encoded:
        Image|contains:
            - ' -enc '
            - ' -EncodedCommand '
            - ' -ec '
    selection_hidden:
        Image|contains:
            - ' -w hidden '
            - ' -window hidden '
            - ' -windowstyle hidden '
            - ' -w 1 '
    selection_noninteractive:
        Image|contains:
            - ' -noni '
            - ' -noninteractive '
    condition: all of selection*
falsepositives:
    - Very special PowerShell scripts
level: high

