title: Detect Script Execution from Temporary Directories
status: Developed
description: Detects the execution of scripts located in temporary directories such as /tmp, which is common in malicious activities.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    CommandLine|contains|all:
      - '/tmp/'
      - 'bash'
  condition: selection
fields:
  - CommandLine
  - User
  - ParentImage
  - Image
  - Hostname
falsepositives:
  - Temporary scripts used in legitimate system administration tasks.
level: high
tags:
  - attack.execution
  - attack.persistence
  - attack.t1059.004
