title: Detect Copying Files Over Administrative Shares
status: Developed
description: Detects the use of the `copy` command to access sensitive files over administrative shares, such as `C$`, which may indicate lateral movement or data exfiltration attempts.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection_copy_admin_share:
    EventID: 4688
    CommandLine|contains|all:
      - ' copy '
      - '\\'
      - 'C$'
  selection_copy_admin_share1:
    EventID: 4688
    CommandLine|contains|all:
      - ' cp '
      - '\\'
      - 'C$'
  condition: selection_copy_admin_share or selection_copy_admin_share1
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate administrative tasks copying files for maintenance or troubleshooting
  - Authorized scripts or software accessing files via administrative shares
level: critical
tags:
  - attack.exfiltration
  - attack.lateral_movement
  - attack.t1105
  - attack.t1021
