title: Detect Network Share Mapping via New-PSDrive
status: Developed
description: Detects the use of PowerShell's `New-PSDrive` command to map a network share, which may indicate lateral movement or unauthorized access attempts.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith|any:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains|all|re:
      - 'New-PSDrive'
      - '-PSProvider *filesystem'
      - '-Root *\\'
  condition: selection
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate administrative tasks or scripts mapping network drives
  - Automation tools performing authorized network operations
level: high
tags:
  - attack.lateral_movement
  - attack.credential_access
  - attack.t1077
  - attack.t1021
VQL:
  LET ID_1413 = (
    (NewProcessName =~ "\\powershell\\.exe$" OR NewProcessName =~ "\\pwsh\\.exe$") AND
    CommandLine =~ "(?=.*New-PSDrive)(?=.*-PSProvider.*filesystem)(?=.*-Root.*\\\\)"
  )
