title: Mounting Windows Hidden Shares with net
status: Developed
description: Detects the use of `net.exe` or `net1.exe` to mount hidden Windows Admin network shares, which can indicate lateral movement or reconnaissance.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - EventID: 4688
    - NewProcessName:
        - 'net.exe'
        - 'net1.exe'
    - CommandLine|contains|re:
        - 'use *\\*\$'
        - 'use *\\*/$'
  filter:
      ParentProcessName|contains: 'net.exe'
  condition: selection and not filter
fields:
  - NewProcessName
  - CommandLine
  - CreatorProcessName
level: medium
tags:
  - attack.lateral_movement
  - t1077
falsepositives:
  - Legitimate administrative tasks mounting hidden admin shares
  - Authorized IT operations or scripts
VQL:
  LET ID_1279 = (
    (NewProcessName =~ "net\\.exe$" OR NewProcessName =~ "net1\\.exe$") AND
    CommandLine =~ "(?=.*use.*\\\\.*\\$|.*use.*\\\\.*\\/\\$)" AND
    NOT ParentProcessName =~ "net\\.exe$"
  )
