title: Detect PsExec-like Activity for File Copy and Execution
status: Experimental
description: Detects suspicious activity resembling PsExec usage for copying and executing files on remote hosts, focusing on behavior instead of executable name.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    CommandLine|contains:
      - '-accepteula'
      - '-c'
  selection1:
    CommandLine|contains:
      - '\\'
      - '-s'
      - '-u'
  condition: selection and selection1
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate administrative tasks or authorized remote management scripts
  - Automation tools for software deployment
level: high
tags:
  - attack.execution
  - attack.lateral_movement
  - attack.t1570
  - attack.t1021
VQL: |
  LET ID_1415 = (
      CommandLine =~ "(?=.*-accepteula.*-c)" AND
      CommandLine =~ "(?=.*\\\\|.*-s|.*-u)"
  )
