# "don't deploy"
title: Incoming Remote PowerShell Sessions
status: Developed
description: Detects incoming lateral movement via Windows Remote Management (WinRM), characterized by incoming network connections to WinRM ports and subsequent execution of `wsmprovhost.exe`.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  timeframe: 2s
  selection:
    network_activity:
      - Subtype: "incoming"
        DestinationPort:
          - 5985
          - 5986
    process_activity:
      - ProcessName: "wsmprovhost.exe"
        ParentProcessName: "svchost.exe"
  condition: network_activity followed by process_activity
fields:
  - DestinationIP
  - DestinationPort
  - SourceIP
  - ProcessName
  - ParentProcessName
  - CommandLine
  - User
  - Hostname
level: high
tags:
  - attack.lateral_movement
  - attack.execution
  - t1028
falsepositives:
  - Legitimate administrative use of PowerShell remoting via WinRM
  - Authorized IT operations leveraging WinRM