title: Detect Remote Command Execution with Output to Admin Share
status: Developed
description: Detects suspicious command execution where output is redirected to an administrative share, such as `ADMIN$`, which may indicate lateral movement or data exfiltration attempts.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    CommandLine|contains|all:
      - '/c'
      - '\\'
      - \ADMIN$'
  selection1:
    CommandLine|contains:
      - '1>'
      - '2>&1'
  condition: selection and selection1
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate administrative scripts or tools redirecting output to a local share
  - System management or monitoring tools performing authorized operations
level: critical
tags:
  - attack.lateral_movement
  - attack.execution
  - attack.t1570
  - attack.t1021
VQL: |
  LET ID_1416 = (
      CommandLine =~ "(?=.*\\/c.*\\\\.*ADMIN\\$)" AND
      CommandLine =~ "(?=.*1>|.*2>&1)"
  )
