title: Detect RDP User Authentication Disabling via Registry Modification
status: Developed
description: Detects modifications to the `UserAuthentication` registry value under the RDP-Tcp key. Disabling this setting can weaken RDP security and may indicate an attempt to configure unauthorized remote access.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: registry
  product: windows
detection:
  selection:
    EventID: 4657
    ObjectName|contains: 'HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Terminal Server\WinStations\RDP-Tcp'
    ObjectValueName: 'UserAuthentication'
    NewValue: '0'
  condition: selection
fields:
  - EventID
  - ObjectName
  - ObjectValueName
  - RegistryValueData
  - User
  - Computer
  - LogonID
falsepositives:
  - Legitimate administrative actions disabling RDP User Authentication for troubleshooting
  - Automated scripts modifying RDP settings in controlled environments
level: critical
tags:
  - attack.persistence
  - attack.lateral_movement
  - attack.t1562
  - attack.t1021

#need to verify the logs being received on SIEM