title: Detect Enabling PowerShell Remoting (Script Block Logging)
status: Experimental
description: Detects the use of `Enable-PSRemoting` to enable PowerShell remoting, captured via script block logging. This activity may indicate attempts to configure remote access or facilitate lateral movement.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: script
  product: windows
detection:
  selection:
    EventID: 4104
    ScriptBlockText|contains|all:
      - 'Enable-PSRemoting'
      - '-Force'
  condition: selection
fields:
  - EventID
  - ScriptBlockText
  - UserID
  - Computer
  - LogonID
falsepositives:
  - Legitimate administrative tasks configuring PowerShell remoting
  - Authorized scripts enabling PSRemoting for operational purposes
level: high
tags:
  - attack.execution
  - attack.lateral_movement
  - attack.t1021
  - attack.t1569
