title: Detect Network Share Mapping via New-PSDrive (Script Block Logging)
status: Developed
description: Detects PowerShell script blocks that use the `New-PSDrive` command to map a network share. This activity may indicate lateral movement or unauthorized access attempts.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: script
  product: windows
detection:
  selection:
    EventID: 4104
    ScriptBlockText|contains|all|re:
      - 'New-PSDrive'
      - '-PSProvider *filesystem'
      - '-Root *\\'
  condition: selection
fields:
  - EventID
  - ScriptBlockText
  - UserID
  - Computer
  - LogonID
falsepositives:
  - Legitimate administrative tasks or scripts mapping network drives
  - Authorized automation tools performing network operations
level: high
tags:
  - attack.lateral_movement
  - attack.credential_access
  - attack.t1077
  - attack.t1021
