# Needs FP testing
title: EVTX Created In Uncommon Location
description: |
    Detects the creation of new files with the ".evtx" extension in non-common or non-standard location.
    This could indicate tampering with default EVTX locations in order to evade security controls or simply exfiltration of event log to search for sensitive information within.
    Note that backup software and legitimate administrator might perform similar actions during troubleshooting.
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.defense-evasion
    - attack.t1562.002
    - sysmon
logsource:
    category: file_event
    product: windows
detection:
    selection_file_event:
        EventID: 11
        TargetFileName|endswith: .evtx
    filter_main_baseimage:
        TargetFilename|startswith: C:\ProgramData\Microsoft\Windows\Containers\BaseImages\
        TargetFilename|endswith: \Windows\System32\winevt\Logs\
        TargetFilename|contains: \temp\
    condition: file_event and (selection and not 1 of filter_main_*)
falsepositives:
    - Administrator or backup activity
    - An unknown bug seems to trigger the Windows "svchost" process to drop EVTX files in the "C:\Windows\Temp" directory in the form "<log_name">_<uuid>.evtx". See https://superuser.com/questions/1371229/low-disk-space-after-filling-up-c-windows-temp-with-evtx-and-txt-files
level: medium