title: Domain Trust Discovery
status: Developed
description: Detects commands used to enumerate a list of trusted domains, including the use of dsquery.exe and nltest.exe.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - ProcessName: "dsquery.exe"
      CommandLine|contains: "(objectClass=trustedDomain)"
    - ProcessName: "nltest.exe"
      CommandLine|contains: "domain_trusts"
  condition: selection
fields:
  - ProcessName
  - CommandLine
  - ParentProcessName
  - ProcessPath
  - User
  - Hostname
level: medium
tags:
  - attack.discovery
  - t1482
falsepositives:
  - Legitimate administrative tasks querying domain trusts