title: Detect Possible  Active Directory Enumeration
status: Developed
description: Detects the execution of AdFind.exe to enumerate Active Directory objects, such as subnets. AdFind.exe is a known tool used by attackers during reconnaissance.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    CommandLine|contains|all:
      - "-f"
      - "(objectcategory=subnet)"
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate administrative use for Active Directory queries
  - Security assessments or penetration tests conducted with authorization
level: high
tags:
  - attack.discovery
  - attack.t1018
  - attack.t1087
