title: Detect Vaultcmd.exe Credential Listing
status: Developed
description: Detects the use of vaultcmd.exe with the /list argument, which enumerates stored credentials in the Windows Credential Vault. This could indicate an attempt to access sensitive credentials.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ProcessName: "vaultcmd.exe"
    CommandLine|contains: "/list"
  condition: selection
fields:
  - ProcessName
  - CommandLine
  - ParentImage
  - User
  - Hostname
level: medium
tags:
  - attack.credential_access
  - attack.discovery
  - t1003.001
falsepositives:
  - Legitimate administrative tasks by authorized users
  - Automated credential management scripts
