title: Detect Email Account Enumeration via Exchange
id: detect-email-account-enumeration-exchange
status: Developed
description: Detects email account enumeration using Exchange commands or APIs, such as `Get-GlobalAddressList`.
author: Amr Ashraf
logsource:
  category: exchange
  product: windows
detection:
  selection:
    CommandLine|contains: 
      - 'Get-GlobalAddressList'
      - 'Get-AddressList'
      - 'Export-AddressList'
  condition: selection
fields:
  - CommandLine
  - User
  - ComputerName
  - SessionId
level: medium
tags:
  - attack.discovery
  - t1087
falsepositives:
  - Legitimate administrative tasks
