title: PowerShell Logging Disabled Via Registry Key Tampering
description: Detects changes to the registry for the currently logged-in user. In order to disable PowerShell module logging, script block logging or transcription and script execution logging
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.defense-evasion
    - attack.t1564.001
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|contains:
            - \Microsoft\Windows\PowerShell\
            - \Microsoft\PowerShellCore\
        ObjectName|endswith:
            - \ModuleLogging\EnableModuleLogging
            - \ScriptBlockLogging\EnableScriptBlockLogging
            - \ScriptBlockLogging\EnableScriptBlockInvocationLogging
            - \Transcription\EnableTranscripting
            - \Transcription\EnableInvocationHeader
            - \EnableScripts
        NewValue: DWORD (0x00000000)
    condition: registry_set and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
