title: Detect Windows Defender Disabling Using PS
id: detect-windows-defender-disabling
status: Developed
description: Detects attempts to disable Windows Defender through PowerShell or registry changes.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image: '*\powershell.exe'
    CommandLine:
      - '*Set-MpPreference*DisableRealtimeMonitoring*True*'
      - '*Stop-Service*WinDefend*'
  condition: selection
fields:
  - Image
  - CommandLine
  - User
level: high
tags:
  - attack.defense_evasion
  - attack.t1562.001
falsepositives:
  - Legitimate administrative actions
