title: Detection of Lateral Movement via SMB Shares
description: Detects suspicious SMB share access across multiple machines, potentially indicating lateral movement by an attacker.
status: Developed
author: Amr Ashraf
date: 2024/11/11
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    EventID: 5140  # Network share object was accessed
    ShareName: 
      - 'C$'
      - 'ADMIN$'
      - 'IPC$'
  condition: selection
fields:
  - EventID
  - ShareName
  - SourceIP
  - TargetDomainName
  - TargetUserName
level: high
tags:
  - attack.lateral_movement
  - attack.t1075
  - attack.t1021.002
falsepositives:
  - Legitimate administrative or support tools accessing shares.
