title: Default Account Logins Failed [medium]
status: test
description: Detects logins failed for default Windows accounts (Guest, DefaultAccount).
author: Amr Ashraf
date: 2025-03-28
references:
    - https://attack.mitre.org/techniques/T1078/001/ # Default Accounts Abuse
logsource:
    category: windows
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4625 
        TargetUserName:
            - 'Guest'
            - 'DefaultAccount'
    condition: selection
falsepositives:
    - Legitimate logins by IT administrators or system tasks
level: medium
tags:
    - attack.persistence
    - attack.t1078.001
    - attack.initial_access

