title: Default Account Added to Privileged Groups via WMIC [high]
status: test
description: Detects use of WMIC to add the Guest account to privileged groups (Administrators or Remote Desktop Users), commonly used for privilege escalation or persistence.
author: Amr Ashraf
date: 2025-03-28
references:
    - https://attack.mitre.org/techniques/T1078/001/
    - https://attack.mitre.org/techniques/T1098/
    - https://attack.mitre.org/techniques/T1136/001/
logsource:
    category: Command Execution
    product: windows
detection:
    selection:
        Image|endswith:
            - '\wmic.exe'
        CommandLine|contains|all:
            - 'group'
            - 'call'
            - 'add'
    default_accounts:
        CommandLine|contains:
            - 'Guest'
            - 'DefaultAccount'
            - 'Administrator'  
    target_group:
        CommandLine|contains:
            - 'Remote Desktop Users'
            - 'Administrators'
    condition: selection and target_group and default_accounts
falsepositives:
    - Extremely rare in modern environments; might appear in lab or test scenarios
level: high
tags:
    - attack.privilege_escalation
    - attack.persistence
    - attack.t1078.001
    - attack.t1098
    - attack.t1136.001
