title: Default Account Added to Privileged Groups via WMI [high]
status: test
description: Detects the use of WMI to add the Guest account to privileged groups (Administrators or Remote Desktop Users), which may indicate privilege escalation or persistence.
author: Amr Ashraf
date: 2025-03-28
references:
  - https://attack.mitre.org/techniques/T1078/001/
  - https://attack.mitre.org/techniques/T1098/
  - https://attack.mitre.org/techniques/T1136/001/
logsource:
  category: Process Creation
  product: windows
detection:
  selection:
      CommandLine|contains|all:
        - 'Get-WmiObject'
        - 'Win32_Group'
        - 'InvokeMethod("Add"'
        - 'Win32_UserAccount'
  default_accounts:
      CommandLine|contains:
          - 'Guest'
          - 'DefaultAccount'
          - 'Administrator'
  target_group:  
      CommandLine|contains:
        - 'Administrators'
        - 'Remote Desktop Users'
  condition: selection and default_accounts and target_group
falsepositives:
  - Rare legitimate administrative or legacy scripting use
level: high
tags:
  - attack.privilege_escalation
  - attack.persistence
  - attack.t1078.001
  - attack.t1098
  - attack.t1136.001
