title: Default Account Logins Successful [high]
status: test
description: Detects logins successful for default Windows accounts (Guest, DefaultAccount).
author: Amr Ashraf
date: 2025-03-28
references:
    - https://attack.mitre.org/techniques/T1078/001/ # Default Accounts Abuse
logsource:
    category: User Account Authentication
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4624  
        TargetUserName:
            - 'Guest'
            - 'DefaultAccount'
    condition: selection
falsepositives:
    - Legitimate logins by IT administrators or system tasks
level: high
tags:
    - attack.persistence
    - attack.t1078.001
    - attack.initial_access

