title: Enable Default Windows Accounts via WMI [high]
status: test
description: Detects enabling of default Windows accounts (Guest, Administrator, DefaultAccount) using WMI by modifying the Disable property.
author: Amr Ashraf
date: 2025-03-28
references:
    - https://attack.mitre.org/techniques/T1078/001/ # Default Accounts Abuse
logsource:
    category: Process Creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - 'Get-WmiObject'
            - 'Win32_UserAccount'
            - 'Disable'
            - '$false'
    accounts:
        CommandLine|contains:
            - 'Guest'
            - 'Administrator'
            - 'DefaultAccount'
    condition: selection and accounts
falsepositives:
    - Legitimate admin tasks involving re-enabling built-in accounts
level: high
tags:
    - attack.initial_access
    - attack.t1078.001
    - attack.persistence
    - attack.t1098
