title: Default Account Added to Privileged Groups via Net [high]
status: test
description: Detects the addition of the Guest account to privileged groups (Administrators or Remote Desktop Users) using net.exe, indicating potential privilege escalation or persistence.
author: Amr Ashraf
date: 2025-03-28
references:
    - https://attack.mitre.org/techniques/T1078/001/
    - https://attack.mitre.org/techniques/T1098/
    - https://attack.mitre.org/techniques/T1136/001/
logsource:
    category: Command Execution
    product: windows
detection:
    selection:
        Image|endswith:
            - '\net.exe'
            - '\net1.exe'
        CommandLine|contains|all:
            - 'localgroup'
            - '/add'
    default_accounts:
        CommandLine|contains:
            - 'Guest'
            - 'DefaultAccount'
            - 'Administrator'    
    target_group:
        CommandLine|contains:
            - 'Administrators'
            - 'Remote Desktop Users'
    condition: selection and target_group and default_accounts
falsepositives:
    - Rare legitimate configuration for legacy or testing environments
level: high
tags:
    - attack.privilege_escalation
    - attack.persistence
    - attack.initial_access
    - attack.t1078.001
    - attack.t1098
    - attack.t1136.001
