title: Enable Default Windows Accounts via PowerShell [high]
status: test
description: Detects the activation of default Windows accounts (Guest, Administrator, DefaultAccount) using PowerShell.
author: Amr Ashraf
date: 2025-03-28
references:
    - https://attack.mitre.org/techniques/T1078/001/ # Default Accounts Abuse
logsource:
    category: Command Execution
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - 'Set-LocalUser'
            - '-Enabled'
            - '$true'
    accounts:
            - 'Guest'
            - 'Administrator'
            - 'DefaultAccount'
    condition: selection and accounts
falsepositives:
    - Legitimate system administration activity
level: high
tags:
    - attack.persistence
    - attack.initial_access
    - attack.t1078.001
    - attack.t1098
