title: Detect Zipping of Files for Staging
status: Developed
description: Detects the use of PowerShell to zip files or folders and stage them, which may indicate data staging for exfiltration.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    CommandLine|contains:
      - 'Compress-Archive'
    NewProcessName|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - User
  - FileName
falsepositives:
  - Legitimate use of PowerShell to compress files for administrative or backup purposes.
level: medium
tags:
  - attack.collection
  - attack.t1074.001
