title: Detect Zipping of Files for Staging via Script Block Logging
status: Experimental
description: Detects the use of PowerShell script block logging to identify attempts to zip files or folders, which may indicate data staging for exfiltration.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: script_block_logging
  Platform: windows
  log_source: PowerShell Operational.evtx
detection:
  selection:
    EventID: 4104
    ScriptBlock|contains:
      - 'Compress-Archive'
  condition: selection
fields:
  - ScriptBlock
  - User
  - HostName
  - ProcessId
falsepositives:
  - Legitimate administrative or backup operations involving the compression of files using PowerShell.
level: medium
tags:
  - attack.collection
  - attack.t1074.001
  - attack.t1560.001
triage:
  - Investigate the user account that executed the command to determine if it is expected behavior.
  - Check the parent process to see if it is a legitimate administrative task.
  - Review the command line arguments for any unusual or suspicious file paths.
  - Correlate with other alerts or logs to identify potential data exfiltration activities.
