title: Suspicious DPAPI Backup Master Key Access
description: Detects suspicious activity involving DPAPI to retrieve the backup master key on domain-joined machines, which could be used to decrypt secrets across all domain-joined devices.
status: experimental
author: Amr Ashraf
date: 2024/11/12
logsource:
  product: windows
  category: directory_service
detection:
  selection:
    EventID: 4662
    ObjectType: "msDS-ManagedPassword"
    AccessMask:
  condition: selection
fields:
  - EventID
  - ObjectName
  - AccessMask
  - SubjectUserName
  - SubjectUserSid
  - ComputerName
level: high
tags:
  - attack.credential_access
  - attack.t1552.002
falsepositives:
  - Legitimate administrative access to DPAPI backup keys
