title: Suspicious BITSAdmin Command Execution [high]
status: test
description: Detects execution of BITSAdmin commands commonly abused by threat actors for malicious purposes, such as malware download, persistence, and data exfiltration.
author: Amr Ashraf
date: 2025-03-28
references:
    - https://attack.mitre.org/techniques/T1197/
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\bitsadmin.exe'
        CommandLine|contains:
            - 'transfer'
            - 'create'
            - 'addfile'
            - 'setnotifyflags'
            - 'setnotifycmdline'
            - 'setminretrydelay'
            - 'setcustomheaders'
            - 'resume'
    condition: selection
falsepositives:
    - Legitimate administrative use of BITSAdmin.
    - Software update mechanisms using BITS.
level: high
tags:
    - attack.execution
    - attack.persistence
    - attack.t1197
