title: Detect Linux Kernel Module Loading
status: Developed
description: Detects commands used to load kernel modules on Linux.
author: Amr Ashraf
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    CommandLine|contains:
      - 'insmod'
      - 'modprobe'
      - 'rmmod'
    Image|endswith:
      - '/sbin/insmod'
      - '/sbin/modprobe'
  condition: selection
fields:
  - CommandLine
  - Image
  - User
  - Hostname
level: high
tags:
  - attack.persistence
  - attack.privilege_escalation
  - t1547.006
falsepositives:
  - Legitimate module management by administrators
