title: Modifications of bash_profile and bashrc
status: Developed
description: Detects modifications to `.bash_profile` and `.bashrc` files, which adversaries can use to execute persistent commands upon user login.
author: Amr Ashraf
logsource:
  category: file_event
  product: unix
detection:
  selection:
    - Subtype: "modify"
      FileName:
        - ".bash_profile"
        - ".bashrc"
  condition: selection
fields:
  - FileName
  - FilePath
  - User
  - Hostname
  - Action
level: medium
tags:
  - attack.persistence
  - t1156
falsepositives:
  - Legitimate user changes to `.bash_profile` or `.bashrc` for customization
  - Authorized IT or administrative updates