title: CRA-E-0002 Unauthorized LSASS Memory Access Attempts for Credential Dumping
description: Identifies suspicious access attempts to lsass.exe memory, which may indicate credential dumping activities.
references:
  - https://medium.com/threatpunter/detecting-attempts-to-steal-passwords-from-memory-558f16dce4ea
  - https://github.com/trustedsec/SysmonCommunityGuide/blob/master/chapters/process-access.md
  - https://threathunterplaybook.com/hunts/windows/170105-LSASSMemoryReadAccess/notebook.html
status: Developed
author: Shahbaz Ahmad
date: 10/11/2024
logsource:
  product: windows
  category: process_access
detection:
  selection:
    EventID: 10
    TargetImage|endswith: '\lsass.exe'
    GrantedAccess: 
      - '0x1010'
      - '0x1400'  
      - '0x1fffff'
      - '0x1438'
  filter:
    SourceImage|contains:
       - '*\ProgramData\Microsoft\Windows Defender\Platform\*'   
  condition: selection and not filter
fields:
  - EventID
  - TargetImage
  - GrantedAccess
  - SourceImage
falsepositives:
  - Legitimate monitoring or security tools accessing lsass.exe
level: high
tags:
  - attack.credential_access
  - attack.t1003.001

