title: CRA-E-0003 Suspicious LSASS Access by Task Manager
description: Detects Task Manager (taskmgr.exe) accessing lsass.exe and creating a .dmp file, which may indicate credential dumping activity.
references:
  - https://attack.mitre.org/techniques/T1003/001/
  - https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/blob/master/TA0006-Credential%20Access/T1003-Credential%20dumping/ID11-LSASS%20credentials%20dump%20via%20Task%20Manager.evtx
status: Developed
author: Shahbaz Ahmad
date: 12/11/2024
logsource:
  product: windows
  service: sysmon
detection:
  Selection_lsass_access:
    EventID: 10
    SourceImage|endswith: '\taskmgr.exe'
    TargetImage|endswith: '\lsass.exe'
  Selection_dmp_file_creation:
    EventID: 11
    TargetFilename|endswith: '.dmp'
  condition: Selection_lsass_access and Selection_dmp_file_creation
fields:
  - SourceImage
  - TargetImage
  - TargetFilename
falsepositives:
  - Authorized activity
level: high
tags:
  - attack.credential_access
  - attack.t1003.001
