title: Detects suspicious or unusual access to /etc/shadow
id: 2-etc-ad
status: Experimental
description: Detects unauthorized access attempts to the /etc/shadow file.
references:
  - https://attack.mitre.org/techniques/T1003/008/
  - https://www.techtarget.com/searchsecurity/definition/shadow-password-file
author: Muhammad Asad
date: 2024-11-11
tags:
  - attack.credential-access
  - attack.t1003.008
logsource:
  product: linux
  category: file_access
detection:
  selection:
    TargetFilename: 
    - '/etc/shadow'
    AccessType: 'read'

  suspicious_commands:
    CommandLine|contains:
      - "grep -v root /etc/shadow"
      - "cat /etc/shadow"
      - "awk '{print $1}' /etc/shadow"
      - "john"
      - "hashcat"
      - "hydra"
      - "cracklib"
      - "medusa"

  condition: selection  or  suspicious_commands
  - Legitimate administrative tasks
  - Authorized backup processes
level: high