title: Detects suspicious or unusual access to /etc/passwd
id: 1-etc-ad
status: Developed
description: Detects unauthorized access attempts to the /etc/passwd file.
references:
  - https://attack.mitre.org/techniques/T1003/008/
author: Muhammad Asad
date: 2024-11-11
tags:
  - attack.credential-access
  - attack.t1003.008
logsource:
  product: linux
  category: file_access
detection:
  selection:
    TargetFilename|any: 
    - '/etc/passwd'
    AccessType: 
      - 'read'
      - 'write'
  condition: selection
falsepositives:
  - Legitimate administrative tasks
level: high








