title: Linux Local Groups Permissions Enumeration [Medium]
description: Detects commands used to enumerate local group permissions on Linux.
status: Developed
author: Yuliya Volkova
date: 2024/11/11
modified: 2024/11/12
logsource:
  category: process_creation
  product: linux
  # No ldapsearch because that is covered by DIS-E-1234-Linux_Domain_Local_Group_&_Account_Enumeration_[Medium]
detection:
  selection1:
    image|endswith:
      - "/groups"
  selection2:
    image|endswith:
      - "/cat"
      - "/ed"
      - "/head"
      - "/more"
      - "/nano"
      - "/tail"
      - "/vi"
      - "/vim'
      - "/ls"
      - "/getent"
      - "/groups"
      - "/usr/bin/id"
    commandline|contains|any: # Sensitive file access and enumeration command detection
      - "/etc/group"
      - "getent group"
      - "groups"
      - "id -Gn"
  condition: 1 OF selection* 
fields:
  - Image
  - Commandline
  - User
  - Hostname
falsepositives:
  - System administrators checking user permissions.
  - Automated scripts that verify group permissions for compliance.
level: medium
tags:
  - attack.discovery
  - attack.t1069.001