title: Enumeration for Credentials in Registry
id: 1-cr-re-ad
status: Experimental
description: Detects processes querying known registry keys that store credentials
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.002/T1552.002.md
author: Muhammad Asad
date: 2024-11-12
tags:
  - attack.credential-access
  - attack.t1552.002
logsource:
  category: process_creation
  Platform: windows
  log_source: Security.evtx
detection:
  selection:
    EventID: 4663
    RegistryPath|contains:
      - '\Software\Microsoft\Windows NT\CurrentVersion\Winlogon'
      - '\Software\Microsoft\Windows\CurrentVersion\Internet Settings\Connections'
  suspicious_tools:
    CommandLine|contains:
      - "mimikatz"
      - "powersploit"
      - "seatbelt"
      - "lsassy"
  reg_process:
    EventID: 4688 #process creation
    ProcessName|contains: 
      - reg.exe 
      - regedit.exe 
    CommandLine|contains:
      - '\Software\Microsoft\Windows NT\CurrentVersion\Winlogon'
      - '\Software\Microsoft\Windows\CurrentVersion\Internet Settings\Connections'  
  condition: selection or (selection and suspicious_tools) or reg_process or (reg_process and suspicious_tools)
falsepositives:
  - Legitimate administrative activity
level: high

# whitelist the applications that are allowed to access these registry keys