title: Suspicious AS-REP Roasting Activity Detected
id: 1-asrep-ad
status: Experimental
description: Detects potential AS-REP Roasting activity by monitoring for Kerberos AS-REP responses without preauthentication.
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.002/T1069.002.md#atomic-test-11---get-aduser-enumeration-using-useraccountcontrol-flags-as-rep-roasting
  - https://shellgeek.com/useraccountcontrol-flags-to-manipulate-properties/
author: Muhammad Asad
date: 2024-11-12
tags:
  - attack.credential-access
  - attack.t1558.004
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4768
    Status: '0x0'  # Success
    PreAuthType: 0  # No preauthentication
  condition: selection 
falsepositives:
  - Accounts legitimately configured without preauthentication
level: high
