title: Detect Use of Get-ADReplAccount for Active Directory Enumeration
status: Experimental
description: Detects the use of `Get-ADReplAccount`, often leveraged for Active Directory enumeration and replication-related reconnaissance.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: script
  product: windows
detection:
  selection:
    EventID: 4104
    ScriptBlockText|contains: "Get-ADReplAccount"
  condition: selection
fields:
  - EventID
  - ScriptBlockText
  - UserID
  - Computer
  - LogonID
falsepositives:
  - Legitimate use by system administrators for Active Directory management
  - Security assessments or penetration tests authorized by the organization
level: high
tags:
  - attack.discovery
  - attack.t1018
  - attack.credential_access
