# should be tested
title: Active Directory Replication from Non Machine Account
description: Detects potential abuse of Active Directory Replication Service (ADRS) from a non machine account to request credentials.
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.credential-access
    - T1003.006
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4662
        Properties|contains:
            - '1131f6aa-9c07-11d1-f79f-00c04fc2dcd2'
            - '1131f6ad-9c07-11d1-f79f-00c04fc2dcd2'
            - '89e95b76-444d-4c62-991a-0facbeda640c'
            - '19195a5b-6da0-11d0-afd3-00c04fd930c9'
    condition: selection
fields:
    - ComputerName
    - SubjectDomainName
    - SubjectUserName
falsepositives:
    - Unknown
level: critical
