# needs FP Testing
title: Detect Execution of JScript via cscript
status: Experimental
description: Detects the execution of JScript files using the `cscript` command, commonly used for script execution.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    CommandLine|contains: '.js'
    ParentImage|endswith: 
      - '\cscript.exe'
      - '\wscript.exe'
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - User
  - Hostname
falsepositives:
  - Legitimate use of JScript for administrative or development purposes.
level: medium
tags:
  - attack.execution
  - attack.t1059.007
VQL:
  LET ID_1478 = (
    CommandLine =~ "\\.js" AND
    (ParentImage =~ "\\cscript\\.exe$" OR ParentImage =~ "\\wscript\\.exe$")
  )
