title: Certreq Abuse for Ingress Tool Transfer
description: Detects potential abuse of the certreq utility for downloading tools or payloads during an ingress attack.
status: experimental
author: Arthur Thomas
date: 2024-11-27
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\certreq.exe'
    CommandLine|contains|all:
      - '-submit'
      - '-post'
      - '-config'
      - 'http' # Remote file transfer
      - 'https'
      - 'submit'
      - 'get'
  filter:
    CommandLine|contains:
      - 'certreq -new'  # Legitimate use cases for certreq
  condition: selection and not filter
fields:
  - CommandLine
  - Image
  - ParentImage
  - User
  - ComputerName
falsepositives:
  - Legitimate certificate requests using `certreq.exe` with remote servers.
  - Enterprise-specific certificate configurations.
level: high
tags:
  - attack.t1105  # Ingress Tool Transfer
  - attack.defense_evasion
  - attack.execution
