title: Detect Clearing Command-Line Logs in PowerShell
id: detect-clearing-commandline-logs-powershell
status: Developed
description: Detects attempts to clear PowerShell command-line logs or manipulate logging settings for defense evasion.
author: Amr Ashraf
date: 2024-11-24
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image: '*\powershell.exe'
    CommandLine:
      - '*Clear-History*'
      - '*Remove-EventLog*'
      - '*LogLevel* Off*'
      - '*Clear-Content*'
  condition: selection
fields:
  - Image
  - CommandLine
  - User
  - ParentImage
  - Hostname
level: high
tags:
  - attack.t1070.003
  - attack.defense_evasion
  - detection.powershell
falsepositives:
  - Legitimate administrative tasks using PowerShell
  - Scripts performing routine maintenance
