title: Windows Local System Account Enumeration
description: Detects commands used to enumerate local system accounts on Windows.
status: Developed
author: Yuliya Volkova
date: 2024/11/11
modified: 2024/11/11
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID:
      - '4798'
  selection1:
    NewProcessName|endswith:
      - "\\net.exe"
      - "\\net1.exe"
      - "\\powershell.exe"
      - "\\cmd.exe"
      - "\\wmic.exe"
    CommandLine|contains|any:
      - "net user"                    
      - "net localgroup"            
      - "Get-LocalUser"            
      - "Get-WmiObject -Class Win32_UserAccount"
      - "Get-ADUser"
  condition: selection OR selection1 | count () by Hostname > 5 within 2m 
fields:
  - EventID
  - NewProcessName
  - ParentProcessName
  - User
  - Hostname
  - CommandLine
falsepositives:
  - Routine administrative tasks by IT personnel or system administrators.
  - Compliance and auditing scripts that verify local accounts and configurations.
level: low
tags:
  - attack.discovery
  - attack.t1087.001