title: Detect Process Execution from Alternate Data Streams
id: detect-ads-process-execution
status: Developed
description: Detects process execution from Alternate Data Streams (ADS) in NTFS.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    CommandLine|contains: ':'
  exclusion:
    CommandLine|endswith:
      - ':Zone.Identifier'
      - '::'
      - ':\'
      - ': '
    ParentProcessName|contains:	
      - 'compattelrunner.exe'
  condition: selection and not exclusion
fields:
  - Image
  - CommandLine
  - ParentImage
  - User
level: high
tags:
  - attack.execution
  - attack.persistence
  - detection.process
falsepositives:
  - Rare, as legitimate execution from ADS is uncommon
