title: Detect PowerShell or CMD with Potential Parent PID Spoofing
id: detect-ppid-spoofing
status: Developed
description: Detects PowerShell or CMD processes spawned from anomalous parent processes, indicative of potential Parent PID spoofing.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - EventID: 4688
    - NewProcessName|endswith:
      - '\powershell.exe'
      - '\cmd.exe'
  filter:
    ParentImage|endswith:
      - '\explorer.exe'
      - '\services.exe'
      - '\taskmgr.exe'
      - '\mmc.exe'
  condition: selection and not filter
fields:
  - EventID
  - Image
  - ParentImage
  - ProcessId
  - CommandLine
  - User
  - Hostname
level: high
tags:
  - attack.execution
  - attack.defense_evasion
  - t1134
  - t1055
falsepositives:
  - Debugging or administrative tasks initiated by trusted tools
  - Automated scripts with unconventional parent-child relationships
