title: Detect Executables Running from Suspicious Locations with Anomalous Parent Processes
id: detect-suspicious-executables
status: Developed
description: Detects executables running from suspicious locations with anomalous parent processes, which may indicate privilege escalation or lateral movement.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - EventID: 4688
    - Image|re: 
      - '.*\\AppData\\.*'
      - '.*\\Temp\\.*'
      - '.*\\Downloads\\.*'
      - '.*\\Public\\.*'
      - '.*\\ProgramData\\.*'
    - ParentImage|endswith:
      - '\explorer.exe'
      - '\cmd.exe'
      - '\powershell.exe'
      - '\services.exe'
      - '\taskmgr.exe'
  condition: selection
fields:
  - EventID
  - Image
  - ParentImage
  - ProcessId
  - CommandLine
  - User
  - Hostname
level: high
tags:
  - attack.execution
  - attack.persistence
  - t1059
  - t1203
falsepositives:
  - Legitimate software installers or administrative tasks in temporary directories
