title: LAT-002-C-000-0018-Enable Windows Remote Management (WinRM)
id: lat-002-c-000-0018
status: experimental
description: Detects enabling of Windows Remote Management (WinRM) which could be used to facilitate lateral movement
references:
    - https://attack.mitre.org/techniques/T1021.006/
author: HexaPrime Detection Team
date: 2025/12/13
tags:
    - attack.T1021.006
    - attack.lateral_movement
logsource:
    product: windows
    category: process_creation
detection:
    selection1:
        Image|endswith: '\winrm.exe'
        CommandLine|contains:
            - 'quickconfig'
            - 'set'
            - 'create'
    selection2:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        CommandLine|contains:
            - 'Enable-PSRemoting'
            - 'Set-WSManQuickConfig'
    condition: selection1 or selection2
falsepositives:
    - Legitimate WinRM configuration
    - System administration tasks
    - Enterprise management setup
level: low