# need to test the re
title: Detect PowerShell Downgrading
id: detect-powershell-downgrade
status: Developed
description: Detects attempts to downgrade PowerShell to older versions, such as 1.0 or 2.0, to bypass security features.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|contains: '\powershell.exe'
    CommandLine|re: 
      - '.*-Version\s+1.*'
      - '.*-Version\s+2.*'
      - '.*-V\s+1.*'
      - '.*-V\s+2.*'
      - '.*powershell_ise.*-Version\s+1.*'
      - '.*powershell_ise.*-Version\s+2.*'
  condition: selection
fields:
  - Image
  - CommandLine
  - ParentImage
  - User
  - Hostname
level: high
tags:
  - attack.defense_evasion
  - attack.execution
  - t1562.001
falsepositives:
  - Legitimate administrative scripts using PowerShell 1.0 or 2.0 (rare)
VQL:
  LET ID_1169 = (
    NewProcessName =~ "\\powershell\\.exe" AND
    (
      CommandLine =~ ".*-Version\\s+1.*" OR
      CommandLine =~ ".*-Version\\s+2.*" OR
      CommandLine =~ ".*-V\\s+1.*" OR
      CommandLine =~ ".*-V\\s+2.*" OR
      CommandLine =~ ".*powershell_ise.*-Version\\s+1.*" OR
      CommandLine =~ ".*powershell_ise.*-Version\\s+2.*"
    )
  )
