# Needs FP testing to adjust
title: Detection of Repeated Use of Same Kerberos Ticket from Different IPs
description: Detects when the same Kerberos ticket (TicketID) is used from different IP addresses or machines, indicating potential ticket replay or misuse.
status: Developed
author: Amr Ashraf
logsource:
  category: authentication
  product: windows
detection:
  selection:
    EventID:
      - 4769  # Service Ticket Request
  condition: selection | count() by TicketID, SourceNetworkAddress > 10 within 60m
fields:
  - EventID
  - TargetUserName
  - TicketID
  - SourceNetworkAddress
  - ServiceName
level: high
tags:
  - attack.lateral_movement
  - attack.t1071.001
  - attack.t1136
falsepositives:
  - Legitimate user accessing services from multiple locations in a short time frame (e.g., VPN, remote work).
