title: Kerproas-ticket-request-with-weak-encryption-RC4
description: Detects AS-REP requests for accounts configured without pre-authentication, potentially indicating AS-REP roasting activity.
status: Experimental
author: Amr Ashraf
date: 2024/11/07
logsource:
  category: authentication
  product: windows
detection:
  selection:
    EventID: 4768
    TicketEncryptionType: "0x17" # Commonly used encryption for AS-REP
  condition: selection
fields:
  - TargetUserName
  - TargetUserSid
  - TicketEncryptionType
falsepositives:
  - Certain legitimate service accounts configured without pre-authentication.
level: high
tags:
  - attack.credential_access
  - attack.t1558.004
