title: Kerberoast ticket request detected
description: Detects scenarios where an attacker requests a Kerberoast ticket with low encryption to perform offline brutforce and forge a new ticket to get access to the targeted resource.
tags:
- attack.credential_access
- attack.t1558.003
author: Amr Ashraf
status: Developed
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4769
    TicketEncryptionType: 0x17 # RC4-HMAC
    Status: 0x0 # Success
  filter:
    - ServiceName|endswith: '$'     # Exclude computer account services
  filter_1:
    - ServiceSid|re: 'S-1-5-21-*-0'    # Exclude domain Service
  filter_2:
    - ServiceSid|endswith: '-502'   # Exclude Krbtgt service
  filter_3:
    - TargetUserName|contains: '$@' # Exclude computer accounts requests
  filter_4: 
    - IpAddress:
      - '::1'
      - '127.0.0.1'
  timeframe: 30m 
  condition: selection and not (1 of filter_*) | count(ServiceName) by IpAddress > 5
falsepositives:
- Applications using RC4 encryption (SAP, Azure AD, legacy applications...)
level: high