title: Suspicious Double Extension File Execution
status: stable
description: Detects suspicious use of an .exe extension after a non-executable file extension like .pdf.exe, a set of spaces or underlines to cloak the executable file in spear phishing campaigns
references:
    - https://blu3-team.blogspot.com/2019/06/misleading-extensions-xlsexe-docexe.html
    - https://twitter.com/blackorbird/status/1140519090961825792
tags:
    - attack.initial-access
    - attack.t1566.001
author: Amr Ashraf
logsource:
    category: process_creation (EID 1)
    service: sysmon
    product: windows
detection:
    selection:
        Image|endswith:
            - '.doc.exe'
            - '.docx.exe'
            - '.xls.exe'
            - '.xlsx.exe'
            - '.ppt.exe'
            - '.pptx.exe'
            - '.rtf.exe'
            - '.pdf.exe'
            - '.txt.exe'
            - '      .exe'
            - '______.exe'
            - '.doc.js'
            - '.docx.js'
            - '.xls.js'
            - '.xlsx.js'
            - '.ppt.js'
            - '.pptx.js'
            - '.rtf.js'
            - '.pdf.js'
            - '.txt.js'
        CommandLine|contains:
            - '.doc.exe'
            - '.docx.exe'
            - '.xls.exe'
            - '.xlsx.exe'
            - '.ppt.exe'
            - '.pptx.exe'
            - '.rtf.exe'
            - '.pdf.exe'
            - '.txt.exe'
            - '      .exe'
            - '______.exe'
            - '.doc.js'
            - '.docx.js'
            - '.xls.js'
            - '.xlsx.js'
            - '.ppt.js'
            - '.pptx.js'
            - '.rtf.js'
            - '.pdf.js'
            - '.txt.js'
    condition: selection
falsepositives:
    - Unknown
level: critical

