title: Potential Initial access via OneNote 
status: test
description: Detects Onenote application executing suspicious processes
references:
    - https://mini-01-s3.vx-underground.org/samples/Papers/Windows/Initial%20Access/2023-02-07%20-%20Home%20Grown%20Red%20Team%20-%20Lets%20Make%20Some%20OneNote%20Phishing%20Attachments.pdf
tags:
    - attack.initial_access
    - attack.t1566.001
author: Amr Ashraf
logsource:
    product: windows
    category: process_execution
detection:
    selection:
        Image|contains: 
            - 'powershell.exe'
            - 'pwsh.exe'
            - 'cmd.exe'
    selection_1:
        CommandLine|contains:
            - ".bat"
            - ".cmd"
            - ".js"
    selection_base:
        ParentImage|contains:
            - "onenote.exe"
            - "winword.exe"
            - "excel.exe"
    condition: selection_base and (selection or selection_1)
falsepositives:
    - Unknown
level: medium

