title: Suspicious Execution From Outlook Temporary Folder
status: test
description: Detects a suspicious program execution in Outlook temp folder
references:
    - Internal Research
tags:
    - attack.initial-access
    - attack.t1566.001
author: Amr Ashraf
logsource:
    category: process_creation (EID 1)
    service: sysmon
    product: windows
detection:
    selection:
        Image|contains: '\Temporary Internet Files\Content.Outlook\'
    condition: selection
falsepositives:
    - Unknown
level: high

