title: Windows File Permissions Modification
status: Experimental
description: Detects the use of tools such as `takeown.exe`, or `icacls.exe` to modify file permissions or attributes, which can be used to evade discretionary access control lists (DACLs).
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - NewProcessName: 
        - "takeown.exe"
  selection_1:
    - NewProcessName: 
        - "icacls.exe"
    - CommandLine|contains:
        - "grant"
  condition: selection and selection_1
  
fields:
  - ProcessName
  - CommandLine
  - ParentProcessName
  - ProcessPath
  - User
  - Hostname
level: medium
tags:
  - attack.defense_evasion
  - t1222
falsepositives:
  - Legitimate administrative tasks managing file permissions
  - Authorized use of file permission modification tools