title: Certutil Encode or Decode Commands
status: Experimental
description: Identifies the use of certutil.exe with encode or decode arguments, which may indicate attempts to obfuscate or transfer malicious files.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - EventID: 4688
    - NewProcessName: "certutil.exe"
    - CommandLine|contains: 
        - "decode"
        - "encode"
  condition: selection
fields:
  - ProcessName
  - CommandLine
  - ParentProcessName
  - ProcessPath
  - User
  - Hostname
level: high
tags:
  - attack.defense_evasion
  - attack.execution
  - t1140
falsepositives:
  - Legitimate administrative use of certutil for file management
  - Training or testing scenarios involving encode or decode operations
VQL:
  LET ID_1254 = (
    NewProcessName == "certutil.exe" AND
    CommandLine =~ "(?=.*decode|.*encode)"
  )
