title: Adding the Hidden File Attribute via attrib
status: Developed
description: Detects the use of attrib.exe to add the *hidden* attribute to files. Adversaries can use this technique to hide files and evade detection.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - EventID: 4688
    - NewProcessName: "attrib.exe"
    - CommandLine|contains: "+h"
  condition: selection
fields:
  - ProcessName
  - CommandLine
  - ParentProcessName
  - ProcessPath
  - User
  - Hostname
level: medium
tags:
  - attack.defense_evasion
  - attack.persistence
  - t1158
falsepositives:
  - Legitimate administrative tasks using attrib.exe to manage file attributes
