# may need more filters
title: Suspicious ADS File Creation
status: Experimental
description: Detects suspicious creation or modification of NTFS Alternate Data Streams (ADS), especially those involving `.dll` or `.exe` files.
author: Amr Ashraf
logsource:
  category: file_event
  product: windows
detection:
  selection:
    EventID: 11
    TargetFileName|contains: ":"
    TargetFileName|endswith:
      - ".dll"
      - ".exe"
  filter:
    TargetFileName|contains: ":Zone.Identifier"
  condition: selection and not filter
fields:
  - TargetFileName
  - FilePath
  - FileAccess
  - User
  - Hostname
level: medium
tags:
  - attack.defense_evasion
  - t1096
falsepositives:
  - Legitimate software or administrative actions creating Alternate Data Streams
  - Files created by antivirus or backup software
metadata:
  categories:
    - detect
  confidence: medium
  contributors:
    - Endgame
  created_date: "11/30/2018"
  os:
    - windows
  
