title: Detect Loadable Kernel Module Insertion via insmod
status: Experimental
description: Detects the use of `insmod` to load a kernel module, which can be leveraged for rootkit installation. Kernel module manipulation is a critical indicator of potential compromise.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    Image|endswith: '/insmod'
    CommandLine|contains|all:
      - ".ko"
  selection1:
    Image|endswith: 'modprobe'
  condition: selection
fields:
  - CommandLine
  - Executable
  - ParentExecutable
  - User
  - PID
  - PPID
falsepositives:
  - Legitimate administrative actions, such as installing kernel modules for hardware or software requirements
  - System updates or testing performed by authorized personnel
level: critical
tags:
  - attack.persistence
  - attack.t1014
  - attack.execution
