# FP testing Req
title: Detect Processes Running with Unusual Extensions
status: Experimental
description: Detects processes executing with non-standard or unusual file extensions.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
  selection_1:
    NewProcessName|endswith:
      - '.exe'
  condition: selection and not selection_1
fields:
  - ProcessName
  - CommandLine
  - ParentImage
  - User
  - Hostname
level: high
tags:
  - attack.defense_evasion
  - attack.execution
  - t1036
falsepositives:
  - Legitimate administrative scripts or tools using unusual extensions
  - Rare legitimate software with non-standard extensions
VQL: |
  LET ID_1247 = (
      NewProcessName !~ "\\.exe$"
  )
