title: Unusual Child Process
status: Developed
description: Identifies processes launched with suspicious parent processes, which may indicate malicious behavior or system anomalies.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  Proc_creation:
    EventID: 4688
  selection:
    -NewProcessName: "smss.exe"
  filter:
    -  ParentProcessName|contains:
        - "System"
        - "smss.exe"
  selection1:
    -NewProcessName: "csrss.exe"
  filter1:  
    -  ParentProcessName|contains:
        - "smss.exe"
        - "svchost.exe"
  selection2:
    -NewProcessName: "wininit.exe"
  filter2:
    - ParentProcessName|contains: "smss.exe"
  selection3:
    -NewProcessName: "winlogon.exe"
  filter3:
    - ParentProcessName|contains: "smss.exe"
  selection4:
    -NewProcessName: "lsass.exe"
  filter4:
    - ParentProcessName|contains: "wininit.exe"
  selection5:
    -NewProcessName: "LogonUI.exe"
  filter5:
    - ParentProcessName|contains:
        - "winlogon.exe"
        - "wininit.exe"
  selection6:
    -NewProcessName: "services.exe"
  filter6:
    - ParentProcessName|contains: "wininit.exe"
  selection7:
    -NewProcessName: "svchost.exe"
  filter7: 
    - ParentProcessName|contains:
        - "services.exe"
        - "*\\system32\\svchost.exe"
      ProcessPath: "*\\syswow64\\svchost.exe"
  selection8:
    -NewProcessName: "spoolsv.exe"
  filter8:
    - ParentProcessName|contains: "services.exe"
  selection9:
    -NewProcessName: "taskhost.exe"
  filter9:
    - ParentProcessName|contains:
        - "services.exe"
        - "svchost.exe"
  selection10:
    -NewProcessName: "taskhostw.exe"
  filter10:
    - ParentProcessName|contains:
        - "services.exe"
        - "svchost.exe"
  selection11:
    -NewProcessName: "userinit.exe"
  filter11:
    - ParentProcessName|contains:
        - "dwm.exe"
        - "winlogon.exe"
  condition: Proc_creation and ((selection and filter) or (selection1 and filter1) or (selection2 and filter2) or (selection3 and filter3) or (selection4 and filter4) or (selection5 and filter5) or (selection6 and filter6) or (selection7 and filter7) or (selection8 and filter8) or (selection9 and filter9) or (selection10 and filter10) or (selection11 and filter11))
fields:
  -NewProcessName
  - ParentProcessName
  - ParentProcessPath
  - ProcessPath
  - User
  - Hostname
level: high
tags:
  - attack.defense_evasion
  - attack.execution
  - t1093
  - t1055
falsepositives:
  - Custom or non-standard Windows configurations
  - Legitimate administrative tasks or third-party software behavior
