title: Network Connection Initiated By AddinUtil
status: Developed
description: |
    Detects a network connection initiated by the Add-In deployment cache updating utility "AddInutil.exe".
    This could indicate a potential command and control communication as this tool doesn't usually initiate network activity.
references:
    - https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
author: Amr Ashraf
date: 2024/12/24
tags:
    - attack.defense-evasion
    - attack.t1218
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        Image|endswith: '\addinutil.exe'
        EventID: 3
    condition: selection
falsepositives:
    - Unknown
level: high
