title: Removal Of Index Value to Hide Schedule Task
status: Experimental
description: Detects when the "index" value of a scheduled task is removed or deleted from the registry. Which effectively hides it from any tooling such as "schtasks /query"
references:
    - https://blog.qualys.com/vulnerabilities-threat-research/2022/06/20/defending-against-scheduled-task-attacks-in-windows-environments
author: Amr Ashraf
date: 2024/12/23
tags:
    - attack.defense-evasion
    - attack.t1562
logsource:
    product: windows
    category: registry_delete
detection:
    selection:
        EventID: 12
        EventType: DeleteKey
        TargetObject|contains|all:
            - '\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\'
            - 'Index'
    condition: selection
falsepositives:
    - Unknown
level: medium
