# new value field should be tested
title: Detect Disabling Cryptographic Hardware
status: Experimental
description: Detects attempts to disable cryptographic hardware acceleration, which may weaken encryption and indicate an attacker's attempt to degrade security.
author: Amr Ashraf
logsource:
  category: registry
  product: windows
detection:
  selection:
    - EventID: 4657
    - ObjectName|contains:
        - '\System\CurrentControlSet\Control\Cryptography\Configuration\Local\SSL\00010002\Functions'
      ObjectValueName: 'DisableHardwareAcceleration'
      NewValue: 1
  condition: selection
fields:
  - RegistryPath
  - ValueName
  - ValueType
  - Value
  - User
  - Hostname
level: high
tags:
  - attack.privilege_escalation
  - attack.defense_evasion
  - t1562.001
  - attack.weaken_encryption
falsepositives:
  - Legitimate administrative changes to cryptographic settings.
  - Configuration changes for troubleshooting or compatibility purposes.
