title: Processes with Trailing Spaces
status: Developed
description: Identifies processes running with a trailing space, which can be used to look like an ordinary file while evading default file handlers.
author: Amr Ashraf
logsource:
  category: process_creation
  product: unix
detection:
  selection:
    - ProcessName|endswith: " "
  condition: selection
fields:
  - ProcessName
  - CommandLine
  - ParentProcessName
  - ProcessPath
  - User
  - Hostname
level: medium
tags:
  - attack.defense_evasion
  - attack.execution
  - t1151
falsepositives:
  - Legitimate processes with trailing spaces (rare)
  - Custom scripts or poorly named executables
