title: Detect Compilation of C# Code Using csc
status: Developed
description: Detects the use of `csc.exe` to compile C# code, which may indicate attempts to execute malicious code delivered in source form.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection_csc:
    EventID: 4688
    NewProcessName|endswith: '\csc.exe'
  selection_suspicious_arguments:
    CommandLine|contains:
      - '/out:'
  condition: selection_csc and selection_suspicious_arguments
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate compilation of C# code by developers
  - Authorized administrative or operational tasks involving `csc.exe`
level: high
tags:
  - attack.execution
  - attack.t1027
  - attack.t1027.004
  - attack.t1500
VQL: |
  LET ID_1435 = (
      NewProcessName =~ ".*\\\\csc\\.exe$" AND
      CommandLine =~ ".*\\/out:.*"
  )