title: Created Files by Microsoft Sync Center
status: Experimental
description: This rule detects suspicious files created by Microsoft Sync Center (mobsync)
references:
    - https://redcanary.com/blog/intelligence-insights-november-2021/
author: Amr Ashraf
date: 2024/12/24
tags:
    - attack.t1055
    - attack.t1218
    - attack.execution
    - attack.defense-evasion
logsource:
    product: windows
    category: file_event
detection:
    selection_mobsync:
        Image|endswith: '\mobsync.exe'
        EventID: 11
    filter_created_file:
        TargetFilename|endswith:
            - '.dll'
            - '.exe'
    condition: selection_mobsync and filter_created_file
falsepositives:
    - Unknown
level: medium
