title: Detect Indicator Manipulation Using FSUtil
status: Developed
description: Detects the use of `fsutil` to manipulate file data, such as setting zero data, which can be used to hide malicious activity.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection_command:
    CommandLine|contains|all:
      - 'fsutil'
      - 'file'
      - 'setZeroData'
  selection_image:
    NewProcessName|endswith: '\fsutil.exe'
  condition: selection_command and selection_image
fields:
  - CommandLine
  - Image
  - User
  - ParentImage
falsepositives:
  - Legitimate use of `fsutil` for disk maintenance or troubleshooting.
level: high
tags:
  - attack.defense_evasion
  - attack.t1070.002
