# needs FP testing
title: Detect Execution from Compressed Files
status: Developed
description: Detects the execution of executables directly from compressed files, which may indicate suspicious activity or the use of obfuscated payloads.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection_archive_path:
    EventID: 4688
    CommandLine|contains:
      - '.zip\'
      - '.rar\'
      - '.7z\'
  selection_executable:
    EventID: 4688
    CommandLine|endswith:
      - '.exe'
      - '.dll'
      - '.js'
      - '.vbs'
  condition: selection_archive_path and selection_executable
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate execution of files stored in compressed archives
  - Software developers or administrators testing compressed executables
level: high
tags:
  - attack.execution
  - attack.obfuscation
  - attack.t1059
  - attack.t1027
VQL: |
  LET ID_1427 = (
      (CommandLine =~ ".*\\.zip\\\\" OR CommandLine =~ ".*\\.rar\\\\" OR CommandLine =~ ".*\\.7z\\\\") AND
      (CommandLine =~ ".*\\.exe$" OR CommandLine =~ ".*\\.dll$" OR CommandLine =~ ".*\\.js$" OR CommandLine =~ ".*\\.vbs$")
  )