title: Potential Persistence Via GlobalFlags
description: Detects registry persistence technique using the GlobalFlags and SilentProcessExit keys
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.defense-evasion
    - attack.t1546.012
    - car.2013-01-002
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection_global_flag:
        ObjectName|contains|all:
            - \Microsoft\Windows NT\CurrentVersion\
            - \Image File Execution Options\
            - \GlobalFlag
    selection_silent_process:
        ObjectName|contains|all:
            - \Microsoft\Windows NT\CurrentVersion\
            - \SilentProcessExit\
        ObjectName|contains:
            - \ReportingMode
            - \MonitorProcess
    condition: registry_set and (1 of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
