title: LSA Authentication Package
status: Developed
description: Detects modifications to the LSA Authentication Package registry key, which adversaries can use as an auto-start mechanism for persistence.
author: Amr Ashraf
logsource:
  category: registry
  product: windows
detection:
  selection:
    - Hive: "HKLM"
      RegistryPath|contains: "\\ControlSet\\Control\\Lsa\\Authentication Packages"
  condition: selection
fields:
  - Hive
  - RegistryPath
  - RegistryKey
  - RegistryValue
  - User
  - Hostname
  - Action
level: medium
tags:
  - attack.persistence
  - t1131
falsepositives:
  - Legitimate administrative changes or authorized software installations modifying the LSA Authentication Packages key