title: Potential Persistence Via Logon Scripts - Registry
description: Detects creation of "UserInitMprLogonScript" registry value which can be used as a persistence method by malicious actors
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.t1037.001
    - attack.persistence
    - attack.lateral-movement
logsource:
    category: registry_add
    product: windows
detection:
    registry_add:
        EventID: 4657
        Channel: Security
    selection:
        OperationType: '%%1904'
        ObjectName|contains: UserInitMprLogonScript
    condition: registry_add and selection
falsepositives:
    - Investigate the contents of the "UserInitMprLogonScript" value to determine of the added script is legitimate
level: medium
ruletype: Sigma
