title: Detect Executables Running from Suspicious Locations with Anomalous Parent Processes
id: detect-suspicious-executables
status: Developed
description: Detects executables running from suspicious locations with anomalous parent processes, which may indicate privilege escalation or lateral movement.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - EventID: 4688
    - NewProcessName|contains: 
      - '\Temp\'
      - '\Downloads\'
      - '\Public\'
      - '\ProgramData\'
    - ParentProcessName|endswith:
      - '\cmd.exe'
      - '\powershell.exe'
      - '\services.exe'
      - '\taskmgr.exe'
  condition: selection
VQL: |
    LET ID_1191 = (
        (NewProcessName =~ "(?=.*\\Temp\\|.*\\Downloads\\|.*\\Public\\|.*\\ProgramData\\)") AND
        (ParentProcessName =~ "\\cmd\\.exe$|\\powershell\\.exe$|\\services\\.exe$|\\taskmgr\\.exe$")
    )
fields:
  - EventID
  - Image
  - ParentImage
  - ProcessId
  - CommandLine
  - User
  - Hostname
level: high
tags:
  - attack.execution
  - attack.persistence
  - t1059
  - t1203
falsepositives:
  - Legitimate software installers or administrative tasks in temporary directories
