title: Detect setuid Binary Spawning Root Shell
id: detect-setuid-root-shell
status: Experimental
description: Detects a shell process running as root (UID 0) spawned by a setuid binary.
author: Amr Ashraf
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    EUID: 0
    Image|endswith:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/zsh'
    ParentImage|startswith: '/usr/bin/'  # Common setuid binary paths
  condition: selection
fields:
  - Image
  - ParentImage
  - EUID
  - UID
  - CommandLine
  - Hostname
level: critical
tags:
  - attack.privilege_escalation
  - attack.execution
  - t1068
falsepositives:
  - Custom administrative scripts that spawn root shells intentionally
  - Rare, legitimate uses of setuid binaries
