title: Elevated System Shell Spawned From Uncommon Parent Location
description: Detects when a shell program such as the Windows command prompt or PowerShell is launched with system privileges from a uncommon parent location.
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.execution
    - attack.t1059
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_shell:
        - NewProcessName|endswith:
              - \powershell.exe
              - \pwsh.exe
              - \cmd.exe
    selection_user:
        SubjectLogonId: '0x3e7'
    filter_main_generic:
        ParentProcessName|contains:
            - '\Program Files (x86)\'
            - '\Program Files\'
            - '\ProgramData\'
            - '\Windows\System32\'
            - '\Windows\SysWOW64\'
            - '\Windows\Temp\ '  # Installers
            - '\Windows\WinSxS\'
    filter_optional_manageengine:
        ParentProcessName|endswith: '\ManageEngine\ADManager Plus\pgsql\bin\postgres.exe'
        NewProcessName|endswith: \cmd.exe
    filter_optional_asgard:
        CommandLine|contains: '\WINDOWS\system32\cmd.exe /c '
        CurrentDirectory|contains: '\WINDOWS\Temp\asgard2-agent\'
    filter_optional_ibm_spectrumprotect:
        CommandLine|contains: '\IBM\SpectrumProtect\webserver\scripts\'
        ParentProcessName|contains: '\IBM\SpectrumProtect\webserver\scripts\'
    filter_main_parent_null:
        ParentProcessName: null
    filter_main_parent_empty:
        ParentProcessName: ''
    condition: process_creation and (all of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*)
VQL: |
    LET ID_1185 = (
        (NewProcessName =~ "\\powershell\\.exe$|\\pwsh\\.exe$|\\cmd\\.exe$") AND
        (SubjectLogonId == '0x3e7') AND
        NOT (
            ParentProcessName =~ "(?=.*\\Program Files \\(x86\\)\\|.*\\Program Files\\|.*\\ProgramData\\|.*\\Windows\\System32\\|.*\\Windows\\SysWOW64\\|.*\\Windows\\Temp\\ |.*\\Windows\\WinSxS\\)" OR
            (ParentProcessName =~ "\\ManageEngine\\ADManager Plus\\pgsql\\bin\\postgres\\.exe$" AND NewProcessName =~ "\\cmd\\.exe$") OR
            (CommandLine =~ "(?=.*\\WINDOWS\\system32\\cmd\\.exe /c )" AND CurrentDirectory =~ "(?=.*\\WINDOWS\\Temp\\asgard2-agent\\)") OR
            (CommandLine =~ "(?=.*\\IBM\\SpectrumProtect\\webserver\\scripts\\)" AND ParentProcessName =~ "(?=.*\\IBM\\SpectrumProtect\\webserver\\scripts\\)") OR
            ParentProcessName == null OR
            ParentProcessName == ''
        )
    )
falsepositives:
    - Unknown
level: medium