title: Detect Scheduled Task Creation via PowerShell Cmdlets
status: Developed
description: Detects the use of PowerShell cmdlets such as `New-ScheduledTaskAction` and `Register-ScheduledTask` to create or modify tasks. This can be abused for persistence.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: script
  product: windows
detection:
  selection:
    EventID: 4104
    ScriptBlockText|contains|any:
      - 'New-ScheduledTaskAction'
      - 'Register-ScheduledTask'
      - 'Set-ScheduledTask'
      - 'New-ScheduledTaskTrigger'
  condition: selection
fields:
  - EventID
  - ScriptBlockText
  - UserID
  - Computer
  - LogonID
falsepositives:
  - Legitimate use by administrators or authorized automation tools
level: high
tags:
  - attack.persistence
  - T1053.005
