title: Suspicious Schtasks Schedule Types
description: Detects scheduled task creations or modification on a suspicious schedule type
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.execution
    - attack.t1053.005
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \schtasks.exe
        - OriginalFileName: schtasks.exe
    selection_time:
        CommandLine|contains:
            - ' ONLOGON '
            - ' ONSTART '
            - ' ONCE '
            - ' ONIDLE '
    filter_privs:
        CommandLine|contains:
            - NT AUT   # This covers the usual NT AUTHORITY\SYSTEM
            - ' SYSTEM' # SYSTEM is a valid value for schtasks hence it gets it's own value with space
            - HIGHEST
    condition: process_creation and (all of selection_* and not 1 of filter_*)
falsepositives:
    - Legitimate processes that run at logon. Filter according to your environment
level: high
ruletype: Sigma
