title: Detect SSH Brute Force Attempts on Linux
description: Detects repeated failed SSH login attempts from the same source IP on a Linux server, indicative of brute force.
status: Developed
author: Amr Ashraf
date: 2024/11/03
logsource:
  category: authentication
  product: linux
detection:
  selection:
    SyslogProgram: 'sshd'
    message|re:
      - '*Failed password for*'
      - '*Authentication failure*'
  condition: selection | count() by source_ip > 15 within 1m
fields:
  - source_ip
  - user
  - target_host
  - SyslogProgram
  - message
falsepositives:
  - Users mistyping passwords for SSH access
  - Legitimate automated scripts with incorrect credentials
level: medium
tags:
  - attack.reconnaissance
  - attack.t1110
