title: Detect ACK Scan
description: Detects TCP packets with only the ACK flag set, indicative of an ACK Scan used to map firewall rules.
status: Developed
author: Amr Ashraf
date: 2024/11/03
logsource:
  category: firewall
  product: any
detection:
  selection:
    packet_flags: 'ACK'
  condition: selection | count() by source_ip > 20 within 1m
fields:
  - source_ip
  - dest_ip
  - dest_port
  - packet_flags
falsepositives:
  - Network devices or applications using ACK packets for legitimate traffic patterns
level: medium
tags:
  - attack.reconnaissance
  - attack.t1046
