# Needs to be tested likly will generate FP
title: Suspicious Memory Access on Browser Process
description: Detects unusual memory access on browser processes, which may indicate credential theft or data-stealing malware.
status: Experimental
author: Amr Ashraf
logsource:
  category: process_access
  product: windows
detection:
  selection:
    EventID: 4663
    ObjectName|contains:
      - "\\chrome.exe"
      - "\\firefox.exe"
      - "\\msedge.exe"
    GrantedAccess: "0x1fffff"  # Full access, often associated with memory dumping
  condition: selection
fields:
  - TargetImage
  - GrantedAccess
  - ProcessName
  - AccountName
level: high
tags:
  - attack.credential_access
  - attack.t1003.001  
  - attack.t1055      
