title: SetSPN.exe Usage Detection
description: Detects the execution of SetSPN.exe, commonly used for Service Principal Name management in Active Directory. Suspicious use of SetSPN.exe may indicate enumeration or manipulation attempts for lateral movement or privilege escalation.
status: Developed
author: Amr Ashraf
date: 2024/11/11
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith: '\SetSPN.exe'
  condition: selection
fields:
  - Image
  - CommandLine
  - ParentImage
  - User
level: medium
tags:
  - attack.credential_access
  - T1558.003
falsepositives:
  - Legitimate usage by domain administrators for SPN management tasks.
