# Needs FP testing
title: Detect DNS Zone Transfers in Microsoft DNS Logs
id: detect-dns-zone-transfer-msdns
status: Experimental
description: Detects zone transfer attempts, completions, and denials in Microsoft DNS logs using Event IDs 6522, 6523, and 6527.
author: Amr Ashraf
date: 2024-11-24
logsource:
  category: dns
  product: windows
detection:
  selection:
    EventID:
      - 6522  # Zone transfer started
      - 6523  # Zone transfer completed
      - 6527  # Zone transfer denied
  condition: selection
fields:
  - EventID
  - Message
  - SourceIp
  - DestinationIp
level: high
tags:
  - attack.t1071.001
  - attack.reconnaissance
  - detection.dns
falsepositives:
  - Legitimate zone transfer requests between trusted DNS servers
  - Maintenance or backup processes by authorized admins
