title: Detect Copying of cmd or powershell to Another Location
status: Developed
description: Detects the copying of `cmd.exe` or `powershell.exe` to an unusual location, which could indicate an attempt to bypass security controls or execute unauthorized activities.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    CommandLine|contains|all:
      - 'copy'
      - 'cp'
    CommandLine|contains|any:
      - 'cmd.exe'
      - 'powershell.exe'
  condition: selection
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate administrative tasks copying binaries for troubleshooting
  - Authorized scripts or software performing binary copies
level: high
tags:
  - attack.execution
  - attack.persistence
  - attack.evasion
  - attack.t1218
  - attack.t1059
