title: Detect Suspicious Video Capture or Screen Recording
status: Developed
description: Detects suspicious processes or commands used to capture video or record screens, often indicative of malicious data collection activities.
author: Amr Ashraf
logsource:
  category: process_creation
  Platform: windows
  log_source: Security.evtx
detection:
  selection1:
    - EventID: 4688
    - NewProcessName|endswith:
        - '\powershell.exe'
      CommandLine|contains:
        - 'mciSendString'
        - 'Get-Process *Camera*'
  selection2:
    - EventID: 4688
    - NewProcessName|endswith:
        - '\ffmpeg.exe'
      CommandLine|contains:
        - '-video_size'
        - '-i video='
        - '-f dshow'
  selection3:
    - EventID: 4688
    - NewProcessName|endswith:
        - '\obs64.exe'
      CommandLine|contains:
        - '--startrecording'
        - '--recording'
  selection4:
    - EventID: 4688
    - NewProcessName|endswith:
        - '\vlc.exe'
      CommandLine|contains:
        - '--sout'
        - '--screen-fps'
  condition: selection1 or selection2 or selection3 or selection4
fields:
  - NewProcessName
  - CommandLine
level: high
tags:
  - attack.collection
  - attack.t1125
falsepositives:
  - Legitimate screen recording, video conferencing, or administrative tasks.
  - Debugging or troubleshooting tools used by IT or developers.
triage:
  - Verify the process and command line arguments to confirm if the activity is legitimate or suspicious.
  - Check the user context under which the process was executed.
  - Investigate the source and intent of the process execution.
  - Correlate with other security events to identify potential malicious activity.

