title: DFE-002-E-000-0005-Masquerading - powershell.exe running as taskhostw.exe
id: dfe-002-e-000-0005
status: experimental
description: Detects powershell.exe masquerading as taskhostw.exe which could indicate defense evasion
references:
    - https://attack.mitre.org/techniques/T1036.003/
author: HexaPrime Detection Team
date: 2025/12/13
tags:
    - attack.T1036.003
    - attack.defense_evasion
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith: '\taskhostw.exe'
        OriginalFileName: 'PowerShell.EXE'
    filter:
        Image|startswith: 'C:\Windows\System32\'
    condition: selection and not filter
falsepositives:
    - Legitimate renamed applications
    - Software deployment processes
level: high