title: Brute Force One User Multiple Passwords
description: Detects multiple failed logon attempts for a single user with different passwords, which could indicate a brute-force attack targeting a single user account.
status: Experimental
author: Amr Ashraf
date: 2024/11/11
logsource:
  category: authentication
  product: windows
detection:
  selection:
    EventID: 4625  
  aggregation:
    group_by:
      - TargetUserName
    count(FailureReason) by TargetUserName > 5 within 1m
  condition: selection and aggregation
fields:
  - EventID
  - TargetUserName
  - FailureReason
  - IpAddress
  - AccountName
  - AuthenticationPackageName
level: high
tags:
  - attack.credential_access
  - attack.t1110.001 
falsepositives:
  - Account lockout policies that trigger multiple failed attempts in a short period (e.g., after password reset attempts).
