title: Detect AS-REP Roasting Attempt via Kerberos TGT Request
description: Detects AS-REP requests for accounts configured without pre-authentication, potentially indicating AS-REP roasting activity.
status: Experimental
author: Amr Ashraf
date: 2024/11/07
logsource:
  category: authentication
  product: windows
detection:
  selection:
    EventID: 4768
    TicketOptions: "0x40810000"  # Indicates no pre-authentication
  condition: selection
fields:
  - TargetUserName
  - TargetUserSid
  - TicketEncryptionType
falsepositives:
  - Certain legitimate service accounts configured without pre-authentication.
level: high
tags:
  - attack.credential_access
  - attack.t1558.004
