title: Detect High Volume of AS-REP Requests (Potential Roasting)
description: Detects a high volume of AS-REP requests within a short time frame, potentially indicating AS-REP roasting.
status: Developed
author: Amr Ashraf
date: 2024/11/07
logsource:
  category: authentication
  product: windows
detection:
  selection:
    EventID: 4768
    TicketOptions: "0x40810000"
  timeframe: 5m
  condition: selection | count(TargetUserName) by EventID > 10  
fields:
  - TargetUserName
  - SourceAddress
  - TicketOptions
falsepositives:
  - High authentication activity due to legitimate administrative tasks or user logins.
level: high
tags:
  - attack.credential_access
  - attack.t1558.004
