title: NTDS.dit Access or Export via Ntdsutil with ESENT Events
description: Detects NTDS.dit access or export attempts via ntdsutil along with related ESENT events for detailed tracking of database interactions.
status: 
author: Shunaid Shafique
logsource:
  product: windows
  service: security , Application
detection:
  ntdsutil_access:
    EventID: 4688
    NewProcessName|contains: 'ntdsutil.exe'
    CommandLine|contains|all:
      - 'ntds'
      - 'ntdsutil'
      - 'export'
  esent_events:
    EventID:
      - 474  # ESENT database access issue (for potential access to NTDS.dit)
      - 477  # ESENT database detach event, possibly indicating export or access attempts
      - 489  # ESENT database logging or integrity issue, associated with NTDS access
      - 216  # ESENT A Database location change was detected 
      - 352  # The Database engine created a new database
      - 326  # the database engine attached a database 
      - 327  # the database engine detached a database 
  condition: ntdsutil_access or esent_events
fields:
  - EventID
  - CommandLine
  - NewProcessName
falsepositives:
  - Routine Active Directory maintenance using ntdsutil or ESENT-related database operations
level: high
tags:
  - attack.credential_access
  - attack.discovery
  - attack.t1003.003
  - attack.t1078
