title: Windows Groups Enumeration via LDAP [Medium]
description: Detects possible Active Directory group enumeration via LDAP.
# Requires Microsoft-Windows-LDAP-Client/Debug ETW logging to function
status: Developed
author: Yuliya Volkova
date: 2024/11/20
modified: 2024/11/20
logsource:
  category: ldap_query
  product: windows
detection:
  selection1:
    # eventID: # Possible to detect with network traffic if configured on client end 
    #  - "30"
    searchFilter|contains|any:
      - "(groupType:1.2.840.113556.1.4.803:=2147483648)" # Security-enabled universal groups
      - "(groupType:1.2.840.113556.1.4.803:=2147483656)" # Security-enabled global groups
      - "(groupType:1.2.840.113556.1.4.803:=2147483652)" # Security-enabled domain-local groups
      - "(groupType:1.2.840.113556.1.4.803:=2147483650)" # Distrubution groups
      - "(objectCategory=group)"
      - "(objectClass=group)"
      - "(primaryGroupID=512)" # Domain Admins group (AD) 
      - "Domain Admins"
  exclusion: # Exclude known service accounts or automated scripts
    user|contains|any: 
      - "tenable"
    user|endswith:
      - "$"
    searchFilter|contains:
      - "(domainSid=*)" # Matches queries specifying a domain security identifier (SID) to exclude narrow queries aimed at identifying domains, as they may be benign
      - "(objectSid=*)" # Matches queries specifying object security identifiers (SIDs) to exclude narrow object-specific queries that are less likely to indicate enumeration 
  condition: selection1 AND NOT exclusion
fields:
  - EventID
  - ProcessID
  - NewProcessName
  - ParentProcessID
  - ParentProcessName
  - ParentImage
  - Image
  - User
  - Hostname
  - Commandline
  - CreationUTCTime
falsepositives:
  - System administrators checking group permissions.
  - Automated scripts that verify group permissions for compliance.
level: medium
tags:
  - attack.discovery
  - attack.t1069.001
  - attack.t1069.002