title: Windows Domain Account Enumeration
description: Detects commands used to enumerate domain accounts on Windows.
status: Experimental
author: Yuliya Volkova
date: 2024/11/12
modified: 2024/11/12
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: # For commands
    - "4688"
    Commandline|contains:
      - "net user /domain"
      - "net group /domain"
      - "Get-ADUser"
      - "Search-ADAccount"
      - "Get-ADGroupMember"
      - "dsquery user"
      - "adfind -b"
  selection1: # For PowerShell scriptblocks
    EventID: 
      - "4104"
    ScriptBlockText|contains:
      - "Get-ADUser"
      - "Search-ADAccount"
      - "Get-ADGroupMember"
  exclusion:
    User|contains: # Check against any service accounts which are authorized to perform local account enumeration to reduce rule fatigue
      - "$"
      - "tenable"
  condition: (selection OR selection1) AND NOT exclusion | count () by Commandline > 3 within 5m 
fields:
  - EventID
  - ProcessID
  - NewProcessName
  - ParentProcessID
  - ParentProcessName
  - ParentImage
  - Image
  - User
  - Hostname
  - Commandline
  - CreationUTCTime
falsepositives:
  - Routine administrative tasks by IT personnel or system administrators.
  - Compliance and auditing scripts that verify domain accounts and configurations.
level: low
tags:
- attack.account_discovery
- attack.t1087.002