title: Windows Local System Account Enumeration
description: Detects commands used to enumerate local system accounts on Windows.
status: Experimental
author: Yuliya Volkova
date: 2024/11/11
modified: 2024/11/12
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID:
      - '4798'
  selection1:
    Commandline|contains:
      - "net user"
      - "net localgroup"
      - "Get-LocalUser"
      - "Get-WmiObject -Class Win32_UserAccount"
      - "Get-ADUser"
  exclusion:
    User|contains: # Check against any service accounts which are authorized to perform local account enumeration to reduce rule fatigue
      - "$"
      - "tenable"
  condition: (selection OR selection1) AND NOT exclusion | count () by Commandline > 3 within 5m 
fields:
  - EventID
  - ProcessID
  - NewProcessName
  - ParentProcessID
  - ParentProcessName
  - ParentImage
  - Image
  - User
  - Hostname
  - Commandline
  - CreationUTCTime
falsepositives:
  - Routine administrative tasks by IT personnel or system administrators.
  - Compliance and auditing scripts that verify local accounts and configurations.
level: low
tags:
  - attack.account_discovery
  - attack.t1087.001
