title: Linux Local System Account Enumeration
description: Detects commands used to enumerate local system accounts on Linux.
status: Experimental
author: Yuliya Volkova
date: 2024/11/11
modified: 2024/11/12
logsource:
  category: process_creation
  product: linux
detection:
  selection1:
    Image|endswith: 
      - '/lastlog' # Need to check logging in client
  selection2:
    CommandLine|contains: 
      - '''x:0:'''
  selection3:
    Image|endswith:
      - '/cat'
      - '/ed'
      - '/head'
      - '/more'
      - '/nano'
      - '/tail'
      - '/vi'
      - '/vim'
    Commandline|contains:
      - '/etc/passwd'
      - '/etc/shadow'
      - '/etc/sudoers'
  selection4:
      Image|endswith: 
      - '/id'
  selection5:
      Image|endswith: 
      - '/lsof'
      Commandline|contains: 
      - '-u'
  condition: 1 of selection* # Does not require exclusion at this point in time
fields:
  - Image
  - Commandline
  - User
  - Hostname
falsepositives:
  - Routine administrative tasks by IT personnel or system administrators.
  - Compliance and auditing scripts that verify local accounts and configurations.
level: medium
tags:
  - attack.account_discovery
  - attack.t1087.001
