title: Windows Domain Account Enumeration
description: Detects commands used to enumerate domain accounts on Windows.
status: Developed
author: Yuliya Volkova
date: 2024/11/12
modified: 2024/11/12
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    eventID: 
    - "4688" 
    commandline|contains|any: # Commandline
      - "net user /domain"
      - "net group /domain"
      - "Search-ADAccount"
      - "dsquery user"
      - "adfind -b"
  selection2: 
    EventID: 
      - "800" # PowerShell native
      - "4103" # PowerShell modern
      - "4104" # PowerShell scriptblock
    ScriptBlockText|contains|any:
      - "Get-ADUser"
      - "Search-ADAccount"
      - "Get-ADGroupMember"
  exclusion:
    User|contains|any: # Check against any service accounts which are authorized to perform local account enumeration to reduce rule fatigue
      - "$"
      - "tenable"
  condition: (selection OR selection1) AND NOT exclusion | count () by Commandline > 3 within 5m 
fields:
  - EventID
  - ProcessID
  - NewProcessName
  - ParentProcessID
  - ParentProcessName
  - ParentImage
  - Image
  - User
  - Hostname
  - Commandline
  - CreationUTCTime
falsepositives:
  - Routine administrative tasks by IT personnel or system administrators.
  - Compliance and auditing scripts that verify domain accounts and configurations.
level: low
tags:
- attack.account_discovery
- attack.t1087.002