title: Windows Domain Groups Permissions Enumeration
description: Detects commands used to enumerate domain group permissions on Windows.
status: Experimental
author: Yuliya Volkova
date: 2024/11/12
modified: 2024/11/12
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    Commandline|contains:
      - "get-ADPrincipalGroupMembership"
      - "Find-LocalAdminAccess"
      - "Invoke-EnumerateLocalAdmin"
      - "Find-GPOComputerAdmin"
      - "get-aduser -f * -pr DoesNotRequirePreAuth"
      - "Get-AdGroup"
      - "Get-DomainGroup"
      - "adsisearcher"
      - "useraccountcontrol"
      - "Get-DomainGroup"
      - "net group"
      - "net localgroup"
  selection1:
    Image|endswith:
      - "ldifde.exe"
      - "adfind.exe"
  exclusion:
    User|contains: # Check against any service accounts which are authorized to perform local account enumeration to reduce rule fatigue
      - "$"
      - "tenable"
  condition: (selection OR selection1) AND NOT exclusion | count () by Commandline > 3 within 5m 
fields:
  - EventID
  - ProcessID
  - NewProcessName
  - ParentProcessID
  - ParentProcessName
  - ParentImage
  - Image
  - User
  - Hostname
  - Commandline
  - CreationUTCTime
falsepositives:
  - System administrators checking user permissions.
  - Automated scripts that verify group permissions for compliance.
level: low
tags:
  - attack.discovery
  - attack.t1069.002
