title: Windows Local System Account Enumeration [Medium]
description: Detects commands used to enumerate local system accounts on Windows.
status: Developed
author: Yuliya Volkova
date: 2024/11/11
modified: 2024/11/20
logsource:
  category:
  - process_creation
  - ps_module
  - ps_classic_script
  - ps_script
  product: windows
detection:
  selection1:
    eventID:
      - '4688'
    commandline|contains|any: #Commandline
      - "net user"
  selection2:
    eventID:
      - "800" # PowerShell native
      - "4103" # PowerShell modern
      - "4104" # PowerShell scriptblock
    commandline|contains|any:
      - "Get-LocalUser"
      - "Get-WmiObject -Class Win32_UserAccount"
      - "Get-ADUser"
  exclusion: # Exclude known service accounts or automated scripts
    user|contains|any: 
      - "tenable"
    user|endswith:
      - "$"
  condition: (selection1 OR selection2) AND NOT exclusion
fields:
  - EventID
  - ProcessID
  - NewProcessName
  - ParentProcessID
  - ParentProcessName
  - ParentImage
  - Image
  - User
  - Hostname
  - Commandline
  - CreationUTCTime
falsepositives:
  - Routine administrative tasks by IT personnel or system administrators.
  - Compliance and auditing scripts that verify local accounts and configurations.
level: medium
tags:
  - attack.account_discovery
  - attack.t1087.001