title: Potential Pass-the-Ticket Attack
description: Detects potential Pass-the-Ticket attacks by identifying TGS requests or TGT renewals without a corresponding TGT request from the same account/client pair
status: Experimental
references: https://blog.netwrix.com/2022/09/28/how-to-detect-pass-the-ticket-attacks/
author: Arthur Thomas
date: 11/11/2024
logsource:
product: windows
service: security
detection:
selection:
EventID: - 4769  # A Kerberos service ticket was requested
         - 4770  # A Kerberos service ticket was renewed
filter:
EventID: 4768  #A Kerberos authentication ticket (TGT) was requested
TimeFrame: 10h
condition: selection and not filter
falsepositives:
 - Legitimate TGT requests that occurred outside the 10-hour window
 - Misconfigured systems or network issues causing authentication anomalies
level: medium
tags:
 - attack.lateral_movement
 - attack.t1550.003