title: Suspicious RDP File Activity 
status:Developed
description: Detects potential RDP-related malicious activities, including suspicious Mstsc.exe execution and RDP file creation by Outlook.
author: Arthur Thomas
date: 14/11/2024
logsource:
  product: windows
  category: 
    - process_creation
    - file_event
detection:
  # Suspicious Mstsc.exe Execution
  selection_mstsc_img:
    - Image|endswith: '\mstsc.exe'
    - OriginalFileName: mstsc.exe
  selection_mstsc_extension:
    CommandLine|endswith:
      - .rdp
      - .rdp"
  selection_mstsc_paths:
    CommandLine|contains:
      - ':\Users\Public\'
      - ':\Windows\System32\spool\drivers\color'
      - ':\Windows\System32\Tasks_Migrated '
      - ':\Windows\Tasks\'
      - ':\Windows\Temp\'
      - ':\Windows\Tracing\'
      - '\AppData\Local\Temp\'
      - '\Downloads\'

  # RDP File Creation by Outlook
  selection_outlook_process:
    Image|endswith: '\OUTLOOK.EXE'
  selection_outlook_extension:
    TargetFilename|endswith: '.rdp'
  selection_outlook_location:
    - TargetFilename|contains:
        - '\AppData\Local\Packages\Microsoft.Outlook_'
        - '\AppData\Local\Microsoft\Olk\Attachments\'
    - TargetFilename|contains|all:
        - '\AppData\Local\Microsoft\Windows\'
        - '\Content.Outlook\'
 
        condition: (all of selection_mstsc_*) OR (all of selection_outlook_*)
falsepositives:
  - Legitimate use of RDP files in trusted locations
  - Legitimate sharing of RDP connection files via email
  - Opening of RDP file attachments from trusted sources
level: high
fields:
  - EventID
  - Image
  - CommandLine
  - TargetFilename
  - User
tags:
  - attack.command-and-control
  - attack.t1219
  - attack.initial_access
  - attack.t1566.001
  - attack.execution
  - attack.t1204.002
  - attack.defense_evasion