title: Detect Permission and Group Enumeration via Script Blocks
status: Developed
description: Detects suspicious PowerShell script blocks used for permission and group enumeration, leveraging commands like `Get-ADUser`, `Get-ADPrincipalGroupMembership`, and PowerView cmdlets.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: powershell
  product: windows
detection:
  selection:
    EventID: 4104
    ScriptBlock|contains:
      - 'Get-ADPrincipalGroupMembership'
      - 'Find-LocalAdminAccess'
      - 'Invoke-EnumerateLocalAdmin'
      - 'Find-GPOComputerAdmin'
      - 'Get-DomainGroup'
      - 'Get-DomainGroupMember'
      - 'DoesNotRequirePreAuth'
    condition: selection
fields:
  - ScriptBlock
  - HostName
  - User
  - ParentImage
  - Path
falsepositives:
  - Administrative use of PowerShell for group or permission management.
level: high
tags:
  - attack.discovery
  - attack.t1069.002
  - attack.t1557.002
