# Test For FP
title: Password Policy Enumerated
description: Detects when the password policy is enumerated.
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.discovery
    - attack.t1201
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4661 # A handle to an object was requested.
        AccessList|contains: '%%5392' # ReadPasswordParameters
        ObjectServer: 'Security Account Manager'
    condition: selection
level: medium
