# needs testing
title: Reconnaissance Activity
description: Detects activity as "net user administrator /domain" and "net group domain admins /domain"
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.discovery
    - attack.t1087.002
    - attack.t1069.002
    - attack.s0039
logsource:
    product: windows
    service: security
    definition: The volume of Event ID 4661 is high on Domain Controllers and therefore "Audit SAM" and "Audit Kernel Object" advanced audit policy settings are not configured in the recommendations for server systems
detection:
    security:
        Channel: Security
    selection:
        EventID: 4661
        AccessMask: '0x2d'
        ObjectType:
            - SAM_USER
            - SAM_GROUP
            - SAM_DOMAIN
        ObjectName|startswith: S-1-5-21-
        ObjectName|endswith:
            - '-500'
            - '-512'
    condition: security and selection
falsepositives:
    - Administrator activity
level: high

