title: Detect Metadata Manipulation for Alternate Data Streams
id: detect-ads-metadata
status: Developed
description: Detects manipulation of file metadata indicating ADS usage.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image:
      - '*\streams.exe'
      - '*\powershell.exe'
    CommandLine|contains: ':'
  filter:
    CommandLine|contains:
      - '::'
      - ":\\"
    ParentProcessName|contains:	
      - 'compattelrunner.exe'
  condition: selection and not filter
fields:
  - Image
  - CommandLine
  - ParentImage
  - User
level: medium
tags:
  - attack.persistence
  - detection.metadata
falsepositives:
  - Legitimate administrative actions (e.g., inspecting files with streams.exe)
