title: Detect PowerShell Access to Alternate Data Streams
id: detect-powershell-ads
status: Developed
description: Detects attempts to read or write Alternate Data Streams (ADS) using PowerShell.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image: 
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: ':'
  exclusion:
    CommandLine|contains: 
      - 'Zone.Identifier'
      - '::'
      - ":\"
  condition: selection and not exclusion
fields:
  - Image
  - CommandLine
  - ParentImage
  - User
level: high
tags:
  - attack.persistence
  - attack.defense_evasion
  - detection.powershell
falsepositives:
  - Legitimate administrative tasks
