#Need to check how DNS logs looks like in LR
title: Connection to Commonly Abused Web Services
description: Identifies processes outside known legitimate locations communicating with commonly abused web services, which can be used for command and control (C2) or exfiltration.
status: Developed
date: 2024-12-01
author: Amr Ashraf
logsource:
  category: network_connection
  product: windows
detection:
  suspicious_connection:
    dns_question_name|contains:
      - 'raw.githubusercontent.'
      - 'pastebin.'
      - 'drive.google.com'
      - '.onedrive.org'
      - '.ngrok.io'
      - '.discordapp.com'
      - '.slack.com'
      - '.api.telegram.org'
      - '.cdn.discordapp.com'
      - 'transfer.sh'
      - '.sharepoint.com'
      - 'graph.microsoft.com'
      - '.zulipchat.com'
      - '.dropbox.com'
      - '.gofile.io'
      - '.file.io'
      - 'api.notion.com'
      - '.t.me'
  allowed_processes:
    process_executable:
      - 'C:\\Program Files\\*.exe'
      - 'C:\\Program Files (x86)\\*.exe'
      - 'C:\\Windows\\System32\\*.exe'
    process_name:
      - 'Discord.exe'
      - 'Dropbox.exe'
      - 'Microsoft.SharePoint.exe'
      - 'Obsidian.exe'
      - 'Slack.exe'
  condition: suspicious_connection and not allowed_processes
fields:
  - process_name
  - dns_question_name
  - parent_process_name
  - user_id
  - host_name
falsepositives:
  - Legitimate usage of services like Discord, Dropbox, or Slack
  - Authorized administrative or development activities
level: low
tags:
  - attack.command_and_control
  - attack.exfiltration
  - attack.T1102
  - attack.T1568
  - attack.T1568.002
  - attack.T1567
  - attack.T1567.001
  - attack.T1567.002
