title: Potential Persistence Via Logon Scripts - CommandLine
description: Detects the addition of a new LogonScript to the registry value "UserInitMprLogonScript" for potential persistence
status: Experimental
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.persistence
    - attack.t1037.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: UserInitMprLogonScript
    condition: process_creation and selection
falsepositives:
    - Legitimate addition of Logon Scripts via the command line by administrators or third party tools
level: high
VQL:
  LET ID_1123 = (
      CommandLine =~ "(?=.*UserInitMprLogonScript)"
  )

