title: Detect Modifications to Port Monitor Registry Keys
id: detect-port-monitor-registry-modification
status: Experimental
description: Detects suspicious modifications to Windows registry keys related to port monitors, indicating potential persistence mechanisms.
author: Amr Ashraf
logsource:
  category: registry
  product: windows
detection:
  selection:
    EventID: 4657  # Registry modification
    ObjectName|contains:
      - 'HKLM\SYSTEM\CurrentControlSet\Control\Print\Monitors\'
    RegistryValueName: 'Driver'
  condition: selection
fields:
  - ObjectName
  - RegistryValueName
  - User
  - ComputerName
  - NewValue
level: high
tags:
  - attack.persistence
  - attack.privilege_escalation
  - t1547.010
falsepositives:
  - Legitimate printer driver installations or updates
