title: Path To Screensaver Binary Modified
status: Developed
description: Detects value modification of registry key containing path to binary used as screensaver.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.002/T1546.002.md
    - https://www.welivesecurity.com/wp-content/uploads/2017/08/eset-gazer.pdf
author: Amr Ashraf
date: 2024/12/23
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1546.002
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        EventID: 
            - 13
            - 12
        TargetObject|endswith: '\Control Panel\Desktop\SCRNSAVE.EXE' # HKEY_CURRENT_USER\Control Panel\Desktop\SCRNSAVE.EXE
    filter:
        EventID: 
            - 12
            - 13
        Image|endswith:
            - '\rundll32.exe'
            - '\explorer.exe'
    condition: selection and not filter
falsepositives:
    - Legitimate modification of screensaver
level: medium
