title: Detect Additions to the Startup Folder
id: detect-startup-folder-additions
status: Experimental
description: Detects suspicious file additions to the Windows Startup folder.
author: Amr Ashraf
logsource:
  category: file_event
  product: windows
detection:
  selection:
    EventID: 4663  # File creation event
    ObjectName|contains:
      - '%AppData%\Microsoft\Windows\Start Menu\Programs\Startup'
      - '%ProgramData%\Microsoft\Windows\Start Menu\Programs\Startup'
    Access: '0x2' # write
  condition: selection
fields:
  - ObjectName
  - Access
  - User
  - ComputerName
level: high
tags:
  - attack.persistence
  - attack.execution
  - t1547.001
falsepositives:
  - Legitimate application installations
