title: Logon Scripts with UserInitMprLogonScript
status: Developed
description: Detects modifications to the Windows logon script path stored in `HKCU\Environment\UserInitMprLogonScript`, potentially indicating persistence mechanisms. The rule also triggers when a user logs in and this logon script executes.
author: Amr Ashraf
logsource:
  category: registry
  product: windows
detection:
  selection:
    - EventID: 4657
    - ObjectName|contains: '\Environment\UserInitMprLogonScript'
  condition: selection
fields:
  - RegistryPath
  - RegistryKey
  - RegistryValue
  - User
  - Hostname
  - Action
level: medium
tags:
  - attack.persistence
  - t1037
falsepositives:
  - Legitimate administrative changes to logon scripts
  - Authorized software modifying this registry key