title: Installation of Security Support Provider
status: Developed
description: Detects modifications to registry keys related to the Windows Security Support Provider (SSP) configuration, which may indicate attempts to establish persistence.
author: Amr Ashraf
logsource:
  category: registry
  product: windows
detection:
  selection:
    - EventID: 4657
    - ObjectName|contains:
        - '\SYSTEM\CurrentControlSet\Control\Lsa\Security Packages'
        - '\SYSTEM\CurrentControlSet\Control\Lsa\OSConfig\Security Packages'
  condition: selection
fields:
  - RegistryPath
  - RegistryKey
  - RegistryValue
  - User
  - Hostname
  - Action
level: medium
tags:
  - attack.persistence
  - t1101
falsepositives:
  - Legitimate administrative modifications to SSP configuration
  - Authorized system or software updates
