title: Installing Custom Shim Databases
status: Developed
description: Detects the installation of custom Application Compatibility Shim databases, which attackers may use for persistence or privilege escalation.
author: Amr Ashraf
logsource:
  category: registry
  product: windows
detection:
  selection:
    - EventID: 4657
    - ObjectName|contains: 
      - '\SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\Custom\'
      - '.sdb'
  filter1:
      ProcessName|contains: 'sdbinst.exe'
  filter2:
      ParentProcessName|contains: 'msiexec.exe'
  condition: selection and not (filter1 or filter2)
fields:
  - RegistryPath
  - RegistryKey
  - RegistryValue
  - RegistryData
  - ProcessName
  - ParentProcessName
  - User
  - Hostname
  - Action
level: medium
tags:
  - attack.persistence
  - attack.privilege_escalation
  - t1138
falsepositives:
  - Legitimate administrative installation of custom shim databases
  - Authorized software installations modifying compatibility settings