title: Potential Persistence Via Logon Scripts
status: Developed
description: Detects creation of "UserInitMprLogonScript" registry value which can be used as a persistence method by malicious actors
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1037.001/T1037.001.md
author: Amr Ashraf
date: 2024/12/23
tags:
    - attack.t1037.001
    - attack.persistence
    - attack.lateral-movement
logsource:
    category: registry_add
    product: windows
detection:
    selection:
        EventID: 12
        EventType: CreateKey
        TargetObject|contains: 'UserInitMprLogonScript'
    condition: selection
falsepositives:
    - Investigate the contents of the "UserInitMprLogonScript" value to determine of the added script is legitimate
level: medium
