title: Active Directory Certificate Services Denied Certificate Enrollment Request
description: |
    Detects denied requests by Active Directory Certificate Services.
    Example of these requests denial include issues with permissions on the certificate template or invalid signatures.
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.credential-access
    - attack.t1553.004
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: 'Microsoft-Windows-CertificationAuthority'
        EventID: 53
    condition: selection
falsepositives:
    - Unknown
level: low