title: Pandemic Registry Key
status: test
description: Detects Pandemic Windows Implant
references:
    - https://wikileaks.org/vault7/#Pandemic
    - https://twitter.com/MalwareJake/status/870349480356454401
tags:
    - attack.command-and-control
    - attack.t1105
author: Amr Ashraf
logsource:
    category: registry_event (EID 12,13,14)
    service: sysmon
    product: windows
detection:
    selection:
        TargetObject|contains: '\SYSTEM\CurrentControlSet\services\null\Instance'
    condition: selection
falsepositives:
    - Unknown
level: critical

