title: Potential DLL File Download Via PowerShell Invoke-WebRequest
status: test
description: Detects potential DLL files being downloaded using the PowerShell Invoke-WebRequest cmdlet
references:
    - https://www.zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution
tags:
    - attack.command-and-control
    - attack.execution
    - attack.t1059.001
    - attack.t1105
author: Amr Ashraf
logsource:
    product: windows
    category: process_creation (EID 1)
    service: sysmon
detection:
    selection:
        CommandLine|contains:
            - 'Invoke-WebRequest '
            - 'IWR '
        CommandLine|contains|all:
            - 'http'
            - 'OutFile'
            - '.dll'
    condition: selection
falsepositives:
    - Unknown
level: medium

