title: Suspicious Extrac32 Execution
status: test
description: Download or Copy file with Extrac32
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Extrac32/
tags:
    - attack.command-and-control
    - attack.t1105
author: Amr Ashraf
logsource:
    category: process_creation (EID 1)
    service: sysmon
    product: windows
detection:
    selection_lolbas:
        - CommandLine|contains: extrac32.exe
        - Image|endswith: '\extrac32.exe'
    selection_archive:
        CommandLine|contains: '.cab'
    selection_options:
        CommandLine|contains:
            - /C
            - /Y
            - ' \\\\'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium

