title: Suspicious Certreq Command to Download
status: test
description: Detects a suspicious certreq execution taken from the LOLBAS examples, which can be abused to download (small) files
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Certreq/
tags:
    - attack.command-and-control
    - attack.t1105
author: Amr Ashraf
logsource:
    category: process_creation (EID 1)
    service: sysmon
    product: windows
detection:
    selection_img:
        - Image|endswith: '\certreq.exe'
    selection_cli:
        CommandLine|contains|all:
            - ' -Post '
            - ' -config '
            - ' http'
            - ' C:\windows\win.ini '
    condition: all of selection*
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unlikely
level: high

