title: Obfuscated PowerShell OneLiner Execution
status: test
description: Detects the execution of a specific OneLiner to download and execute powershell modules in memory.
references:
    - https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
    - https://gist.github.com/mgeeky/3b11169ab77a7de354f4111aa2f0df38
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1059.001
    - attack.t1562.001
author: Amr Ashraf
logsource:
    product: windows
    category: process_creation (EID 1)
    service: sysmon
detection:
    selection:
        Image|endswith: '\powershell.exe'
        CommandLine|contains|all:
            - 'http://127.0.0.1'
            - '%{(IRM $_)}'
            - '.SubString.ToString()[67,72,64]-Join'
            - 'Import-Module'
    condition: selection
falsepositives:
    - Unknown
level: high

