title: Potential Reconnaissance Activity Via GatherNetworkInfo.VBS
status: test
description: Detects execution of the built-in script located in "C:\Windows\System32\gatherNetworkInfo.vbs". Which can be used to gather information about the target machine
references:
    - https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs
    - https://www.mandiant.com/resources/blog/trojanized-windows-installers-ukrainian-government
tags:
    - attack.discovery
    - attack.execution
    - attack.t1615
    - attack.t1059.005
author: Amr Ashraf
logsource:
    category: process_creation (EID 1)
    service: sysmon
    product: windows
detection:
    selection_img:
        - Image|endswith:
              - '\cscript.exe'
              - '\wscript.exe'
    selection_cli:
        CommandLine|contains: 'gatherNetworkInfo.vbs'
    condition: all of selection_*
falsepositives:
    - Administrative activity
level: medium

