title: Shell Execution via Rsync - Linux
status: experimental
description: |
    Detects the use of the "gcc" utility to execute a shell. Such behavior may be associated with privilege escalation, unauthorized command execution, or to break out from restricted environments.
references:
    - https://gtfobins.github.io/gtfobins/rsync/#shell
tags:
    - attack.execution
    - attack.t1059
author: Amr Ashraf
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith: '/rsync'
        CommandLine|contains: ' -e '
    selection_cli:
        CommandLine|contains:
            - 'sh 0<&2 1>&2'
            - 'sh 1>&2 0<&2'
    selection_null:
        CommandLine|contains: '/dev/null'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high

