title: System Disk And Volume Reconnaissance Via Wmic.EXE
status: test
description: |
    An adversary might use WMI to discover information about the system, such as the volume name, size,
    free space, and other disk information. This can be done using the `wmic` command-line utility and has been
    observed being used by threat actors such as Volt Typhoon.
references:
    - https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-144a
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wmic
tags:
    - attack.execution
    - attack.discovery
    - attack.t1047
    - attack.t1082
author: Amr Ashraf
logsource:
    category: process_creation (EID 1)
    service: sysmon
    product: windows
detection:
    selection_img:
        - Image|endswith: '\WMIC.exe'
    selection_cli:
        CommandLine|contains:
            - 'volume'
            - 'path win32_logicaldisk'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium

