title: Exports Critical Registry Keys To a File
status: test
description: Detects the export of a crital Registry key to a file.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Regedit/
    - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
tags:
    - attack.exfiltration
    - attack.t1012
author: Amr Ashraf
logsource:
    category: process_creation (EID 1)
    service: sysmon
    product: windows
detection:
    selection_img:
        - Image|endswith: 
            - '\regedit.exe'
            - '\reg.exe'
    selection_cli_1:
        CommandLine|contains|windash: ' -E '
    selection_cli_2:
        CommandLine|contains:
            - 'hklm'
            - 'hkey_local_machine'
    selection_cli_3:
        CommandLine|endswith:
            - '\system'
            - '\sam'
            - '\security'
    condition: all of selection_*
fields:
    - ParentImage
    - CommandLine
falsepositives:
    - Dumping hives for legitimate purpouse i.e. backup or forensic investigation
level: high

