title: Detect Granting Admin Privileges to Guest Account
status: Developed
description: Detects the addition of the Guest account to the Administrators group, which may indicate privilege escalation.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    CommandLine|contains|all:
      - 'net'
      - 'localgroup'
      - 'Administrators' 
      - 'guest'
  condition: selection
fields:
  - CommandLine
  - User
  - ParentImage
  - Hostname
falsepositives:
  - Legitimate administrative actions adding the Guest account to the Administrators group.
level: critical
tags:
  - attack.privilege_escalation
  - T1078.001
  - T1098
VQL:
  LET ID_1500 = (
      CommandLine =~ "(?=.*net)(?=.*localgroup)(?=.*Administrators)(?=.*guest)"
  )
