title: Detect Domain Account Manipulation Using PowerShell
status: Experimental
description: Detects PowerShell script blocks used to create domain accounts and add them to high-privilege groups.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: script_block_logging
  product: windows
detection:
  selection_account_creation:
    EventID: 4104
    ScriptBlock|contains:
      - 'New-ADUser'
  selection_group_addition:
    ScriptBlock|contains|all:
      - 'Add-ADGroupMember'
      - 'Domain Admins'
  condition: selection_account_creation or selection_group_addition
fields:
  - ScriptBlock
  - User
  - HostApplication
  - ParentCommandLine
falsepositives:
  - Legitimate administrative tasks using Active Directory PowerShell module.
level: high
tags:
  - attack.persistence
  - T1136.002
