title: Detect Account Manipulation 
status: Experimental
description: Detects suspicious PowerShell script blocks used to rename or modify administrator account details.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: script_block_logging
  product: windows
detection:
  selection:
    EventID: 4104
    ScriptBlock|contains:
      - 'Rename-LocalUser'
      - 'Set-LocalUser'
      - 'atr:'
  condition: selection
fields:
  - ScriptBlock
  - User
  - HostApplication
  - ParentCommandLine
falsepositives:
  - Legitimate administrative scripts modifying local accounts.
level: medium
tags:
  - attack.persistence
  - T1136.001
