title: User Account Creation
status: Developed
description: Detects the creation of local users via the `net.exe` or `net1.exe` command, a tactic often used for persistence or credential access.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    - NewProcessName:
        - 'net.exe'
        - 'net1.exe'
    - CommandLine|contains:
        - 'user'
        - '/ad'
  filter:
    - ParentProcessName|contains: 'net.exe'
  condition: selection and not filter
fields:
  - ProcessName
  - CommandLine
  - ParentProcessName
  - ProcessPath
  - User
  - Hostname
level: medium
tags:
  - attack.persistence
  - attack.credential_access
  - t1136
falsepositives:
  - Legitimate administrative creation of user accounts
  - Authorized IT or system scripts creating accounts
VQL:
  LET ID_1293 = (
      (NewProcessName =~ "(?=.*net\\.exe|.*net1\\.exe)" AND
      CommandLine =~ "(?=.*user)(?=.*\\/ad)") AND
      NOT (ParentProcessName =~ "(?=.*net\\.exe)")
  )
