title: Detect Volume Shadow Copy Creation via PowerShell
status: Developed
description: Detects the use of PowerShell to create a Volume Shadow Copy using the Get-WmiObject (gwmi) command and the win32_shadowcopy class.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    Image|endswith: '\powershell.exe'
    CommandLine|contains|all:
      - "win32_shadowcopy"
      - ".Create("
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - ParentCommandLine
  - User
falsepositives:
  - Legitimate use by administrators for system backups or troubleshooting
  - Automated scripts for creating backups
level: critical
tags:
  - attack.credential_access
  - attack.t1003.003
  - attack.persistence
  - attack.discovery
