title: Detect DiskShadow Script Execution
status: Developed
description: Detects the use of `diskshadow.exe` with a script file (`/s`), often used to manage Volume Shadow Copies and potentially access sensitive files.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    Image|endswith: '\diskshadow.exe'
    CommandLine|contains: "/s"
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - ParentCommandLine
  - User
falsepositives:
  - Legitimate administrative use of `diskshadow.exe` for backups or maintenance
  - Authorized scripts for managing Volume Shadow Copies
level: critical
tags:
  - attack.credential_access
  - attack.t1003.003
  - attack.persistence
  - attack.discovery
