title: Detect Suspicious Video Capture or Screen Recording
status: Developed
description: Detects suspicious processes or commands used to capture video or record screens, often indicative of malicious data collection activities.
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection_processes:
    - EventID: 4688
    - ProcessName|endswith:
        - '\powershell.exe'
      CommandLine|contains:
        - 'mciSendString'
        - 'Get-Process *Camera*'
    - ProcessName|endswith:
        - '\ffmpeg.exe'
      CommandLine|contains:
        - '-video_size'
        - '-i video='
        - '-f dshow'
    - ProcessName|endswith:
        - '\obs64.exe'
      CommandLine|contains:
        - '--startrecording'
        - '--recording'
    - ProcessName|endswith:
        - '\vlc.exe'
      CommandLine|contains:
        - '--sout'
        - '--screen-fps'
  condition: selection_processes
fields:
  - ProcessName
  - CommandLine
level: high
tags:
  - attack.collection
  - attack.execution
  - t1125
  - defense.evasion
falsepositives:
  - Legitimate screen recording, video conferencing, or administrative tasks.
  - Debugging or troubleshooting tools used by IT or developers.
