title: Local Job Scheduling Process
status: Developed
description: Detects the execution of job scheduling processes, such as `cron`, `at`, and `launchd`, on Linux and macOS systems. These may be used to create pre-scheduled and periodic background jobs, potentially indicating persistence or execution attempts.
author: Amr Ashraf
logsource:
  category: process_creation
  product: unix
detection:
  selection:
    - ProcessName:
        - "cron"
        - "at"
        - "launchd"
  condition: selection
fields:
  - ProcessName
  - CommandLine
  - ParentProcessName
  - ProcessPath
  - User
  - Hostname
level: medium
tags:
  - attack.execution
  - attack.persistence
  - t1168
falsepositives:
  - Legitimate administrative or maintenance tasks