title: Detect Data Exfiltration Using curl
status: Developed
description: Detects the use of `curl` to upload files, which could indicate potential data exfiltration to external services like `file.io`.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection_curl_upload:
    EventID: 4688
    NewProcessName|endswith: '\curl.exe'
    CommandLine|contains|all:
      - '-F '
      - 'file=@'
  condition: selection_curl_upload
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
falsepositives:
  - Legitimate file uploads by administrators or automated tasks
  - Authorized usage of `curl` for application integration or testing
level: critical
tags:
  - attack.exfiltration
  - attack.command_and_control
  - attack.t1071.001
  - attack.t1048.002
