title: Outlook Home Page Registry Modification
description: Detects modifications to registry keys associated with abuse of the Outlook Home Page functionality, which adversaries can exploit for persistence or command and control.
status: Developed
date: 2024-12-01
author: Amr Ashraf
logsource:
  category: registry_event
  product: windows
detection:
  selection:
    registry_path:
      - "HKCU\\SOFTWARE\\Microsoft\\Office\\*\\Outlook\\Webview\\Inbox\\URL"
      - "HKEY_USERS\\SOFTWARE\\Microsoft\\Office\\*\\Outlook\\Webview\\Inbox\\URL"
      - "HKU\\SOFTWARE\\Microsoft\\Office\\*\\Outlook\\Webview\\Inbox\\URL"
      - "\\REGISTRY\\USER\\*\\SOFTWARE\\Microsoft\\Office\\*\\Outlook\\Webview\\Inbox\\URL"
      - "USER\\SOFTWARE\\Microsoft\\Office\\*\\Outlook\\Webview\\Inbox\\URL"
    registry_value: "URL"
    registry_data: "*http*"
  condition: selection
fields:
  - registry_path
  - registry_value
  - registry_data
  - host_name
  - user_name
falsepositives:
  - Legitimate software updating or modifying Outlook Home Page settings
level: medium
tags:
  - attack.persistence
  - attack.command_and_control
  - attack.T1137
  - attack.T1137.004
