title: Potential Remote Desktop Tunneling Detected
description: Detects the potential use of SSH utilities to establish RDP over a reverse SSH Tunnel, which attackers can use to bypass network restrictions.
status: Developed
date: 2024-12-01
author: Amr Ashraf
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    CommandLine|contains:
      - ':3389'
  selection_1:
    CommandLine|contains:
      - '-L'
      - '-P'
      - '-R'
      - '-pw'
      - '-ssh'
  condition: selection and selection_1
fields:
  - process_name
  - process_path
  - command_line
  - user_id
  - parent_process_name
  - parent_process_id
falsepositives:
  - Legitimate use of SSH utilities for administrative purposes
  - Authorized tunneling for legitimate IT support operations
level: high
tags:
  - attack.command_and_control
  - attack.lateral_movement
  - attack.T1572
  - attack.T1021
  - attack.T1021.004
