title: Detect Sensitive Data exfiltration over Email
status: Developed
description: Detects the use of PowerShell to exfiltrate sensitive data embedded in a VBA macro file via email using the `Send-MailMessage` cmdlet.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection_mail_command:
    EventID: 4688
    NewProcessName|endswith|any:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains|all:
      - 'Send-MailMessage'
      - '-Attachments'
  condition: selection_mail_command
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate use of PowerShell for sending emails in authorized workflows
  - Automation scripts using `Send-MailMessage` for notifications or alerts
level: critical
tags:
  - attack.exfiltration
  - attack.command_and_control
  - attack.t1027
  - attack.t1041
