# Needs FP testing for whitelisting "don't deploy"
title: NTLM Auth
description: Logged when NTLM authentication is used usually for local accounts but NTLM can also be used with domain accounts. The original event title says it is only generated on domain controllers but that is not true. This also gets logged on clients.
status: Experimental
author: Amr Ashraf
date: 2024/11/11
logsource:
    product: windows
    service: security
detection:
    selection:
        Channel: Security
        EventID: 4776
    condition: selection
falsepositives:
    - normal system usage