# Needs FP testing for whitelisting "don't deploy"
title: Pass the Hash Activity
description: Detects the attack technique pass the hash which is used to move laterally inside the network
status: Developed
author: Amr Ashraf
date: 2024/11/11
tags:
    - attack.lateral-movement
    - attack.t1550.002
logsource:
    product: windows
    service: security
    definition: The successful use of PtH for lateral movement between workstations would trigger event ID 4624
detection:
    security:
        Channel: Security
    selection_logon3:
        EventID: 4624
        SubjectUserSid: S-1-0-0
        LogonType: 3
        LogonProcessName: NtLmSsp
        KeyLength: 0
    selection_logon9:
        EventID: 4624
        LogonType: 9
        LogonProcessName: seclogo
    filter:
        TargetUserName: ANONYMOUS LOGON
    condition: security and (1 of selection_* and not filter)
falsepositives:
    - Administrator activity
level: medium
