title: PowerShell Remove-Item File Deletion - DFE-004-E-000-0013
id: DFE-004-E-000-0013
status: experimental
description: |
  Detection Description:
  Detects PowerShell Remove-Item File Deletion.
  
  Status:
  experimental
  
  Threat Mapping:
  MITRE ATT&CK Technique(s): T1070 – Indicator Removal
  Kill Chain Phase: Defense Evasion
  
  Data Sources:
  MITRE Data Source: Command: Command Execution
  Product targeted by the Rule: Windows Server
  Service in the product that provides the log: powershell
  
  Detection Logic:
  See Sigma detection section.
  
  False Positive Considerations:
  See falsepositives section.
  
  Severity and Risk Rating:
  Severity Level: Medium
  
  References:
  See references section.
  
  Author:
  HXP Detection team
  
  Use Case Sheet Details:
  - L3 use cases per L2: 19
  - L1 Use Case Name: Defence Evasion
  - L1 Use Case Identifier: DFE
  - L2 Use Case Name: Indicator Removal on Host
  - L2 Use Case Identifier: DFE-004
  - Rule Identifier: DFE-004-E-000-0013
  - Technical Use Case Name: PowerShell Remove-Item File Deletion
  - Use Case Description:
  - Log source type: Windows Servers
  - Detection Technology: SIEM
  - Scope: All assets
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/
tags:
  - attack.defense_evasion
  - attack.t1070
logsource:
  product: windows
  service: powershell
  category: ps_script
detection:
  \
          selection:
            ScriptBlockText|contains:
              - 'Remove-Item'
          condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
