title: Linux Touch Command Timestomping - DFE-004-E-000-0017
id: DFE-004-E-000-0017
status: experimental
description: |
  Detection Description:
  Detects Linux Touch Command Timestomping.
  
  Status:
  experimental
  
  Threat Mapping:
  MITRE ATT&CK Technique(s): T1070.006 – Timestomp
  Kill Chain Phase: Defense Evasion
  
  Data Sources:
  MITRE Data Source: Process: Process Creation
  Product targeted by the Rule: Linux Server
  Service in the product that provides the log: auditd
  
  Detection Logic:
  See Sigma detection section.
  
  False Positive Considerations:
  See falsepositives section.
  
  Severity and Risk Rating:
  Severity Level: Medium
  
  References:
  See references section.
  
  Author:
  HXP Detection team
  
  Use Case Sheet Details:
  - L3 use cases per L2: 19
  - L1 Use Case Name: Defence Evasion
  - L1 Use Case Identifier: DFE
  - L2 Use Case Name: Indicator Removal on Host
  - L2 Use Case Identifier: DFE-004
  - Rule Identifier: DFE-004-E-000-0017
  - Technical Use Case Name: Linux Touch Command Timestomping
  - Use Case Description:
  - Log source type: Linux Servers
  - Detection Technology: SIEM
  - Scope: All assets
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/techniques/T1070/006/
tags:
  - attack.defense_evasion
  - attack.t1070.006
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  \
          selection:
            exe|endswith: '/touch'
            a1:
              - '-t'
              - '-r'
              - '--reference'
          condition: selection
falsepositives:
  - Legitimate file timestamp adjustments during packaging/build pipelines
level: medium
