title: Windows Security Event Log Cleared - DFE-004-E-000-0001
id: DFE-004-E-000-0001
status: experimental
description: |
  Detection Description:
  Detects Windows Security Event Log Cleared.
  
  Status:
  experimental
  
  Threat Mapping:
  MITRE ATT&CK Technique(s): T1070.001 – Clear Windows Event Logs
  Kill Chain Phase: Defense Evasion
  
  Data Sources:
  MITRE Data Source: Windows Event Logs: Security
  Product targeted by the Rule: Windows Server
  Service in the product that provides the log: security
  
  Detection Logic:
  See Sigma detection section.
  
  False Positive Considerations:
  See falsepositives section.
  
  Severity and Risk Rating:
  Severity Level: High
  
  References:
  See references section.
  
  Author:
  HXP Detection team
  
  Use Case Sheet Details:
  - L3 use cases per L2: 19
  - L1 Use Case Name: Defence Evasion
  - L1 Use Case Identifier: DFE
  - L2 Use Case Name: Indicator Removal on Host
  - L2 Use Case Identifier: DFE-004
  - Rule Identifier: DFE-004-E-000-0001
  - Technical Use Case Name: Windows Security Event Log Cleared
  - Use Case Description:
  - Log source type: Windows Servers
  - Detection Technology: SIEM
  - Scope: All assets
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/techniques/T1070/001/
tags:
  - attack.defense_evasion
  - attack.t1070.001
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 1102
  condition: selection
falsepositives:
  - Authorized administrators clearing logs during maintenance (should be rare)
level: high
