title: Volume Shadow Copy Deletion - DFE-004-E-000-0015
id: DFE-004-E-000-0015
status: experimental
description: |
  Detection Description:
  Detects Volume Shadow Copy Deletion.
  
  Status:
  experimental
  
  Threat Mapping:
  MITRE ATT&CK Technique(s): T1490 – Inhibit System Recovery
  Kill Chain Phase: Defense Evasion
  
  Data Sources:
  MITRE Data Source: Process: Process Creation
  Product targeted by the Rule: Windows Server
  Service in the product that provides the log: sysmon
  
  Detection Logic:
  See Sigma detection section.
  
  False Positive Considerations:
  See falsepositives section.
  
  Severity and Risk Rating:
  Severity Level: High
  
  References:
  See references section.
  
  Author:
  HXP Detection team
  
  Use Case Sheet Details:
  - L3 use cases per L2: 19
  - L1 Use Case Name: Defence Evasion
  - L1 Use Case Identifier: DFE
  - L2 Use Case Name: Indicator Removal on Host
  - L2 Use Case Identifier: DFE-004
  - Rule Identifier: DFE-004-E-000-0015
  - Technical Use Case Name: Volume Shadow Copy Deletion
  - Use Case Description:
  - Log source type: Windows Servers
  - Detection Technology: SIEM
  - Scope: All assets
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/techniques/T1490/
tags:
  - attack.defense_evasion
  - attack.t1490
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  \
          selection_vssadmin:
            Image|endswith: '\vssadmin.exe'
            CommandLine|contains|all:
              - 'delete'
              - 'shadows'
          selection_wbadmin:
            Image|endswith: '\wbadmin.exe'
            CommandLine|contains|all:
              - 'delete'
              - 'catalog'
          condition: selection_vssadmin or selection_wbadmin
falsepositives:
  - Backup/DR testing scripts
  - Authorized admin managing shadow copies
level: high
