title: Event Log Registry Tampering - DFE-004-E-000-0007
id: DFE-004-E-000-0007
status: experimental
description: |
  Detection Description:
  Detects Event Log Registry Tampering.
  
  Status:
  experimental
  
  Threat Mapping:
  MITRE ATT&CK Technique(s): T1070.001 – Clear Windows Event Logs
  Kill Chain Phase: Defense Evasion
  
  Data Sources:
  MITRE Data Source: Registry: Registry Modification
  Product targeted by the Rule: Windows Server
  Service in the product that provides the log: sysmon
  
  Detection Logic:
  See Sigma detection section.
  
  False Positive Considerations:
  See falsepositives section.
  
  Severity and Risk Rating:
  Severity Level: Medium
  
  References:
  See references section.
  
  Author:
  HXP Detection team
  
  Use Case Sheet Details:
  - L3 use cases per L2: 19
  - L1 Use Case Name: Defence Evasion
  - L1 Use Case Identifier: DFE
  - L2 Use Case Name: Indicator Removal on Host
  - L2 Use Case Identifier: DFE-004
  - Rule Identifier: DFE-004-E-000-0007
  - Technical Use Case Name: Event Log Registry Tampering
  - Use Case Description:
  - Log source type: Windows Servers
  - Detection Technology: SIEM
  - Scope: All assets
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/techniques/T1070/001/
tags:
  - attack.defense_evasion
  - attack.t1070.001
logsource:
  product: windows
  service: sysmon
  category: registry_set
detection:
  \
          selection:
            EventID: 13
            TargetObject|contains: '\SYSTEM\CurrentControlSet\Services\EventLog\'
          selection_values:
            TargetObject|endswith:
              - '\MaxSize'
              - '\Retention'
              - '\AutoBackupLogFiles'
              - '\File'
          condition: selection and selection_values
falsepositives:
  - Legitimate event log configuration changes by IT/SecOps
  - GPO-driven event log settings
level: medium
