title: Detect Default Account Activity
status: Experimental
description: Detects suspicious activity involving default accounts, which may indicate exploitation or misuse of default credentials.
author: Amr Ashraf
logsource:
  category: authentication
  product: windows
detection:
  selection:
    - TargetUserName|contains:
        # - 'administrator' this could create FPs in environments wher  Admins are using Local Admin
        - 'guest'
        - 'test'
    - TargetDomainName|contains: 'WORKGROUP'
    - EventID:
        - 4624  # Successful logon
        - 4625  # Failed logon
        - 4720  # User account creation
        - 4722  # User account enabled
  condition: selection and not filter
fields:
  - EventID
  - TargetUserName
  - TargetDomainName
  - LogonType
  - WorkstationName
  - IpAddress
  - ProcessName
level: medium
tags:
  - attack.credential_access
  - attack.persistence
  - t1078.001
falsepositives:
  - Legitimate administrative activity using default accounts.
  - Scheduled tasks or service accounts with similar names.
