title: Hiding Files with Attrib
description: Detects usage of attrib.exe to hide files from users.
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.defense-evasion
    - attack.t1564.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \attrib.exe
    selection_cli:
        CommandLine|contains: ' +h '
    filter_main_msiexec:
        CommandLine|contains: '\desktop.ini '
    filter_optional_1:
        CommandLine|contains|re: '+R +H +S +A \\\*.cui'
    filter_optional_2:
        ParentCommandLine|contains|re: 'C:\\WINDOWS\\system32\\\*.bat'
    filter_optional_3:
        ParentProcessName|endswith: '\cmd.exe'
    condition: process_creation and (all of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*)
falsepositives:
    - IgfxCUIService.exe hiding *.cui files via .bat script (attrib.exe a child of cmd.exe and igfxCUIService.exe is the parent of the cmd.exe)
    - Msiexec.exe hiding desktop.ini
level: medium