title: Detect Windows Internal Packet Capture Using netsh trace
status: Experimental
description: Detects the use of `netsh trace start` to perform internal packet capture, which may indicate network reconnaissance or unauthorized monitoring.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection_netsh_trace:
    EventID: 4688
    NewProcessName|endswith: '\netsh.exe'
    CommandLine|contains|re|all:
      - 'trace *start'
      - 'capture=yes'
      - 'tracefile='
  condition: selection_netsh_trace
fields:
  - EventID
  - CommandLine
  - Image
  - ParentImage
  - User
  - LogonID
falsepositives:
  - Legitimate use of `netsh trace` by administrators for troubleshooting
  - Security audits or tests involving network capture
level: high
tags:
  - attack.discovery
  - attack.collection
  - attack.t1040
  - attack.t1020
VQL: |
  LET ID_1444 = (
      NewProcessName =~ "\\netsh\\.exe$" AND
      CommandLine =~ "(?=.*trace *start|.*capture=yes|.*tracefile=)"
  )
