title: Conti NTDS Exfiltration Command
status: test
description: Detects a command used by conti to exfiltrate NTDS
references:
    - https://twitter.com/vxunderground/status/1423336151860002816?s=20
    - https://www.virustotal.com/gui/file/03e9b8c2e86d6db450e5eceec057d7e369ee2389b9daecaf06331a95410aa5f8/detection
tags:
    - attack.collection
    - attack.t1560
    - detection.emerging-threats
author: Amr Ashraf
logsource:
    category: process_creation (EID 1)
    service: sysmon
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - '7za.exe'
            - '\\C$\\temp\\log.zip'
    condition: selection
falsepositives:
    - Unknown
level: high

