title: Potential Password Reconnaissance Via Findstr.EXE
status: test
description: Detects command line usage of "findstr" to search for the "passwords" keyword in a variety of different languages
references:
    - https://steflan-security.com/windows-privilege-escalation-credential-harvesting/
    - https://adsecurity.org/?p=2288
tags:
    - attack.credential-access
    - attack.t1552.001
    - detection.threat-hunting
author: Amr Ashraf
logsource:
    category: process_creation (EID 1)
    service: sysmon
    product: windows
detection:
    selection_img:
        - Image|endswith: '\findstr.exe'
    selection_cli:
        CommandLine|contains:
            - 'passw'
            - '.bak'
            - 'secret'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium

