title: UAC Bypass Using .NET Code Profiler on MMC
status: test
description: Detects the pattern of UAC Bypass using .NET Code Profiler and mmc.exe DLL hijacking (UACMe 39)
references:
    - https://github.com/hfiref0x/UACME
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
author: Amr Ashraf
logsource:
    category: file_event (EID 11)
    service: sysmon
    product: windows
detection:
    selection:
        TargetFilename|startswith: 'C:\Users\'
        TargetFilename|endswith: '\AppData\Local\Temp\pe386.dll'
    condition: selection
falsepositives:
    - Unknown
level: high

