title: Detect LSA Secrets Dumping via reg save
status: Developed
description: Detects the use of PsExec to execute `reg save` for dumping LSA secrets from the Windows registry to a file.
author: Amr Ashraf
date: 2024-12-06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    Image|endswith: '\reg.exe'
    CommandLine|contains|all:
      - "save"
      - 'HKLM\\security\\policy\\secrets'
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - ParentCommandLine
  - User
falsepositives:
  - Legitimate administrative or forensic tasks using `reg save`
  - Backup or disaster recovery processes
level: critical
tags:
  - attack.credential_access
  - attack.t1003.004
  - attack.execution
  - attack.discovery
