title: Suspicious Access to LSA Registry Secrets
description: Detects suspicious access to LSA secrets in the Windows registry, which could indicate an attempt to steal credentials.
status: Developed
author: Amr Ashraf
date: 2024/11/11
logsource:
  category: registry
  product: windows
detection:
  selection:
    Key:
      - "HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa"
      - "HKLM\\SECURITY\\Policy\\Secrets"
  filter_whitelist:
    ProcessName:
      - 'C:\\Windows\\System32\\services.exe'
      - 'C:\\Windows\\System32\\lsass.exe'
  condition: selection and not filter_whitelist
fields:
  - EventID
  - Key
  - ProcessName
  - AccountName
  - TargetUserSid
level: high
tags:
  - attack.credential_access
  - attack.t1003.003
falsepositives:
  - Legitimate administrative tools accessing LSA secrets for legitimate purposes.
