title: Registry Dump of SAM Creds and Secrets
description: Adversaries may attempt to extract credential material from the Security Account Manager (SAM) database either through Windows Registry where the SAM database is stored
status: Developed
author: Amr Ashraf
date: 2024/11/09
tags:
    - attack.credential-access
    - attack.t1003.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_reg:
        CommandLine|contains: 
            - ' save '
            - ' export '
    selection_key:
        CommandLine|contains:
            - HKLM\sam
            - HKLM\system
            - HKLM\security
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high

