title: Windows SeDebugPrivilege Enabled - PRE-006-E-000-0003
id: PRE-006-E-000-0003
status: experimental
description: |
  Detection Description:
  Detects Windows SeDebugPrivilege Enabled.
  
  Status:
  experimental
  
  Threat Mapping:
  MITRE ATT&CK Technique(s): T1068 – Exploitation for Privilege Escalation
  Kill Chain Phase: Privilege Escalation
  
  Data Sources:
  MITRE Data Source: Process: Process Creation
  Product targeted by the Rule: Windows Server
  Service in the product that provides the log: Security
  
  Detection Logic:
  See Sigma detection section.
  
  False Positive Considerations:
  See falsepositives section.
  
  Severity and Risk Rating:
  Severity Level: High
  
  References:
  See references section.
  
  Author:
  HXP Detection team
  
  Use Case Sheet Details:
  - L3 use cases per L2: 3
  - L1 Use Case Name: Privilege Escalation
  - L1 Use Case Identifier: PRE
  - L2 Use Case Name: Privileged Configuration Abuse
  - L2 Use Case Identifier: PRE-006
  - Rule Identifier: PRE-006-E-000-0003
  - Technical Use Case Name: Windows SeDebugPrivilege Enabled
  - Use Case Description:
  - Log source type: Windows Servers
  - Detection Technology: SIEM
  - Scope: All assets
author: HXP Detection team
date: 2025-12-13
references:
  - https://attack.mitre.org/techniques/T1068/
tags:
  - attack.privilege_escalation
  - attack.t1068
logsource:
  category: process_creation
  product: windows
  service: security
detection:
\
          selection:
            EventID: 4672
          privileges:
            PrivilegeList|contains:
              - 'SeDebugPrivilege'
          condition: selection and privileges
falsepositives:
  - Legitimate administrative activity
level: high
