title: Log Cleared
description: A user has cleared the Security event log.
status: Developed
author: Amr Ashraf
date: 2024/11/09
level: high
logsource:
    product: windows
    service: security
detection:
    selection_basic:
        Channel: Security
        EventID: 1102
    condition: selection_basic
falsepositives:
    - system administrator
tags:
    - attack.defense_evasion
    - attack.t1070.001
references:
    - https://attack.mitre.org/techniques/T1070/001/
